{
    "2025-05-08": [
        {
            "title": "Apple has a new ‘Viral’ playlist on Apple Music and Shazam",
            "description": "Apple is launching a new global Viral Chart playlist in Apple Music that consists of tracks people are discovering through the company’s Shazam service. The playlist, which is updated daily, shows the top 50 songs people have heard playing out in the real wor…",
            "source": "The Verge",
            "url": "https://www.theverge.com/news/663866/apple-music-viral-charts-global-playlist-shazam-top-50",
            "publishedAt": "2025-05-08T21:01:29Z"
        },
        {
            "title": "Apple asks court to halt App Store rule changes while it appeals",
            "description": "Apple asked a judge to halt an order forcing it to give up control over App Store payments while it appeals the decision. In a filing on Wednesday, Apple says the order contains “extraordinary intrusions” that could result in “grave irreparable harm” to the c…",
            "source": "The Verge",
            "url": "https://www.theverge.com/news/663361/apple-halt-app-store-ruling-appeal",
            "publishedAt": "2025-05-08T14:49:37Z"
        },
        {
            "title": "Apple’s New iPad With A16 Chip Just Got Its First Price Drop, Now at Its Lowest Price on Amazon",
            "description": "Need a new tablet? Score this 11-inch Apple iPad (A16 chip) for under $300.",
            "source": "Gizmodo.com",
            "url": "https://gizmodo.com/apples-new-ipad-with-a16-chip-just-got-its-first-price-drop-now-at-its-lowest-price-on-amazon-2000599374",
            "publishedAt": "2025-05-08T12:10:17Z"
        },
        {
            "title": "Amazon Is Clearing Out the Apple Watch SE (2nd Gen) at Black Friday Prices, Perfect for a Mother’s Day Tech Gift",
            "description": "What time is it? Time to join the smartwatch gang with an Apple Watch SE for under $200.",
            "source": "Gizmodo.com",
            "url": "https://gizmodo.com/amazon-is-clearing-out-the-apple-watch-se-2nd-gen-at-black-friday-prices-perfect-for-a-mothers-day-tech-gift-2000599312",
            "publishedAt": "2025-05-08T14:55:08Z"
        },
        {
            "title": "PSA: Apple Card Daily Cash Back From T-Mobile Dropping to 2% in July",
            "description": "Apple has partnered with multiple merchants to provide three percent Daily Cash back for Apple Card purchases, and T-Mobile has participated in the program since 2019. That's going to end in July, though, and Daily Cash back from T-Mobile will revert to the s…",
            "source": "MacRumors",
            "url": "https://www.macrumors.com/2025/05/08/apple-card-daily-cash-back-t-mobile/",
            "publishedAt": "2025-05-08T22:03:10Z"
        },
        {
            "title": "Apple Working on Chips for New Macs and AI Servers",
            "description": "Apple's chip team is working on new processors for more powerful Macs and future artificial intelligence features that will power Apple Intelligence, reports Bloomberg.\n\n\n\n\n\nChips codenamed \"Komodo\" will likely be M6 chips that will follow this year's M5 chip…",
            "source": "MacRumors",
            "url": "https://www.macrumors.com/2025/05/08/apple-mac-ai-chips/",
            "publishedAt": "2025-05-08T23:10:04Z"
        },
        {
            "title": "Oops, Amazon Did It Again: The 2025 MacBook Air Drops for the 5th Time in a Month",
            "description": "It’s hard to believe that Apple’s newest MacBook Air is available at such a deep discount.",
            "source": "Gizmodo.com",
            "url": "https://gizmodo.com/oops-amazon-did-it-again-the-2025-macbook-air-drops-for-the-5th-time-in-a-month-2000599698",
            "publishedAt": "2025-05-08T16:19:05Z"
        },
        {
            "title": "Apple Card Users Get a Free Six Month Uber One Trial",
            "description": "Apple Card holders are now eligible for a six-month free trial of the Uber One service, according to emails that Apple began sending out today.\n\n\n\n\n\nUber One is a subscription service that includes $0 delivery fees for Uber Eats orders, up to 10 percent off e…",
            "source": "MacRumors",
            "url": "https://www.macrumors.com/2025/05/08/apple-card-uber-one-trial/",
            "publishedAt": "2025-05-08T21:52:30Z"
        },
        {
            "title": "Amazon Takes $100 Off Huge Collection of Apple Watch Series 10 Models, Available From $299",
            "description": "Amazon is offering numerous all-time low prices on Apple Watch Series 10 devices today, including both GPS and cellular models at $100 off original prices. If you want to build your band collection to match your new Apple Watch, be sure to check out Woot's BO…",
            "source": "MacRumors",
            "url": "https://www.macrumors.com/2025/05/08/amazon-100-off-apple-watch-10/",
            "publishedAt": "2025-05-08T17:45:31Z"
        },
        {
            "title": "Apple Promotes Vision Pro in New Mother's Day-Themed Ad",
            "description": "Apple today shared a new spatial video that's designed to highlight the Vision Pro headset, demonstrating how the device can be used to make and preserve memories.\n\n\n\n\r\n\n\nFor the video, two parents, Sam and Khulan, filmed their newborn son using iPhones that …",
            "source": "MacRumors",
            "url": "https://www.macrumors.com/2025/05/08/apple-vision-pro-mothers-day-ad/",
            "publishedAt": "2025-05-08T16:15:42Z"
        },
        {
            "title": "Google Disputes Apple VP's Claim of Safari Search Traffic Decline",
            "description": "Google has issued a rare public statement seemingly contradicting Apple senior VP Eddy Cue's courtroom testimony that Safari browser searches declined for the first time in April 2025.\n\n\n\n\n\nCue's comments, made during the ongoing U.S. Justice Department antit…",
            "source": "MacRumors",
            "url": "https://www.macrumors.com/2025/05/08/google-disputes-safari-search-traffic-decline/",
            "publishedAt": "2025-05-08T08:38:39Z"
        },
        {
            "title": "Apple Wanted Tim Cook to Appear as Himself in Comedy Show 'The Studio'",
            "description": "Apple wanted CEO Tim Cook to make a surprise cameo appearance on Apple TV+'s original comedy show \"The Studio\"—a request that was declined by the show's creator, Seth Rogen, in favor of an appearance from Netflix co-CEO Ted Sarandos, Business Insider reports.…",
            "source": "MacRumors",
            "url": "https://www.macrumors.com/2025/05/08/apple-wanted-tim-cook-to-appear-on-the-studio/",
            "publishedAt": "2025-05-08T12:38:29Z"
        },
        {
            "title": "Woot's Apple Watch Solo/Braided Loop Sale Offers Up to Two Free Bands When You Buy One",
            "description": "Woot is still hosting a sale on Apple Watch Solo Loop and Braided Solo Loop bands, with a bit of a different ruleset compared to previous sales. This time, when you buy any Solo Loop or Braided Solo Loop at a discount on Woot, you'll get up to two extra bands…",
            "source": "MacRumors",
            "url": "https://www.macrumors.com/2025/05/08/woots-apple-watch-loop-sale/",
            "publishedAt": "2025-05-08T14:51:00Z"
        },
        {
            "title": "Apple's comments on Search gave investors one reason to worry about Google's future. Here's another.",
            "description": "Apple executive Eddy Cue's revelation on Safari search decline sparked investor worry. Google's paid clicks growth also has been slowing.",
            "source": "Business Insider",
            "url": "https://www.businessinsider.com/google-search-apple-paid-clicks-eddy-cue-2025-5",
            "publishedAt": "2025-05-08T19:59:37Z"
        },
        {
            "title": "Apple Seeks to Pause 'Extraordinary' App Store Ruling in Epic Games Battle",
            "description": "Apple has filed an emergency motion asking the Ninth Circuit Court of Appeals to pause key parts of a recent ruling that dramatically changes how the App Store operates, following a contempt finding in its long-running legal battle with Fortnite maker Epic Ga…",
            "source": "MacRumors",
            "url": "https://www.macrumors.com/2025/05/08/apple-appeals-app-store-ruling-epic-games/",
            "publishedAt": "2025-05-08T09:04:30Z"
        },
        {
            "title": "Apple says AI is cutting into Google search. Google says that's not true. Who's right?",
            "description": "Apple says AI engines like ChatGPT are cutting into Google search, but Google says that's not true. Both arguments could be true.",
            "source": "Business Insider",
            "url": "https://www.businessinsider.com/apple-google-disagree-ai-cutting-into-search-2025-5",
            "publishedAt": "2025-05-08T19:26:03Z"
        }
    ],
    "2025-05-13": [
        {
            "title": "How to Use Apple Maps on the Web",
            "description": "Apple’s mapping platform is no longer exclusively for Apple devices. A pared-down version runs in your browser; here’s how to use it.",
            "source": "Wired",
            "url": "https://www.wired.com/story/how-to-use-apple-maps-on-the-web/",
            "publishedAt": "2025-05-13T12:00:00Z"
        },
        {
            "title": "Apple Is Developing a Brain-Computer Interface",
            "description": "The Cupertino giant is partnering with a Jeff Bezos-backed interface company.",
            "source": "Gizmodo.com",
            "url": "https://gizmodo.com/apple-is-developing-a-brain-computer-interface-2000601576",
            "publishedAt": "2025-05-13T16:10:23Z"
        },
        {
            "title": "PayPal launches iPhone NFC payments in Germany after EU forced Apple to open up",
            "description": "German iPhone users are starting to report that they’re now able to use PayPal’s tap-to-pay feature at in-store payment terminals, according to German tech site iPhone Ticker. The new capability, which PayPal announced earlier this month, is a result of the E…",
            "source": "The Verge",
            "url": "https://www.theverge.com/news/666009/paypal-tap-to-pay-nfc-iphone-eu-dma",
            "publishedAt": "2025-05-13T17:05:18Z"
        },
        {
            "title": "tvOS 18.5 Adds Synchronized Dolby Atmos Playback for AirPlay and Bluetooth Speakers",
            "description": "The tvOS 18.5 update that Apple seeded to developers yesterday adds support for synchronizing Dolby Atmos playback to speakers over AirPlay or Bluetooth, according to Apple's release notes for the update.\n\n\n\n\n\nThe feature could help address some persistent sy…",
            "source": "MacRumors",
            "url": "https://www.macrumors.com/2025/05/13/tvos-18-5-dolby-atmos-synchronization/",
            "publishedAt": "2025-05-13T17:12:28Z"
        },
        {
            "title": "Report: Apple Preparing to Launch Mind-Control Support for iPhones",
            "description": "Apple is planning to allow users to natively control iPhones, iPads, and other devices using brain signals later this year, The Wall Street Journal reports.\n\n\n\n\n\nThe initiative involves a partnership with Synchron, a neurotechnology startup that produces an i…",
            "source": "MacRumors",
            "url": "https://www.macrumors.com/2025/05/13/apple-preparing-to-launch-mind-control-support/",
            "publishedAt": "2025-05-13T13:18:40Z"
        },
        {
            "title": "Apple Announces New iOS 19 and macOS 16 Accessibility Features Ahead of WWDC",
            "description": "Apple today previewed a wide range of new accessibility features coming later this year on the iPhone, iPad, Mac, Apple Watch, and Apple Vision Pro. The announcement comes two days ahead of Global Accessibility Awareness Day.\n\n\n\n\n\nThese features are expected …",
            "source": "MacRumors",
            "url": "https://www.macrumors.com/2025/05/13/apple-previews-ios-19-accessibility-features/",
            "publishedAt": "2025-05-13T12:51:08Z"
        },
        {
            "title": "Apple Expands Accessibility Features Including Live Captions, Magnifier and Sound Recognition",
            "description": "Accessibility Nutrition Labels will help you understand which apps and games are accessible before downloading. Personal Voice, Music Haptics and other features also get an update.",
            "source": "CNET",
            "url": "https://www.cnet.com/tech/mobile/apple-expands-accessibility-features-like-live-captions-magnifier-and-sound-recognition/",
            "publishedAt": "2025-05-13T12:00:11Z"
        },
        {
            "title": "iOS 19 Will Improve iPhone Feature That Lets You Preserve Your Voice",
            "description": "A few years ago, Apple introduced a Personal Voice feature that allows those at risk of losing their ability to speak to create a synthesized voice that sounds similar to their actual voice, so they can continue to communicate with others. The feature debuted…",
            "source": "MacRumors",
            "url": "https://www.macrumors.com/2025/05/13/ios-19-to-enhance-personal-voice-feature/",
            "publishedAt": "2025-05-13T13:56:18Z"
        },
        {
            "title": "iOS 19 to Upgrade iPhone's Music Haptics Feature in Two Ways",
            "description": "iOS 18 introduced an accessibility feature called Music Haptics that has value for everyone. When the feature is turned on, the iPhone's Taptic Engine taps and vibrates to match the audio of a song playing in Apple Music, Shazam, and supported third-party app…",
            "source": "MacRumors",
            "url": "https://www.macrumors.com/2025/05/13/ios-19-music-haptics-improvements/",
            "publishedAt": "2025-05-13T14:35:09Z"
        },
        {
            "title": "You shouldn't delete this email if you want a slice of Apple's $95 million Siri settlement",
            "description": "Potential claimants in Apple's $95 million Siri settlement should check their email for details on claiming their share.",
            "source": "Business Insider",
            "url": "https://www.businessinsider.com/hey-siri-settlement-administrator-is-sending-letters-to-apple-users-2025-5",
            "publishedAt": "2025-05-13T17:08:10Z"
        },
        {
            "title": "iPhone Shipments Crash 50% in China as Local Brands Dominate",
            "description": "Foreign-branded smartphone shipments in China, dominated by Apple's iPhone, dropped dramatically in March 2025, plunging 49.6% year-over-year according to data released by The China Academy of Information and Communications Technology (CAICT).\n\n\n\n\n\nThe steep …",
            "source": "MacRumors",
            "url": "https://www.macrumors.com/2025/05/13/iphone-shipments-down-china-local-brands/",
            "publishedAt": "2025-05-13T11:23:39Z"
        }
    ],
    "2025-05-11": [
        {
            "title": "Apple may release a ‘mostly glass, curved iPhone’ in 2027",
            "description": "This morning, while summarizing an Apple “product blitz” he expects for 2027, Bloomberg’s Mark Gurman writes in his Power On newsletter that Apple is planning a “mostly glass, curved iPhone” with no display cutouts for that year, which happens to be the iPhon…",
            "source": "The Verge",
            "url": "https://www.theverge.com/news/664776/apple-curved-glass-iphone-2027",
            "publishedAt": "2025-05-11T20:03:55Z"
        },
        {
            "title": "Don’t Buy the New iPad From Apple’s Website, Amazon Is Offering a Shockingly Low Price Right Now",
            "description": "You won’t find any discounts on the 2025 iPad directly from Apple this year, but Amazon is offering a great deal.",
            "source": "Gizmodo.com",
            "url": "https://gizmodo.com/dont-buy-the-new-ipad-from-apples-website-amazon-is-offering-a-shockingly-low-price-right-now-2000600738",
            "publishedAt": "2025-05-11T12:40:46Z"
        }
    ],
    "2025-05-09": [
        {
            "title": "How to turn on Lockdown Mode for your iPhone and Mac",
            "description": "Apple is known for prioritizing privacy and security, but there are additional measures you can turn to if you feel you need them. iPhones, iPads, and Macs have what's known as a Lockdown Mode that takes protecting your data to a whole new level. It's clear t…",
            "source": "The Verge",
            "url": "https://www.theverge.com/tech/663794/lockdown-mode-iphone-mac-how-to",
            "publishedAt": "2025-05-09T16:09:27Z"
        },
        {
            "title": "Samsung’s Galaxy Ring is on sale with a $100 gift card starting at $299.99",
            "description": "Smartwatches have come along way since the first Apple Watch arrived on the scene more than a decade ago. However, despite how ubiquitous they’ve become, they’re still nowhere near as discrete — or long-lasting — as a smart ring like the Samsung Galaxy Ring. …",
            "source": "The Verge",
            "url": "https://www.theverge.com/tech/663665/samsung-galaxy-smart-ring-shokz-openrun-pro-2-deal-sale",
            "publishedAt": "2025-05-09T22:12:30Z"
        },
        {
            "title": "Apple’s Murderbot series is goofy sci-fi with a side of existential crisis",
            "description": "I did not expect a TV show called Murderbot to be quite so relatable. On the surface, the Apple TV Plus sci-fi comedy is a somewhat generic futuristic story about a group of humans exploring a dangerous planet with the help of a security bot that's designed t…",
            "source": "The Verge",
            "url": "https://www.theverge.com/tv-reviews/664090/murderbot-season-1-review-apple-tv-plus",
            "publishedAt": "2025-05-09T13:54:02Z"
        },
        {
            "title": "Apple AirPods Alternative? Beats Studio Buds+ Are Now Going for Peanuts on Amazon",
            "description": "Need a new pair of earbuds? You can't go wrong with this pick from Beats, especially at this discounted price.",
            "source": "Gizmodo.com",
            "url": "https://gizmodo.com/apple-airpods-alternative-beats-studio-buds-are-now-going-for-peanuts-on-amazon-2000599952",
            "publishedAt": "2025-05-09T16:35:08Z"
        },
        {
            "title": "Epic Games Submits Fortnite to U.S. App Store",
            "description": "As promised, Epic Games today submitted Fortnite to the U.S. App Store, and if approved by Apple, it will mark the first time that the Fortnite app has been available in the United States since 2020.\n\n\n\n\n\nFortnite will include options to purchase in-app curre…",
            "source": "MacRumors",
            "url": "https://www.macrumors.com/2025/05/09/fortnite-submitted-to-us-app-store/",
            "publishedAt": "2025-05-09T16:57:19Z"
        },
        {
            "title": "Set Up a Recovery Contact for Your Apple Account",
            "description": "Losing your Apple Account password can make your digital life a misery, as it can leave you locked out of the account that you use to manage your Apple devices, unable to access your iCloud data and manage your app and service subscriptions. \n\n\n\n\n\nIn this sce…",
            "source": "MacRumors",
            "url": "https://www.macrumors.com/how-to/set-up-recovery-contact-apple-account/",
            "publishedAt": "2025-05-09T15:41:53Z"
        },
        {
            "title": "Apple Acquisition Hints at Upgraded Calendar App on iOS 19 or Beyond",
            "description": "Apple acquired Canadian startup Mayday Labs in April 2024, according to a European Commission listing, spotted by French blog MacGeneration. The acquisition had not received widespread attention from tech publications until now.\n\n\n\n\n\nApple is legally required…",
            "source": "MacRumors",
            "url": "https://www.macrumors.com/2025/05/09/apple-acquired-mayday-labs/",
            "publishedAt": "2025-05-09T16:13:45Z"
        },
        {
            "title": "Best Buy's Spring Sale Features Record Low Prices on iPads, MacBook Air, Powerbeats Pro 2, and More",
            "description": "Best Buy has introduced major discounts across a number of Apple products this week, including MacBook Air, iPad Air, iPad mini, iPad, and Apple Watch. These discounts coincide with Best Buy's Mother's Day sale, which features savings on a collection of tech …",
            "source": "MacRumors",
            "url": "https://www.macrumors.com/2025/05/09/best-buys-spring-sale-low-prices/",
            "publishedAt": "2025-05-09T15:01:41Z"
        },
        {
            "title": "Former Apple Design Chief Jony Ive Reflects on Company Culture, Iconic Products, and a Warning for the Tech Industry",
            "description": "Apple's former Chief Design Officer Jony Ive has given a rare and wide-ranging interview at Stripe Sessions 2025, offering new insights into his design philosophy, his time at Apple, and his current work at his design collective, LoveFrom.\n\n\n\n\r\n\n\n\n\nIn a one-h…",
            "source": "MacRumors",
            "url": "https://www.macrumors.com/2025/05/09/jony-ive-reflects-on-culture-products-and-warning/",
            "publishedAt": "2025-05-09T13:19:33Z"
        }
    ],
    "2025-05-16": [
        {
            "title": "Fortnite for iOS is unavailable worldwide",
            "description": "Fortnite maker Epic Games has announced that Apple has blocked the game’s return to iOS. Following the rejection, Fortnite is no longer available on iPhones and iPads even in the European Union, where it had previously been available to download through the E…",
            "source": "The Verge",
            "url": "https://www.theverge.com/news/668232/fortnite-ios-unavailable-worldwide-apple-epic",
            "publishedAt": "2025-05-16T09:47:20Z"
        },
        {
            "title": "Apple Music’s new transfer tool simplifies switching from other streaming services",
            "description": "To potentially make it easier for users of streaming services like Spotify to switch, Apple Music has introduced a new built-in tool for importing libraries and playlists. A support page added to Apple’s website this week includes details on how to use the fe…",
            "source": "The Verge",
            "url": "https://www.theverge.com/news/668369/apple-music-transfer-tool-library-playlists",
            "publishedAt": "2025-05-16T13:34:21Z"
        },
        {
            "title": "Apple Pay, Apple Card, Wallet and Apple Cash Currently Experiencing Service Issues",
            "description": "If you're having problems using your Apple Card, Apple Cash, Apple Pay, or the Wallet app, you're not alone. According to Apple's System Status page, there is an ongoing issue affecting these services.\n\n\n\n\n\nApple says that some users may be experiencing issue…",
            "source": "MacRumors",
            "url": "https://www.macrumors.com/2025/05/16/apple-pay-apple-card-wallet-outage/",
            "publishedAt": "2025-05-16T16:45:54Z"
        },
        {
            "title": "Apple's 20th Anniversary iPhone: What We Know So Far",
            "description": "2027 will mark the 20th anniversary of the iPhone, and Apple is planning to celebrate with an all-new ‌iPhone‌ design. With the 10th anniversary of the ‌iPhone‌, Apple unveiled the all-display ‌iPhone‌ X with no bezels at the top or the bottom for the camera …",
            "source": "MacRumors",
            "url": "https://www.macrumors.com/guide/20th-anniversary-iphone/",
            "publishedAt": "2025-05-16T23:33:43Z"
        },
        {
            "title": "Apple Says Fortnite for iOS Isn't Blocked Worldwide, Just the U.S.",
            "description": "Apple today clarified that it has not blocked Epic Games from updating the iOS Fortnite app in the European Union, but it is not planning to allow ‌Epic Games‌ to offer Fortnite in the United States App Store at the current time.\n\n\n\n\n\nIn a statement to Bloomb…",
            "source": "MacRumors",
            "url": "https://www.macrumors.com/2025/05/16/apple-fortnite-ios-not-blocked-worldwide/",
            "publishedAt": "2025-05-16T16:58:29Z"
        },
        {
            "title": "Best Apple Deals of the Week: Sitewide Sales Hit Anker, Verizon, Samsung, and More, Plus BOGO Apple Watch Band Sale at Woot",
            "description": "This week's best deals include a big sitewide sale at Anker that's exclusive to MacRumors readers, a BOGO Apple Watch band sale at Woot, and a couple of solid discounts on iPhone charging stations and Jackery portable batteries at Amazon. We're also tracking …",
            "source": "MacRumors",
            "url": "https://www.macrumors.com/2025/05/16/best-apple-deals-of-the-week-5-16-25/",
            "publishedAt": "2025-05-16T15:10:07Z"
        },
        {
            "title": "Apple Stops Signing iPadOS 17.7.7 After Reports of App Login Issues",
            "description": "Apple has stopped signing the iPadOS 17.7.7 update that was released earlier this week for devices unable to run versions of iPadOS 18, meaning that users will not be able to install the update even if they see it available in Software Update. Affected device…",
            "source": "MacRumors",
            "url": "https://www.macrumors.com/2025/05/15/apple-stops-signing-ipados-17-7-7/",
            "publishedAt": "2025-05-16T03:08:02Z"
        },
        {
            "title": "'Murderbot': How to Watch Apple's New Sci-Fi Comedy Thriller",
            "description": "Alexander Skarsgård stars in this adaptation of the award-winning book series.",
            "source": "CNET",
            "url": "https://www.cnet.com/tech/services-and-software/murderbot-how-to-watch-apples-new-sci-fi-comedy-thriller/",
            "publishedAt": "2025-05-16T10:00:03Z"
        },
        {
            "title": "MacRumors Giveaway: Win an Apple Watch Ultra 2 From GRID Studio",
            "description": "For this week's giveaway, we've teamed up with GRID Studio to offer MacRumors readers a chance to win an Apple Watch Ultra 2. GRID Studio is known for taking non-operational Apple devices that would be cluttering up a landfill and turning them into stylish ar…",
            "source": "MacRumors",
            "url": "https://www.macrumors.com/2025/05/16/macrumors-giveaway-grid-studio-apple-watch-may/",
            "publishedAt": "2025-05-16T17:39:56Z"
        }
    ],
    "2025-05-15": [
        {
            "title": "Trump wants Apple to stop making more iPhones in India",
            "description": "President Donald Trump told Apple CEO Tim Cook that he doesn’t want the company to move iPhone production to India. “I had a little problem with Tim Cook yesterday,” Trump said during his visit to Qatar. “You’re coming in with $500 billion, but now I hear you…",
            "source": "The Verge",
            "url": "https://www.theverge.com/news/667649/donald-trump-apple-stop-producing-iphones-india",
            "publishedAt": "2025-05-15T14:18:30Z"
        },
        {
            "title": "Apple is placing warnings on EU apps that don’t use App Store payments",
            "description": "Apple is trying to dissuade Europeans from using iOS apps that support alternative payment options by making them look scary. Daring Fireball’s John Gruber spotted that a red exclamation mark icon is being prominently displayed on the App Store listing for In…",
            "source": "The Verge",
            "url": "https://www.theverge.com/news/667484/apple-eu-ios-app-store-warning-payment-system",
            "publishedAt": "2025-05-15T10:03:33Z"
        },
        {
            "title": "Watch out, Apple. ChatGPT and Chipotle have joined the list of the world's most valuable brands.",
            "description": "Topping the list for the fourth year in a row is Apple, according to Kantar BrandZ. ChatGPT and Chipotle also made the list for the first time.",
            "source": "Business Insider",
            "url": "https://www.businessinsider.com/most-valuable-brands-list-apple-google-chatgpt-chipotle-2025-5",
            "publishedAt": "2025-05-15T20:54:20Z"
        },
        {
            "title": "The latest iPhone is now heavily discounted on some Chinese e-commerce websites amid Apple's declining sales in China",
            "description": "Chinese e-commerce sites have slashed the price of some iPhones ahead of a festival. Apple faces declining sales in China as local brands gain market share.",
            "source": "Business Insider",
            "url": "https://www.businessinsider.com/latest-apple-iphone-sees-big-discounts-chinese-e-commerce-sites-2025-5",
            "publishedAt": "2025-05-15T03:09:44Z"
        },
        {
            "title": "Trump says he had a 'little problem with Tim Cook' over Apple's India expansion",
            "description": "The president said he doesn't want Apple to shift its production to India. The iPhone maker is grappling with tough tariff measures on China.",
            "source": "Business Insider",
            "url": "https://www.businessinsider.com/donald-trump-apple-tim-cook-india-qatar-china-2025-5",
            "publishedAt": "2025-05-15T09:40:23Z"
        },
        {
            "title": "Apple Highlights Magnifier on Mac and iPhone Music Haptics in New Videos",
            "description": "Apple today shared new videos that highlight the upcoming Accessibility features that the company plans to introduce with iOS 19 and macOS 16. Apple this week debuted a number of new Accessibility options that will be coming later this year to honor Global Ac…",
            "source": "MacRumors",
            "url": "https://www.macrumors.com/2025/05/15/apple-videos-accessibility-features/",
            "publishedAt": "2025-05-15T16:25:24Z"
        },
        {
            "title": "Apple Says These Vehicle Brands Plan to Offer All-New CarPlay Ultra",
            "description": "Apple today announced the launch of CarPlay Ultra, the long-awaited next-generation version of its CarPlay software system for vehicles.\n\n\n\n\n\nCarPlay Ultra features deep integration with a vehicle's instrument cluster and systems, built-in Radio and Climate a…",
            "source": "MacRumors",
            "url": "https://www.macrumors.com/2025/05/15/carplay-ultra-committed-automakers/",
            "publishedAt": "2025-05-15T15:13:54Z"
        },
        {
            "title": "Bond vibes, six-figure price tag: Apple's CarPlay Ultra debuts in new Aston Martins",
            "description": "CarPlay Ultra, Apple's next-gen dashboard integration, just debuted in Aston Martin models.",
            "source": "Business Insider",
            "url": "https://www.businessinsider.com/apple-carplay-ultra-is-here-for-aston-martin-drivers-2025-5",
            "publishedAt": "2025-05-15T22:03:22Z"
        },
        {
            "title": "'The Price Is Right' contestants were off by thousands when guessing the cost of Apple's Vision Pro",
            "description": "Four contestants underestimated Apple's Vision Pro price  by at least $2,000",
            "source": "Business Insider",
            "url": "https://www.businessinsider.com/vision-pro-price-stumps-the-price-is-right-contestants-2025-5",
            "publishedAt": "2025-05-15T17:22:35Z"
        }
    ],
    "2025-05-12": [
        {
            "title": "Did Apple get too big for its own good? With Daring Fireball’s John Gruber",
            "description": "We’re doing something a little different on today’s episode of Decoder. I asked my friend John Gruber, of the website Daring Fireball, to come on the show and talk about the future of Apple — and, importantly, the App Store. Gruber and I have been friends for…",
            "source": "The Verge",
            "url": "https://www.theverge.com/decoder-podcast-with-nilay-patel/664802/apple-app-store-iphone-ios-fortnite-epic-games-lawsuit",
            "publishedAt": "2025-05-12T13:50:32Z"
        },
        {
            "title": "Murderbot Is a Funny, Violent Exploration of What It Means to Be Human",
            "description": "Martha Wells’ much-loved sci-fi book series gets a top-notch adaptation starring Alexander Skarsgård on Apple TV+.",
            "source": "Gizmodo.com",
            "url": "https://gizmodo.com/murderbot-review-alexander-skarsgard-apple-tv-2000595407",
            "publishedAt": "2025-05-12T13:00:37Z"
        },
        {
            "title": "Apple Shares Spooky 'Mac to School' Ads Highlighting AirDrop and More",
            "description": "Apple today shared a trio of spooky \"Mac to School\" ads on its YouTube channel in the UK.\n\n\n\nThe videos highlight three useful Mac features for students, including AirDrop, iPhone Mirroring, and Apple Intelligence's Writing Tools.\n\n\n\n\r\n\n\n\r\n\n\n\r\n\n\nAirDrop lets …",
            "source": "MacRumors",
            "url": "https://www.macrumors.com/2025/05/12/apple-shares-mac-to-school-ads/",
            "publishedAt": "2025-05-12T13:54:04Z"
        },
        {
            "title": "Apple Releases iOS 18.5 With New Wallpaper, Screen Time Changes, Carrier Satellite Support for iPhone 13 and More",
            "description": "Apple today released iOS 18.5 and iPadOS 18.5, the fifth updates to the iOS 18 and iPadOS 18 operating systems that came out last September. iOS 18.5 and iPadOS 18.5 come a little over a month after Apple released iOS 18.4 and iPadOS 18.4.\n\n\n\n\n\nThe new softwa…",
            "source": "MacRumors",
            "url": "https://www.macrumors.com/2025/05/12/apple-releases-ios-18-5/",
            "publishedAt": "2025-05-12T17:06:59Z"
        },
        {
            "title": "Tariffs or No, Apple May Raise iPhone Prices This Year",
            "description": "The tech company could increase prices of its next flagship product line, as it introduces a thinner design and new features.",
            "source": "CNET",
            "url": "https://www.cnet.com/tech/mobile/tariffs-or-no-apple-may-raise-iphone-prices-this-year/",
            "publishedAt": "2025-05-12T12:46:00Z"
        },
        {
            "title": "Apple's iPhone Plans for 2027: Foldable, or Glass and Curved. (Plus Smart Glasses, Tabletop Robot)",
            "description": "An anonymous reader shared this report from the Verge:\n\nThis morning, while summarizing an Apple \"product blitz\" he expects for 2027, Bloomberg's Mark Gurman writes in his Power On newsletter that Apple is planning a \"mostly glass, curved iPhone\" with no disp…",
            "source": "Slashdot.org",
            "url": "https://apple.slashdot.org/story/25/05/11/2355205/apples-iphone-plans-for-2027-foldable-or-glass-and-curved-plus-smart-glasses-tabletop-robot",
            "publishedAt": "2025-05-12T01:46:00Z"
        },
        {
            "title": "WSJ: Apple Considering Price Increases for iPhone 17 Lineup",
            "description": "Apple is considering raising prices for its upcoming iPhone 17 models set to release this fall, according to people familiar with the matter cited by The Wall Street Journal.\n\n\n\n\n\nThe company reportedly aims to pair the potential price hikes with new features…",
            "source": "MacRumors",
            "url": "https://www.macrumors.com/2025/05/12/apple-considering-price-increases-iphone-17/",
            "publishedAt": "2025-05-12T10:36:36Z"
        },
        {
            "title": "Apple to Block Mac Apps From Secretly Accessing Your Clipboard",
            "description": "Apple is planning to implement a change to pasteboard (aka your iPhone's internal clipboard) that will prevent Mac apps from being able to read the pasteboard without the user being alerted, according to information Apple has shared with developers.\n\n\n\n\n\nIn m…",
            "source": "MacRumors",
            "url": "https://www.macrumors.com/2025/05/12/apple-mac-apps-clipboard-change/",
            "publishedAt": "2025-05-12T23:27:00Z"
        },
        {
            "title": "Apple TV+ Announces New Series From Celebrity Chef Gordon Ramsay",
            "description": "A new documentary series hailing from celebrity chef Gordon Ramsay is coming to Apple TV+.\n\n\n\n\n\nThe eight-episode series \"Knife Edge: Chasing Michelin Stars\" will follow elite chefs at some of the world's most celebrated restaurants, as they seek to win or ma…",
            "source": "MacRumors",
            "url": "https://www.macrumors.com/2025/05/12/apple-tv-new-series-from-gordon-ramsay/",
            "publishedAt": "2025-05-12T15:49:54Z"
        },
        {
            "title": "Watch the New Trailer for Apple's Big Summer Movie Starring Brad Pitt",
            "description": "Apple today shared a second trailer for its upcoming \"F1\" racing film, which will have a theatrical release via Warner Bros. Pictures.\n\n\n\n\n\nIn the underdog comeback film, Brad Pitt stars as an F1 driver who was an up-and-coming talent in the 1990s, until an a…",
            "source": "MacRumors",
            "url": "https://www.macrumors.com/2025/05/12/apple-f1-movie-second-trailer/",
            "publishedAt": "2025-05-12T14:29:57Z"
        },
        {
            "title": "PSA: Apple Ending Support for Old HomeKit Architecture in Fall 2025, Upgrade Before Then",
            "description": "Apple will officially end support for the previous version of Apple Home in the fall of 2025, according to an updated HomeKit support document. Apple says that users will need to update to the new HomeKit architecture by then to avoid interruptions with acces…",
            "source": "MacRumors",
            "url": "https://www.macrumors.com/2025/05/12/apple-ending-support-old-homekit-architecture/",
            "publishedAt": "2025-05-12T22:44:00Z"
        },
        {
            "title": "Apple's C1 Modem Gets First Security Update in iOS 18.5",
            "description": "The iOS 18.5 update that Apple released today includes a security fix for the iPhone 16e's C1 modem, which is the first Apple-designed modem.\n\n\n\n\n\nAccording to Apple's security support document for iOS 18.5, there's a fix for a vulnerability with the C1 modem…",
            "source": "MacRumors",
            "url": "https://www.macrumors.com/2025/05/12/apple-ios-18-5-c1-security-fix/",
            "publishedAt": "2025-05-12T18:07:33Z"
        },
        {
            "title": "Safari Web Push Update in macOS 15.5 Will Save You Battery",
            "description": "With Safari 18.5, included in macOS 15.5, Apple added Declarative Web Push, an updated method to deliver web-based push notifications even when a website isn't open. With Declarative Web Push, developers can display notifications without the need for a servic…",
            "source": "MacRumors",
            "url": "https://www.macrumors.com/2025/05/12/safari-web-push-update-macos-15-5/",
            "publishedAt": "2025-05-12T20:55:13Z"
        }
    ],
    "2025-05-14": [
        {
            "title": "New 2025 iPad Now Costs Less Than AirPods Pro, Amazon Clears Out Stock",
            "description": "You can finally treat yourself to an Apple product that no longer costs a fortune.",
            "source": "Gizmodo.com",
            "url": "https://gizmodo.com/new-2025-ipad-now-costs-less-than-airpods-pro-amazon-clears-out-stock-2000602403",
            "publishedAt": "2025-05-14T20:05:54Z"
        },
        {
            "title": "New Pride Edition Band for Apple Watch Now Available at Apple Stores",
            "description": "The new Pride Edition Sport Band for the Apple Watch is now available to purchase in person at Apple Store locations in the U.S. and select other countries.\n\n\n\n\n\nApple unveiled the band last week, as part of its 2025 Pride Collection, which also includes a ne…",
            "source": "MacRumors",
            "url": "https://www.macrumors.com/2025/05/14/new-pride-band-now-in-apple-stores/",
            "publishedAt": "2025-05-14T16:10:40Z"
        },
        {
            "title": "Apple Prepares for WWDC 2025 With Developer App Update",
            "description": "As WWDC 2025 approaches, Apple has updated its Developer app to prepare for the week-long event. The refreshed version of the developer app will host the ‌WWDC 2025‌ session videos, 1-on-1 labs with Apple engineers, and more.\n\n\n\n\n\nApple will stream the ‌WWDC …",
            "source": "MacRumors",
            "url": "https://www.macrumors.com/2025/05/14/apple-wwdc-2025-developer-app-update/",
            "publishedAt": "2025-05-14T17:30:43Z"
        },
        {
            "title": "Apple TV 4K: Play Game Console or Cable Box Audio on HomePod",
            "description": "The Apple TV 4K (second- and third-generation) is capable of relaying audio from a compatible TV to a HomePod – even when you're not using your Apple TV. This allows you to stream audio from a TV-connected game console or other set-top box straight to Apple's…",
            "source": "MacRumors",
            "url": "https://www.macrumors.com/how-to/apple-tv-4k-play-game-console-audio-homepod/",
            "publishedAt": "2025-05-14T14:01:54Z"
        },
        {
            "title": "Amazon Has Low Prices on Apple Pencil Pro ($99) and AirTag 4-Pack ($79.98)",
            "description": "Today we're tracking a handful of Apple accessory discounts on Amazon, including an all-time low price for the Apple Pencil Pro and a solid deal on the AirTag 4-Pack. Neither deal requires a coupon code this time around, as both have been applied automaticall…",
            "source": "MacRumors",
            "url": "https://www.macrumors.com/2025/05/14/amazon-low-apple-pencil-airtag/",
            "publishedAt": "2025-05-14T14:13:17Z"
        },
        {
            "title": "Apple Maps Now Features Insights From 'Expert Sources' Like Michelin Guide",
            "description": "Apple is updating the Maps app with insights, ratings, and reviews from expert sources, with the aim of helping users find top-ranked restaurants, hotels, and more.\n\n\n\n\n\nThere are now options to search for and view Michelin-starred, Green Star, and Bib Gourma…",
            "source": "MacRumors",
            "url": "https://www.macrumors.com/2025/05/14/apple-maps-expert-sources/",
            "publishedAt": "2025-05-14T19:14:31Z"
        },
        {
            "title": "macOS Tiburon to macOS Pacific: Which Name Will Apple Use This Year?",
            "description": "Every year heading into WWDC, one thought on many Mac fans' minds is what Apple will choose as the name for the next version of macOS. The tradition dates all the way back to the beginning of Mac OS X with its big cat names like Leopard, and Apple shifted to …",
            "source": "MacRumors",
            "url": "https://www.macrumors.com/2025/05/14/macos-16-name-possibilities/",
            "publishedAt": "2025-05-14T14:49:46Z"
        },
        {
            "title": "Apple Maps to Feature Custom City Experience for Formula 1 Grand Prix",
            "description": "Apple today announced a new custom city experience and guide for the upcoming Formula 1 TAG Heuer Grand Prix de Monaco 2025.\n\n\n\n\n\n\n\nThe new Detailed City Experience includes custom-designed 3D Monégasque landmarks of significant locations, such as Casino de M…",
            "source": "MacRumors",
            "url": "https://www.macrumors.com/2025/05/14/apple-maps-to-feature-experience-for-formula-1/",
            "publishedAt": "2025-05-14T12:56:40Z"
        },
        {
            "title": "Apple spent many years and billions of dollars investing in China. Now it's stuck there.",
            "description": "Donald Trump wants Apple to make iPhones in the US. That won't happen, says journalist Patrick McGee, who just wrote a book on Apple's ties to China.",
            "source": "Business Insider",
            "url": "https://www.businessinsider.com/apple-china-tariff-supply-chain-book-patrick-mcgee-peter-kafka-2025-05",
            "publishedAt": "2025-05-14T10:01:01Z"
        },
        {
            "title": "Top Five Announcements to Look Forward to at WWDC 2025",
            "description": "Time sure flies, and we're now less than a month away from the 2025 Worldwide Developers Conference where Apple will introduce new software updates. Rumors are picking up ahead of the event, so we thought we'd highlight some of the updates that we're looking …",
            "source": "MacRumors",
            "url": "https://www.macrumors.com/2025/05/14/wwdc-top-five-features/",
            "publishedAt": "2025-05-14T18:06:47Z"
        },
        {
            "title": "iPad Demand Soars as Apple Widens Lead Over Samsung and Xiaomi",
            "description": "Apple led the global tablet market in the first quarter of 2025, achieving 14% year-over-year shipment growth amid heightened demand for iPads, according to new data from Canalys.\n\n\n\n\n\nWorldwide tablet shipments reached 36.8 million units in the first quarter…",
            "source": "MacRumors",
            "url": "https://www.macrumors.com/2025/05/14/ipad-demand-soars-as-apple-widens-lead/",
            "publishedAt": "2025-05-14T15:16:15Z"
        },
        {
            "title": "Apple Releases Safari Technology Preview 219 With Bug Fixes and Performance Improvements",
            "description": "Apple today released a new update for Safari Technology Preview, the experimental browser that was first introduced in March 2016. Apple designed ‌Safari Technology Preview‌ to allow users to test features that are planned for future release versions of the S…",
            "source": "MacRumors",
            "url": "https://www.macrumors.com/2025/05/14/apple-releases-safari-technology-preview-219/",
            "publishedAt": "2025-05-14T21:48:08Z"
        }
    ],
    "2025-05-10": [
        {
            "title": "Top Stories: iOS 18.5 Release Imminent, iPhone Rumors for 2025 and Beyond, and More",
            "description": "With Apple's developer conference where it will show off iOS 19 just a month away, the company is wrapping up work on iOS 18.5 ahead of an imminent release to deliver a few new features and updates.\n\n\n\n\n\nThis week also saw a number of iPhone-related rumors, e…",
            "source": "MacRumors",
            "url": "https://www.macrumors.com/2025/05/10/top-stories-ios-18-5-release-imminent-iphone-rumors-for-2025-and-beyond-and-more/",
            "publishedAt": "2025-05-10T13:00:00Z"
        }
    ]
}