{
    "2025-05-11": [
        {
            "title": "I swapped my gas truck for a Chinese hybrid. The BYD Shark is great to drive, but one thing worries me.",
            "description": "Wayne Dopson, who swapped his gas truck for a Chinese hybrid, loves his new BYD Shark but is concerned about it's resale value in a couple years.",
            "source": "Business Insider",
            "url": "https://www.businessinsider.com/swapped-gas-truck-for-hybrid-byd-shark-2025-5",
            "publishedAt": "2025-05-11T04:21:01Z"
        },
        {
            "title": "I swapped my gas truck for a Chinese hybrid. The BYD Shark is great to drive, but one thing worries me",
            "description": "Dopson bought his BYD Shark pickup for 64,000 Australian dollars ($41,000).\nWayne Dopson\nWayne Dopson runs a renovation business in Brisbane, Australia, and bought a BYD Shark hybrid pickup in March.\nHe said it's great to drive compared with his old gas truck…",
            "source": "Biztoc.com",
            "url": "https://biztoc.com/x/0d4c9ff553d02182",
            "publishedAt": "2025-05-11T04:33:57Z"
        },
        {
            "title": "BYD's 5-Minute EV Fast Charging: We Tried It. It's A Game-Changer",
            "description": "Ask someone who drives a gasoline-powered car why they wouldn't want to get an electric one, and you're almost certain to hear this answer: they take way too long to charge. They're not even entirely wrong. Even though DC fast charging times are getting short…",
            "source": "Freerepublic.com",
            "url": "https://freerepublic.com/focus/f-chat/4316335/posts",
            "publishedAt": "2025-05-11T15:12:19Z"
        }
    ],
    "2025-05-08": [
        {
            "title": "BYD Plants Seen Generating Big Sales in Europe, South America",
            "description": "China’s top carmaker, BYD, plans to sell millions of its popular vehicles in Europe and South America in coming years, according to a new report.\nIndeed, it aims to sell half of all the vehicles it makes outside the Chinese market by 2030 – a huge increase th…",
            "source": "Biztoc.com",
            "url": "https://biztoc.com/x/8e2085170299795b",
            "publishedAt": "2025-05-08T12:32:49Z"
        },
        {
            "title": "4% off BYD Vehicles Purchased Through a Novated Lease @ BYD Australia",
            "description": "Saw this while scouring BYD's site, recently ordered a Sealion 7 through a novated lease so works out well to save another couple of grand. Note that the car must be ordered and DELIVERED by 30 …",
            "source": "Ozbargain.com.au",
            "url": "https://www.ozbargain.com.au/node/904875",
            "publishedAt": "2025-05-08T01:41:49Z"
        },
        {
            "title": "Exclusive-BYD aims to sell half its cars outside China by 2030, sources say",
            "description": null,
            "source": "Yahoo Entertainment",
            "url": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_e95803b3-07a7-463c-87bf-9c5caf86d4fa",
            "publishedAt": "2025-05-08T10:08:30Z"
        },
        {
            "title": "MG S5 EV variants revealed – Com and Lux fr RM115k est; early birds get RM5k discount and free wallbox",
            "description": "The MG S5 EV, which was previewed last month, is the main star of MG’s Malaysia Autoshow (MAS) 2025 stand here at MAEPS. However, the rival to the Proton eMas 7 and BYD Atto 3 […]\nThe post MG S5 EV variants revealed – Com and Lux fr RM115k est; early birds ge…",
            "source": "Paul Tan's Automotive News",
            "url": "https://paultan.org/2025/05/08/mg-s5-ev-variants-revealed-com-and-lux-from-est-rm115k-early-birds-get-rm5k-discount-free-wallbox/",
            "publishedAt": "2025-05-08T08:00:39Z"
        },
        {
            "title": "Sources state BYD is targeting half its vehicle sales to come from outside China by 2030",
            "description": "We’ve said it before and will say it again: Build Your Dreams (BYD) is coming. The Chinese automaker continues to gain momentum in global NEV sales and does not expect to hit the brakes anytime soon. According to multiple sources, BYD aims to have half of its…",
            "source": "Electrek",
            "url": "http://electrek.co/2025/05/08/sources-state-byd-is-targeting-half-its-vehicle-sales-to-come-from-outside-china-by-2030/",
            "publishedAt": "2025-05-08T12:55:32Z"
        },
        {
            "title": "MGS5 EV now open for booking in Malaysia. RWD SUV with up to 430km range, priced from RM115K",
            "description": "MG Malaysia has announced that its upcoming MGS5 EV is now open for booking. This is a 5-seater fully electric SUV that shares the same platform as the MG4. The MGS5 EV competes with the likes of the Proton e.MAS 7, BYD Atto 3 and the Omoda E5, and it is the …",
            "source": "SoyaCincau.com",
            "url": "https://soyacincau.com/2025/05/08/mgs5-ev-malaysia-variants-price-available-booking/",
            "publishedAt": "2025-05-08T08:00:11Z"
        },
        {
            "title": "The BYD EV That Charges In Only 5 Minutes Is Actually Real, But There's Just One Problem",
            "description": "BYD's Megawatt chargers really can add 250 miles of range in 5 minutes - all it takes is a 1,000-kW charger and a system designed to safely charge that quickly.",
            "source": "Jalopnik",
            "url": "https://www.jalopnik.com/1854995/byd-charges-under-5-minutes/",
            "publishedAt": "2025-05-08T17:25:00Z"
        }
    ],
    "2025-05-16": [
        {
            "title": "BYD to establish European centre in Hungary with 2,000 jobs",
            "description": null,
            "source": "Yahoo Entertainment",
            "url": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_b2c62b3d-6f37-48d0-bcd7-fc9e2ec8dd2b",
            "publishedAt": "2025-05-16T10:46:06Z"
        },
        {
            "title": "BYD Atto 3 Compatible All-Weather TPE Floor Mat Set $49 + Shipping (FREE C&C VIC) @ Smooth Sales",
            "description": "Hello BYD Atto 3 OzBagainers, You might have seen the Tesla floor mats we had on special and wondered why BYD people don't get some attention. Well, we have got a deal for you here with the …",
            "source": "Ozbargain.com.au",
            "url": "https://www.ozbargain.com.au/node/906052",
            "publishedAt": "2025-05-16T05:50:20Z"
        },
        {
            "title": "MG S5 EV launch date confirmed, May 20 – eMas 7 rival fr RM115k est; early birds get RM5k disc, wallbox",
            "description": "Many expected MG Motor Malaysia to launch the MG S5 EV at the just-concluded Malaysia Autoshow 2025. The electric SUV rival to the Proton eMas 7 and BYD Atto 3 was there, but they weren’t […]\nThe post MG S5 EV launch date confirmed, May 20 – eMas 7 rival fr R…",
            "source": "Paul Tan's Automotive News",
            "url": "https://paultan.org/2025/05/16/mg-s5-ev-launch-date-confirmed-may-20-emas-7-rival-fr-rm115k-est-early-birds-get-rm5k-disc-wallbox/",
            "publishedAt": "2025-05-16T03:37:14Z"
        },
        {
            "title": "BYD’s funky new kei car spotted testing: Here’s our first look at the mini EV",
            "description": "BYD is about to launch an even smaller EV, but this one’s a little different. It’s BYD’s first kei car. You know, those tiny vehicles that dominate Japan’s city streets? BYD’s mini EV was just spotted out in public, giving us our first real look at the upcomi…",
            "source": "Electrek",
            "url": "http://electrek.co/2025/05/16/byds-funky-new-kei-car-spotted-testing-first-look-mini-ev/",
            "publishedAt": "2025-05-16T21:39:13Z"
        },
        {
            "title": "BYD's independent SiC development powers breakthrough megawatt charging",
            "description": "Leading Chinese new energy vehicle (NEV) maker BYD grabbed market headlines in the first quarter of 2025 with the unveiling of its megawatt-level flash charging technology. Silicon carbide (SiC) semiconductors played an instrumental role in this technological…",
            "source": "Digitimes",
            "url": "https://www.digitimes.com/news/a20250514PD202/sic-byd-development-vehicle-market.html",
            "publishedAt": "2025-05-16T07:51:18Z"
        },
        {
            "title": "BYD's First Mini EV Spotted- Will the Kei Car Launch In India?",
            "description": "BYD&#039;s first mini electric car, or Kei car, has a boxy design and a sliding door, which is typical in this category.",
            "source": "NDTV News",
            "url": "https://www.ndtv.com/auto/byds-first-mini-ev-spotted-will-the-kei-car-launch-in-india-8428703",
            "publishedAt": "2025-05-16T08:08:48Z"
        },
        {
            "title": "Hungary continues to woo China as BYD opens up European centre, creating 2,000 new jobs in the region",
            "description": "Chinese electric-vehicle giant BYD will open a European centre in Hungary, creating 2,000 new jobs, the government said on Thursday, as Prime Minister Viktor Orban has been wooing China.\nIn recent years, the central European country of 9.6 million people has …",
            "source": "Biztoc.com",
            "url": "https://biztoc.com/x/ebee92348524a6c1",
            "publishedAt": "2025-05-16T09:10:18Z"
        }
    ],
    "2025-05-09": [
        {
            "title": "China Auto Part Makers All Of A Sudden Triple In Thailand",
            "description": "China Auto Part Makers All Of A Sudden Triple In Thailand\n \nChinese auto parts makers have tripled their presence in Thailand with the arrival of BYD and other car brands, transforming the country into a key supply base for Asian markets, according to Nikkei.…",
            "source": "Biztoc.com",
            "url": "https://biztoc.com/x/f760cf54725ed3a8",
            "publishedAt": "2025-05-09T22:53:33Z"
        },
        {
            "title": "China denies reports BYD, Tsingshan have scrapped investment plans in Chile",
            "description": "Chinese automaker BYD and metals group Tsingshan have not said they are backing out of planned investments in Chile, the Chinese embassy in the Latin...",
            "source": "Yahoo Entertainment",
            "url": "https://finance.yahoo.com/news/china-denies-reports-byd-tsingshan-144443528.html",
            "publishedAt": "2025-05-09T14:44:43Z"
        },
        {
            "title": "2024 Chery Omoda E5 now RM98,818 – huge RM48k rebate, free wallbox, V2L cable, RM1k charging credits",
            "description": "Here’s the timeline – Proton eMas 7 launches with a starting price in the low hundred thousands, BYD Atto 3 goes down by RM26k to match the top-spec eMas 7, Chery Omoda E5 goes down by RM27k to RM120k (for 2024 models). Now, Chery Malaysia has announced via a…",
            "source": "Paul Tan's Automotive News",
            "url": "https://paultan.org/2025/05/09/2024-chery-omoda-e5-now-rm98818-huge-rm48k-rebate-free-wallbox-v2l-cable-rm1k-charging-credits/",
            "publishedAt": "2025-05-09T02:37:25Z"
        },
        {
            "title": "Nissan pulls the plug on its +$1 billion EV battery plant as the alarm bells go off",
            "description": "As it scrambles to turn things around, Nissan is scrapping plans to build a new LFP battery plant in Japan. The facility was expected to be key to reducing EV battery costs to keep up with leaders like BYD.\n\n\n\n more…",
            "source": "Electrek",
            "url": "http://electrek.co/2025/05/09/nissan-scraps-1-billion-ev-battery-plant-as-alarm-bells-go-off/",
            "publishedAt": "2025-05-09T14:15:36Z"
        },
        {
            "title": "China Hybrid Electric Vehicle Battery Market Share, Industry Trends & Growth Forecasts (2025-2030) | Lithium-Ion Batteries Lead China's Hybrid EV Revolution Amidst Plummeting Prices",
            "description": "The rise in EV adoption and falling lithium-ion battery prices will boost market growth. Key players include LG Energy, Toshiba, and BYD. The rise in EV adoption and falling lithium-ion battery prices will boost market growth. Key players include LG Energy, T…",
            "source": "GlobeNewswire",
            "url": "https://www.globenewswire.com/news-release/2025/05/09/3078064/28124/en/China-Hybrid-Electric-Vehicle-Battery-Market-Share-Industry-Trends-Growth-Forecasts-2025-2030-Lithium-Ion-Batteries-Lead-China-s-Hybrid-EV-Revolution-Amidst-Plummeting-Prices.html",
            "publishedAt": "2025-05-09T10:19:00Z"
        },
        {
            "title": "BYD and Chinese EV peers eye South Korea as export market",
            "description": "BYD and Chinese EV peers eye South Korea as export market\nSuccess in the Hyundai-dominated country could burnish the image of Chinese-made EVs globally, analysts say\n“South Korea is a developed auto market that abounds with international marques and establish…",
            "source": "Biztoc.com",
            "url": "https://biztoc.com/x/9e52326981e49c01",
            "publishedAt": "2025-05-09T09:41:34Z"
        },
        {
            "title": "Brokerages Set Boyd Gaming Co. (NYSE:BYD) Target Price at $95.07",
            "description": "Boyd Gaming Co. (NYSE:BYD – Get Free Report) has been assigned a consensus rating of “Moderate Buy” from the fifteen research firms that are covering the stock, Marketbeat.com reports. Six equities research analysts have rated the stock with a hold rating and…",
            "source": "ETF Daily News",
            "url": "https://www.etfdailynews.com/2025/05/09/brokerages-set-boyd-gaming-co-nysebyd-target-price-at-95-07/",
            "publishedAt": "2025-05-09T06:51:01Z"
        }
    ],
    "2025-05-14": [
        {
            "title": "Top 20 EV brands in April 2025 – BYD leads Proton; Denza beats Xpeng, Zeekr; Dongfeng rejoins list",
            "description": "BYD was the best-selling electric vehicle (EV) brand in Malaysia in April 2025, according to vehicle registration data released by the road transport department (JPJ). With a multi-vehicle line-up, the Chinese brand saw 1,048 registrations […]\nThe post Top 20…",
            "source": "Paul Tan's Automotive News",
            "url": "https://paultan.org/2025/05/14/top-20-ev-brands-malaysia-apr-2025/",
            "publishedAt": "2025-05-14T02:30:08Z"
        },
        {
            "title": "Is BYD making a kei EV for the Japanese market?",
            "description": "The bid for world domination continues for BYD, with its next move set to steamroll the Japanese market with a curious new model – an electric kei car. A spyshot posted on Car News China […]\nThe post Is BYD making a kei EV for the Japanese market? appeared fi…",
            "source": "Paul Tan's Automotive News",
            "url": "https://paultan.org/2025/05/14/is-byd-making-a-kei-ev-for-the-japanese-market/",
            "publishedAt": "2025-05-14T10:22:10Z"
        },
        {
            "title": "BYD tops Singapore vehicle sales so far this year, replacing Toyota",
            "description": null,
            "source": "Yahoo Entertainment",
            "url": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_5b289550-3688-40b4-8d60-51710eb55f20",
            "publishedAt": "2025-05-14T06:19:53Z"
        },
        {
            "title": "BYD's PHEV strategy accelerates in Europe, catching competitors off guard",
            "description": "China's new energy vehicle leader and the world's third-largest automaker, BYD, made headlines by topping plug-in hybrid electric vehicle (PHEV) sales in Europe in March. This milestone signals that BYD has found a breakthrough to counterattack in the Europea…",
            "source": "Digitimes",
            "url": "https://www.digitimes.com/news/a20250512PD234/byd-europe-phev-vehicle-sales.html",
            "publishedAt": "2025-05-14T22:29:23Z"
        },
        {
            "title": "Infineon sounds alarm as Silan and BYD gain market share",
            "description": "Driven by new energy vehicle subsidy policies, the localization wave of automotive chips in China is intensifying, accelerating the domestic substitution process. Chinese integrated device manufacturers (IDM) such as Silan and BYD have achieved breakthrough g…",
            "source": "Digitimes",
            "url": "https://www.digitimes.com/news/a20250514PD208/byd-silan-infineon-hua-hong-semiconductor-automotive-semiconductors.html",
            "publishedAt": "2025-05-14T02:53:46Z"
        },
        {
            "title": "BYD’s latest low-cost EV hits dealerships: Meet the new e7",
            "description": "BYD’s latest low-cost EV, the e7, is now arriving at dealerships in China. The e7 is about the size of the Tesla Model 3 and is part of BYD’s more affordable e-series lineup.\n\n\n\n more…",
            "source": "Electrek",
            "url": "http://electrek.co/2025/05/14/byds-latest-low-cost-ev-hits-dealerships-meet-new-e7/",
            "publishedAt": "2025-05-14T16:54:41Z"
        }
    ],
    "2025-05-13": [
        {
            "title": "BYD Shark 1.99% finance for ABN holders",
            "description": "Another offer that businesses may be interested in, low finance offer for BYD Shark. Needs to be delivered by 30 June 2025.",
            "source": "Ozbargain.com.au",
            "url": "https://www.ozbargain.com.au/node/905562",
            "publishedAt": "2025-05-13T05:05:00Z"
        },
        {
            "title": "Top 20 brands in April 2025 – Perodua on top, Proton second; BYD sixth; Mercedes-Benz ahead of BMW",
            "description": "Perodua continues to lead other brands in terms of vehicle registrations for the month of April 2025. Data from the road transport department (JPJ) revealed the local carmaker sold 27,371 units last month, which brings […]\nThe post Top 20 brands in April 2025…",
            "source": "Paul Tan's Automotive News",
            "url": "https://paultan.org/2025/05/13/top-20-car-brands-malaysia-apr-2025/",
            "publishedAt": "2025-05-13T06:11:45Z"
        },
        {
            "title": "BYD just had its best sales week of 2025 in China with nearly 68,000 EV registrations",
            "description": "China’s EV giant is on a roll. BYD is coming off its best sales week in China of 2025, racking up nearly 68,000 registrations. In comparison, Tesla logged just over 3,000.\n\n\n\n more…",
            "source": "Electrek",
            "url": "http://electrek.co/2025/05/13/byd-best-sales-week-2025-china-nearly-68000/",
            "publishedAt": "2025-05-13T20:42:19Z"
        },
        {
            "title": "Nissan pulls the plug on +$1 billion EV battery plant and more as the alarm bells go off",
            "description": "As it scrambles to turn things around, Nissan is scrapping plans to build a new LFP battery plant in Japan. The facility was expected to be key to reducing EV battery costs to keep up with leaders like BYD. With alarm bells ringing, Nissan is preparing to cut…",
            "source": "Electrek",
            "url": "http://electrek.co/2025/05/13/nissan-scraps-1-billion-ev-plant-and-more-as-alarm-bells-go-off/",
            "publishedAt": "2025-05-13T18:22:21Z"
        },
        {
            "title": "BYD’s delayed Brazil factory to be operational by 2026 end",
            "description": "The company's vehicle sales in Brazil soared to 76,713 last year, a 328% jump from 17,937 in 2023.",
            "source": "Just-auto.com",
            "url": "https://www.just-auto.com/news/byds-brazil-factory-operational-by-2026/",
            "publishedAt": "2025-05-13T17:43:42Z"
        }
    ],
    "2025-05-15": [
        {
            "title": "Leapmotor C10 BEV or REEV Ultra Hybrid Finance - 1.9% P.a. Comparison Rate 36-Month Term & Free Wall Charger @ Leapmotor",
            "description": "Similar to the BYD deal for EOFY (doesn't look like you need to be an ABN holder) Leapmotor C10 - 1.9% Comparison Rate & Free Wall Charger Lock in an exceptional rate on the all-new …",
            "source": "Ozbargain.com.au",
            "url": "https://www.ozbargain.com.au/node/905872",
            "publishedAt": "2025-05-15T04:37:14Z"
        },
        {
            "title": "BYD’s first mini EV was just spotted and it’s about to shake up Japan’s kei car market",
            "description": "BYD is about to launch another low-cost electric car, but this one’s a little different. It’s BYD’s first kei car. You know, those tiny vehicles that dominate Japan’s city streets? BYD’s mini EV was just spotted out in public, giving us our first real look at…",
            "source": "Electrek",
            "url": "http://electrek.co/2025/05/15/byds-mini-ev-spotted-coming-for-japans-kei-cars/",
            "publishedAt": "2025-05-15T22:11:02Z"
        },
        {
            "title": "BYD to make Hungary its European center",
            "description": "BYD Company Limited Chief Executive Officer (CEO) Wang Chuanfu announced on Thursday that its battery electric vehicle (BEV)-making subsidiary BYD Auto Co., Ltd. will open its European center in Budap...",
            "source": "Biztoc.com",
            "url": "https://biztoc.com/x/09a250d4da5ea90c",
            "publishedAt": "2025-05-15T15:49:15Z"
        },
        {
            "title": "Raymond James Has Bearish Estimate for TSE:BYD Q1 Earnings",
            "description": "Boyd Group Services Inc. (TSE:BYD – Free Report) – Investment analysts at Raymond James decreased their Q1 2025 earnings estimates for shares of Boyd Group Services in a research note issued to investors on Monday, May 12th. Raymond James analyst S. Hansen no…",
            "source": "ETF Daily News",
            "url": "https://www.etfdailynews.com/2025/05/15/raymond-james-has-bearish-estimate-for-tsebyd-q1-earnings/",
            "publishedAt": "2025-05-15T05:00:59Z"
        }
    ],
    "2025-05-12": [
        {
            "title": "BYD’s latest low-cost EV hits dealerships: Meet the new e7",
            "description": "BYD’s latest low-cost EV, the e7, is now arriving at dealerships in China. The e7 is about the size of the Tesla Model 3 and is part of BYD’s more affordable e-series lineup.\n\n\n\n more…",
            "source": "Electrek",
            "url": "http://electrek.co/2025/05/12/byds-latest-low-cost-ev-hits-dealerships-meet-new-e7/",
            "publishedAt": "2025-05-12T18:11:22Z"
        },
        {
            "title": "Nissan pulls the plug on its +$1 billion EV battery plant as the alarm bells go off",
            "description": "As it scrambles to turn things around, Nissan is scrapping plans to build a new LFP battery plant in Japan. The facility was expected to be key to reducing EV battery costs to keep up with leaders like BYD. With alarm bells ringing, Nissan is preparing to cut…",
            "source": "Electrek",
            "url": "http://electrek.co/2025/05/12/nissan-scraps-1-billion-ev-battery-plant-as-alarm-bells-go-off/",
            "publishedAt": "2025-05-12T13:15:03Z"
        },
        {
            "title": "Automakers' share of China NEV market in Apr: BYD No. 1 with 29.7%, Tesla No. 8 with 3.2%",
            "description": "BYD (HKG: 1211, OTCMKTS: BYDDY) maintained its position as China's largest new energy-vehicle (NEV) maker in April, while Tesla (NASDAQ: TSLA) slipped in the rankings.\nBYD had retail sales of 268,778 NEVs in April, up 5.8 percent from 254,131 in the same mont…",
            "source": "Biztoc.com",
            "url": "https://biztoc.com/x/f6d926831000bdf9",
            "publishedAt": "2025-05-12T12:55:26Z"
        },
        {
            "title": "BYD factory delayed in Brazil to be ‘fully functional’ by end of 2026, official says",
            "description": "BYD investment in Brazil – its biggest market outside China – aims to turn factory into complex with capacity to make 150,000 EVs a year.",
            "source": "Biztoc.com",
            "url": "https://biztoc.com/x/671a8c7db4e7bf28",
            "publishedAt": "2025-05-12T21:39:48Z"
        }
    ]
}