{
    "2025-05-15": [
        {
            "title": "Occidental Petroleum, ExxonMobil, Chevron Fall In Pre-Market As Oil Prices Plunge Amid Trump's US-Iran Nuclear Deal Comments",
            "description": "During the pre-market trading session on Thursday, Occidental Petroleum Corp (NYSE:OXY) fell 2.56%, Exxon Mobil Corp (NYSE:XOM) declined 2.39%, while Chevron Corp (NYSE:CVX) fell 1.50% as oil prices saw a considerable drop. This decline is attributed to the p…",
            "source": "Biztoc.com",
            "url": "https://biztoc.com/x/42bee79ab7714301",
            "publishedAt": "2025-05-15T10:16:53Z"
        },
        {
            "title": "Guyana Soldiers Attacked by Venezuela Amid Oil Territory Dispute",
            "description": "In a significant escalation of the longstanding territorial dispute over the oil-rich Essequibo region made famous by a string of ExxonMobil discoveries, the Guyana Defence Force (GDF) said on Thursday that its troops were attacked by armed individuals in civ…",
            "source": "OilPrice.com",
            "url": "https://oilprice.com/Latest-Energy-News/World-News/Guyana-Soldiers-Attacked-by-Venezuela-Amid-Oil-Territory-Dispute.html",
            "publishedAt": "2025-05-15T18:00:00Z"
        }
    ],
    "2025-05-08": [
        {
            "title": "Marubeni to Invest in ExxonMobil Ammonia Project in Texas",
            "description": "The Japanese diversified company also agreed to buy about 250,000 metric tons a year of ammonia from the planned project.",
            "source": "Rigzone",
            "url": "https://www.rigzone.com/news/marubeni_to_invest_in_exxonmobil_ammonia_project_in_texas-08-may-2025-180467-article/",
            "publishedAt": "2025-05-08T09:41:15Z"
        }
    ],
    "2025-05-12": [
        {
            "title": "Boulder’s landmark climate lawsuit against Suncor and Exxon can continue, Colorado Supreme Court rules",
            "description": "Boulder and Boulder County filed the lawsuit seven years ago, seeking to hold Suncor Energy and ExxonMobil accountable for driving climate change and the damages their pollution has caused.",
            "source": "The Denver Post",
            "url": "https://www.denverpost.com/2025/05/12/boulder-climate-lawsuit-exxon-suncor-colorado-supreme-court/",
            "publishedAt": "2025-05-12T19:55:33Z"
        }
    ]
}