{
    "2025-05-15": [
        {
            "title": "Meta’s smart glasses can now describe what you’re seeing in more detail",
            "description": "Meta announced two new features designed to assist blind or low vision users by leveraging the Ray-Ban Meta smart glasses’ camera and its access to Meta AI. The news came as part of Global Accessibility Awareness Day. Rolling out to all users in the US and Ca…",
            "source": "The Verge",
            "url": "https://www.theverge.com/news/667613/ray-ban-meta-smart-glasses-ai-detailed-responses-call-a-volunteer",
            "publishedAt": "2025-05-15T13:47:59Z"
        },
        {
            "title": "Meta asks judge to throw out antitrust case mid-trial",
            "description": "Meta has filed a motion for judgment on the antitrust case it’s currently fighting in court. The motion argues that the Federal Trade Commission (FTC) has failed to produce any evidence that Meta unlawfully monopolized part of the social networking market, so…",
            "source": "The Verge",
            "url": "https://www.theverge.com/antitrust/668099/meta-ftc-antitrust-motion-partial-findings-instagram-whatsapp",
            "publishedAt": "2025-05-15T23:50:26Z"
        },
        {
            "title": "Ray-Ban Meta Glasses Get Smarter for Low Vision Users. Here's How",
            "description": "Meta shared multiple announcements for Global Accessibility Awareness Day.",
            "source": "CNET",
            "url": "https://www.cnet.com/tech/ray-ban-meta-glasses-get-smarter-for-low-vision-users-heres-how/",
            "publishedAt": "2025-05-15T19:38:09Z"
        },
        {
            "title": "Meta Reportedly Delays 'Behemoth' AI Model: What This Could Mean for Its AI Tools",
            "description": "This fresh delay adds to concerns that Meta could fall behind other major AI providers like OpenAI and Google.",
            "source": "CNET",
            "url": "https://www.cnet.com/tech/services-and-software/meta-reportedly-delays-behemoth-ai-model-what-this-could-mean-for-its-ai-tools/",
            "publishedAt": "2025-05-15T21:12:00Z"
        },
        {
            "title": "Being a detective in VR is even better than playing Phoenix Wright",
            "description": "Ghost Town and Shattered are two amazing detective games set in very different scenarios, all playable only on the Meta Quest platform.",
            "source": "Android Central",
            "url": "https://www.androidcentral.com/gaming/vr-games/being-a-detective-in-vr-is-even-better-than-playing-phoenix-wright",
            "publishedAt": "2025-05-15T18:00:00Z"
        },
        {
            "title": "It looks like Meta just hit a big AI roadblock",
            "description": "Meta (META) reportedly has delayed the release of its latest artificial intelligence model, known internally as “Behemoth,” raising concerns among employees about the effectiveness and direction of the company’s massive AI investments. Read more...",
            "source": "Quartz India",
            "url": "https://qz.com/meta-ai-llama-behemoth-delays-mark-zuckerberg-1851780929",
            "publishedAt": "2025-05-15T21:40:00Z"
        },
        {
            "title": "Meta to Train AI on E.U. User Data From May 27 Without Consent; Noyb Threatens Lawsuit",
            "description": "Austrian privacy non-profit noyb (none of your business) has sent Meta's Irish headquarters a cease-and-desist letter, threatening the company with a class action lawsuit if it proceeds with its plans to train users' data for training its artificial intellige…",
            "source": "Internet",
            "url": "https://thehackernews.com/2025/05/meta-to-train-ai-on-eu-user-data-from.html",
            "publishedAt": "2025-05-15T16:45:00Z"
        },
        {
            "title": "\"Meta AI non-compliant with GDPR\" – Digital rights group menaces Meta with injunction over EU AI training",
            "description": "noyb has sent a cease and desist letter asking to halt Meta AI training scheduled to kick off on May 27 as an opt-out option. Here's all you need to know.",
            "source": "TechRadar",
            "url": "https://www.techradar.com/computing/cyber-security/meta-ai-non-compliant-with-gdpr-digital-rights-group-menaces-meta-with-injunction-over-eu-ai-training",
            "publishedAt": "2025-05-15T15:34:17Z"
        },
        {
            "title": "Should Facebook's Meta buy Cerebras and Groq to make Llama the Android of LLMs? I think it totally makes sense",
            "description": "Meta should buy Groq and Cerebras to secure Llama’s open AI future.",
            "source": "TechRadar",
            "url": "https://www.techradar.com/pro/should-facebooks-meta-buy-cerebras-and-groq-to-make-llama-the-android-of-llms-i-think-it-totally-makes-sense",
            "publishedAt": "2025-05-15T17:50:00Z"
        }
    ],
    "2025-05-17": [
        {
            "title": "Meta faces Democratic probe into plans to power a giant data center with gas",
            "description": "Meta’s building a new AI data center so massive in Louisiana that the local utility company has plans to construct three new gas-fired power plants to provide it with enough electricity. Now, advocates and lawmakers are pressing Meta for answers about how it’…",
            "source": "The Verge",
            "url": "https://www.theverge.com/news/668934/meta-ai-data-center-gas-energy-climate-sustainability",
            "publishedAt": "2025-05-17T00:04:09Z"
        }
    ],
    "2025-05-08": [
        {
            "title": "Instagram CEO testifies about competing with TikTok: ‘You’re either growing, or you’re slowly dying’",
            "description": "When Adam Mosseri took over Meta-owned Instagram as CEO in 2018, the app was experiencing what he'd later call \"concerning\" drops and plateaus in user engagement, thanks partly to fierce competition from a new app: TikTok. Instagram estimated in 2019 that 23 …",
            "source": "The Verge",
            "url": "https://www.theverge.com/antitrust/663894/instagram-ceo-adam-mosseri-ftc-meta-antitrust-trial",
            "publishedAt": "2025-05-08T22:00:30Z"
        },
        {
            "title": "What we learned from Instagram boss Adam Mosseri's testimony at the Meta antitrust trial",
            "description": "Head of Instagram Adam Mosseri testified Thursday in the Meta antitrust trial in DC federal court.",
            "source": "Business Insider",
            "url": "https://www.businessinsider.com/instagram-head-adam-mosseri-testifies-in-meta-ftc-antitrust-trial-2025-5",
            "publishedAt": "2025-05-08T21:22:55Z"
        },
        {
            "title": "Instagram's top executive says the company has spent 'hundreds of millions' of dollars wooing creators",
            "description": "Adam Mosseri, head of Instagram, took the stand during the FTC v. Meta antitrust trial.",
            "source": "Business Insider",
            "url": "https://www.businessinsider.com/instagram-spent-hundreds-of-millions-dollars-creators-ftc-adam-mosseri-2025-5",
            "publishedAt": "2025-05-08T20:19:16Z"
        },
        {
            "title": "Mark Zuckerberg says his management style involves no 1-on-1s, few direct reports, and a 'core army' of 30 running Meta",
            "description": "Mark Zuckerberg said he gets \"really frustrated\" and in a \"bad mood\" if he doesn't block out time in his schedule to work on key tasks each day.",
            "source": "Business Insider",
            "url": "https://www.businessinsider.com/meta-ceo-mark-zuckerberg-management-style-direct-reports-delegation-2025-5",
            "publishedAt": "2025-05-08T13:47:53Z"
        },
        {
            "title": "Apple reportedly planning to introduce Meta Ray-Ban style smart glasses around 2027",
            "description": "Mark Gurman reports for Bloomberg News that Apple is developing a chip intended for smart glasses that could come to market in the next two years. However, these smart glasses may not be the highly advanced augmented reality glasses that Apple envisions makin…",
            "source": "9to5Mac",
            "url": "https://9to5mac.com/2025/05/08/apple-reportedly-planning-to-introduce-meta-ray-ban-style-smart-glasses-around-2027/",
            "publishedAt": "2025-05-08T17:26:25Z"
        },
        {
            "title": "Memo: Meta CPO Chris Cox says Robert Fergus will lead its Facebook AI Research lab, succeeding Joelle Pineau; Fergus and Yann LeCun co-founded FAIR in 2014 (Riley Griffin/Bloomberg)",
            "description": "Riley Griffin / Bloomberg:\nMemo: Meta CPO Chris Cox says Robert Fergus will lead its Facebook AI Research lab, succeeding Joelle Pineau; Fergus and Yann LeCun co-founded FAIR in 2014  —  Fergus co-founded the Facebook AI Research lab, known as FAIR, in 2014 w…",
            "source": "Techmeme.com",
            "url": "https://www.techmeme.com/250508/p33",
            "publishedAt": "2025-05-08T16:20:01Z"
        },
        {
            "title": "Apple Designing Chips for Smart Glasses That Rival Meta Ray-Bans",
            "description": "Apple is working on new chips that are destined for smart glasses that would compete with Meta's Ray-Bans, reports Bloomberg. The chip is in development now, with Apple targeting mass production in 2026 or 2027 for a launch in the next two years or so.\n\n\n\n\n\nT…",
            "source": "MacRumors",
            "url": "https://www.macrumors.com/2025/05/08/apple-chips-smart-glasses/",
            "publishedAt": "2025-05-08T17:01:08Z"
        },
        {
            "title": "The European Commission is facing pressure from member states, led by Ireland, to require Google, Meta, and others to vet financial ads for potential scams (Financial Times)",
            "description": "Financial Times:\nThe European Commission is facing pressure from member states, led by Ireland, to require Google, Meta, and others to vet financial ads for potential scams  —  EU member states push for rule change to make tech groups shoulder responsibility …",
            "source": "Techmeme.com",
            "url": "https://www.techmeme.com/250508/p15",
            "publishedAt": "2025-05-08T08:40:01Z"
        },
        {
            "title": "Meta Quest+ Gets A Horizon+ Rebrand",
            "description": "Meta's Quest+ subscription is now called Horizon+, in a move some might say is cynical but does have some sensible roots given Meta's future headset plans.",
            "source": "Forbes",
            "url": "https://www.forbes.com/sites/andrewwilliams/2025/05/08/meta-quest-gets-a-horizon-rebrand/",
            "publishedAt": "2025-05-08T23:14:52Z"
        },
        {
            "title": "Meta Introduces Threads Video Ads, Reels Trending Positions And Other New Options For Advertisers",
            "description": "Social media giant Meta Platforms is introducing Threads video ads Reels trending placement and several other innovations for advertisers. The company announced the new offerings in a blog post Thursday as it was convening a NewFronts presentation in New York…",
            "source": "Deadline",
            "url": "http://deadline.com/2025/05/meta-threads-video-ads-reels-facebook-advertisers-1236390083/",
            "publishedAt": "2025-05-08T18:15:00Z"
        },
        {
            "title": "Facebook owner Meta set for $167 million windfall after NSO Group ordered to pay up over WhatsApp spyware campaign",
            "description": "Israel's NSO Group has been ordered to pay over $167 million in damages to Meta over 2019 WhatsApp spyware campaign.",
            "source": "TechRadar",
            "url": "https://www.techradar.com/pro/security/nso-group-ordered-to-pay-meta-millions-following-whatsapp-spyware-campaign",
            "publishedAt": "2025-05-08T11:02:00Z"
        }
    ],
    "2025-05-14": [
        {
            "title": "Meta’s beef with the press flares at its antitrust trial",
            "description": "Long-simmering tension between Silicon Valley and the press that covers it is surfacing during the Federal Trade Commission's antitrust trial against Meta. During a heated cross-examination of the FTC's key economic expert, Scott Hemphill, Meta's lead attorne…",
            "source": "The Verge",
            "url": "https://www.theverge.com/politics/666507/meta-tech-press-antitrust-trial",
            "publishedAt": "2025-05-14T00:35:17Z"
        },
        {
            "title": "Meta wants your smile, squats, and small talk — and it's paying $50 an hour to scan them",
            "description": "Project Warhol comes as Meta calls 2025 its \"most critical year\" for VR, avatars, and AI wearables.",
            "source": "Business Insider",
            "url": "https://www.businessinsider.com/meta-project-warhol-avatar-data-metaverse-smart-glasses-2025",
            "publishedAt": "2025-05-14T17:18:04Z"
        },
        {
            "title": "NSO Group kept spying on WhatsApp users despite Meta lawsuit",
            "description": "Last week, Israeli firm NSO Group, best known for its Pegasus spyware targeting iPhones and Android devices, was ordered to pay Meta more than $167M for targeting WhatsApp users.\n\n\n\nNow, TechCrunch has published an interesting report based on the 1,000+ page …",
            "source": "9to5Mac",
            "url": "https://9to5mac.com/2025/05/13/nso-group-kept-spying-despite-meta-lawsuit/",
            "publishedAt": "2025-05-14T01:07:50Z"
        }
    ],
    "2025-05-10": [
        {
            "title": "Microsoft taps ex-Meta marketing boss to boost Copilot AI",
            "description": "A former Meta and Time Warner executive has snagged the role of global creative director for Microsoft AI.",
            "source": "Android Central",
            "url": "https://www.androidcentral.com/apps-software/microsoft-taps-ex-meta-marketing-boss-to-boost-copilot-ai",
            "publishedAt": "2025-05-10T14:59:43Z"
        },
        {
            "title": "Mark Zuckerberg says AI could soon do the work of some engineers at Meta. Here's how AI is shaking up other Big Tech firms.",
            "description": "Meta CEO Mark Zuckerberg said technologies like AI mean founders can better \"focus on the core idea\" of their companies.",
            "source": "Business Insider",
            "url": "https://www.businessinsider.com/mark-zuckerberg-ai-startup-company-with-small-team-2025-5",
            "publishedAt": "2025-05-10T08:45:02Z"
        }
    ],
    "2025-05-11": [
        {
            "title": "The US Copyright Office has thoughts on how AI is trained. Big Tech may not like it.",
            "description": "AI companies like OpenAI and Meta use data made by others to train their AI models. The US Copyright Office says, in some cases, that may be illegal.",
            "source": "Business Insider",
            "url": "https://www.businessinsider.com/ai-training-copyright-laws-big-tech-fair-use-openai-meta-2025-5",
            "publishedAt": "2025-05-11T23:59:36Z"
        }
    ],
    "2025-05-13": [
        {
            "title": "Meta pulled a 'totally AI fake' ad of Jamie Lee Curtis after the actress wrote an open letter about it to Mark Zuckerberg",
            "description": "Actress Jamie Lee Curtis wrote an open letter to Meta CEO Mark Zuckerberg on Instagram, asking him to remove an ad showing her without her permission.",
            "source": "Business Insider",
            "url": "https://www.businessinsider.com/meta-pulls-ad-jamie-lee-curtis-mark-zuckerberg-2025-5",
            "publishedAt": "2025-05-13T16:58:06Z"
        },
        {
            "title": "Meta's 2026 smart glasses will reportedly boost Live AI and identify faces",
            "description": "A report seemingly highlighted Meta's plans for its 2026 smart glasses, like improved Live AI and \"super sensing.\"",
            "source": "Android Central",
            "url": "https://www.androidcentral.com/gaming/virtual-reality/meta-2026-smart-glasses-live-ai-facial-software-report",
            "publishedAt": "2025-05-13T20:29:23Z"
        },
        {
            "title": "Jamie Lee Curtis Celebrates Meta's Removal of Fake AI Ad: 'Shame Has Its Value'",
            "description": "The video showed the \"Halloween\" legend hawking something she \"didn't authorize, agree to or endorse.\"",
            "source": "CNET",
            "url": "https://www.cnet.com/tech/services-and-software/jamie-lee-curtis-celebrates-metas-removal-of-fake-ai-ad-shame-has-its-value/",
            "publishedAt": "2025-05-13T19:35:32Z"
        },
        {
            "title": "Ray-Ban Meta Glasses Come to India: Experience the Future with Meta AI Integrated and Multiple Styles on Offer",
            "description": "Ray-Ban Meta glasses are now coming to India - combining iconic style and cutting-edge technology to let people stay present and connected to who and what they care about most. \nThe post Ray-Ban Meta Glasses Come to India: Experience the Future with Meta AI I…",
            "source": "Fb.com",
            "url": "https://about.fb.com/news/2025/05/ray-ban-meta-glasses-come-to-india-experience-the-future-with-meta-ai-integrated-and-multiple-styles-on-offer/",
            "publishedAt": "2025-05-13T04:43:39Z"
        },
        {
            "title": "Meta Threatens To Pull Facebook And Instagram Out Of Nigeria Over $290 Million Fine Imposed For Violation Of Local Privacy Laws",
            "description": "It’s hardly a secret that Meta is an unpleasant company. That’s reflected both in terms of what happens behind closed doors, and its actions in the market. Some of its attempts to bully nations or even large economic blocks are well documented. But its threat…",
            "source": "Techdirt",
            "url": "https://www.techdirt.com/2025/05/13/meta-threatens-to-pull-facebook-and-instagram-out-of-nigeria-over-290-million-fine-imposed-for-violation-of-local-privacy-laws/",
            "publishedAt": "2025-05-13T19:14:00Z"
        },
        {
            "title": "NSO Group Owes Meta $167 Million In Damages For Using WhatsApp Servers To Deliver Malware",
            "description": "We’ll have to see if NSO Group has this sort of cash just laying around. Seems unlikely, what with its financial backers pulling out in response to a steady stream of negative headlines, as well as the company considering exiting the highly-profitable offensi…",
            "source": "Techdirt",
            "url": "https://www.techdirt.com/2025/05/13/nso-group-owes-meta-167-million-in-damages-for-using-whatsapp-servers-to-deliver-malware/",
            "publishedAt": "2025-05-13T16:30:21Z"
        },
        {
            "title": "Jamie Lee Curtis Shames Mark Zuckerberg Into Taking Down “Totally AI Fake” Ad Featuring Her Likeness",
            "description": "Jamie Lee Curtis has succeeded in having Meta remove an AI-generated ad featuring her likeness. The Oscar winner took to Instagram on Monday to publicly “shame” Meta CEO Mark Zuckerberg into taking down a “totally AI fake commercial” on his social media platf…",
            "source": "Deadline",
            "url": "http://deadline.com/2025/05/jamie-lee-curtis-shames-mark-zuckerberg-removing-ai-fake-ad-1236394708/",
            "publishedAt": "2025-05-13T01:05:34Z"
        }
    ],
    "2025-05-09": [
        {
            "title": "Mark Zuckerberg is a certified watch guy. Here are some of his standout timepieces, from a $120 Casio to a $900,000 design.",
            "description": "Mark Zuckerberg once dressed simply. Now, the Meta CEO accessorizes almost every outfit with a luxury watch from his collection of pricey timepieces.",
            "source": "Business Insider",
            "url": "https://www.businessinsider.com/mark-zuckerberg-watch-collection-2025-5",
            "publishedAt": "2025-05-09T10:02:01Z"
        },
        {
            "title": "I interviewed at multiple Big Tech companies and landed at Salesforce after a Meta layoff. These 6 things helped me stand out during my job search.",
            "description": "After a Meta layoff in 2023, Selma Mouloudj interviewed at Google, LinkedIn, TikTok, and Pinterest before landing her current job at Salesforce.",
            "source": "Business Insider",
            "url": "https://www.businessinsider.com/big-tech-job-interview-tips-from-account-exec-meta-salesforce-2025-5",
            "publishedAt": "2025-05-09T09:05:01Z"
        },
        {
            "title": "Being good at your job doesn't guarantee a promotion, says Meta engineer",
            "description": "Ryan Peterman, who also writes The Developing Dev newsletter, says making sure people are aware of your accomplishments is key.",
            "source": "Business Insider",
            "url": "https://www.businessinsider.com/meta-engineer-advice-how-to-get-promoted-2025-5",
            "publishedAt": "2025-05-09T18:33:10Z"
        },
        {
            "title": "Losing my Meta account because of release delays",
            "description": "I recently lost my Facebook account for two months, and was significantly cut off from certain aspects of society during that time. This is the dark side of account bans.",
            "source": "Madelinemiller.dev",
            "url": "https://madelinemiller.dev/blog/dark-side-account-bans/",
            "publishedAt": "2025-05-09T06:29:38Z"
        },
        {
            "title": "Meta rolls out its Account Status feature to Threads, letting users see when the company has removed or demoted posts or handed out other penalties (Karissa Bell/Engadget)",
            "description": "Karissa Bell / Engadget:\nMeta rolls out its Account Status feature to Threads, letting users see when the company has removed or demoted posts or handed out other penalties  —  Threads will finally start giving users more visibility into when their accounts a…",
            "source": "Techmeme.com",
            "url": "https://www.techmeme.com/250508/p54",
            "publishedAt": "2025-05-09T01:30:00Z"
        },
        {
            "title": "AI invades WhatsApp: ChatGPT and Meta now part of your chats",
            "description": "WhatsApp transforms into an AI hub with ChatGPT, Perplexity, and Meta AI integration. Users can now access advanced AI capabilities without leaving their",
            "source": "TalkAndroid",
            "url": "https://www.talkandroid.com/506400-ai-invades-whatsapp-chatgpt-and-meta-now-part-of-your-chats/",
            "publishedAt": "2025-05-09T15:30:00Z"
        },
        {
            "title": "Does Social Class Influence Generosity?",
            "description": "A meta-analysis asks whether higher- or lower-income people are more likely to be generous. Here's what they found.",
            "source": "Psychology Today",
            "url": "https://www.psychologytoday.com/us/blog/evidence-based-living/202505/does-social-class-influence-generosity",
            "publishedAt": "2025-05-09T21:55:43Z"
        },
        {
            "title": "Alien: Rogue Incursion Is Escaping VR With New Enhanced Edition",
            "description": "Last year, the Alien franchise returned to video games with Alien: Rogue Incursion, a VR-only title that was available on PS5, Meta Quest 3, and PC. Now, Rogue Incursion is set to get a new, non-VR enhanced edition that's just a few months away.Survios--the d…",
            "source": "GameSpot",
            "url": "https://www.gamespot.com/articles/alien-rogue-incursion-is-escaping-vr-with-new-enhanced-edition/1100-6531418/",
            "publishedAt": "2025-05-09T13:45:00Z"
        }
    ],
    "2025-05-16": [
        {
            "title": "Meta CEO Mark Zuckerberg recently gave rare hints about his Hawaii bunker. Here's everything we know about it.",
            "description": "Meta CEO Mark Zuckerberg shrugged off characterizations of the structure as a Doomsday bunker, instead calling it a \"little shelter\" or \"basement.\"",
            "source": "Business Insider",
            "url": "https://www.businessinsider.com/mark-zuckerberg-hawaii-underground-bunker-meta-ceo-2025-5",
            "publishedAt": "2025-05-16T18:06:43Z"
        },
        {
            "title": "Meta's Llama has reached a turning point with developers as delays and disappointment mount",
            "description": "Developers told Business Insider Llama is slipping from the cutting edge, but it still has a role.",
            "source": "Business Insider",
            "url": "https://www.businessinsider.com/meta-ai-llama-was-big-deal-developers-see-untapped-potential-2025-5",
            "publishedAt": "2025-05-16T09:00:02Z"
        },
        {
            "title": "Meta wants a judge to dismiss the FTC's antitrust case against it",
            "description": "Meta (META) has filed a motion for judgment to wrap up its antitrust trial, claiming it doesn’t want to spend more of anyone’s time or money. Facebook’s parent company claims that the Federal Trade Commission has not provided any evidence of unlawful monopoly…",
            "source": "Quartz India",
            "url": "https://qz.com/meta-antitrust-case-judge-ftc-motion-for-judgment-1851781028",
            "publishedAt": "2025-05-16T15:34:00Z"
        }
    ],
    "2025-05-12": [
        {
            "title": "Keebin’ with Kristina: the One With the MingKwai Typewriter",
            "description": "Sometimes, a little goes a long way. I believe that’s the case with this tiny media control bar from [likeablob] that uses an ESP32-C3 Super Mini. From left to right you’ve got a meta k…",
            "source": "Hackaday",
            "url": "https://hackaday.com/2025/05/12/keebin-with-kristina-the-one-with-the-mingkwai-typewriter/",
            "publishedAt": "2025-05-12T17:00:40Z"
        },
        {
            "title": "Meta Portal Pro concept reimagines immersive communication",
            "description": "Meta Portal Pro concept reimagines immersive communicationDuring the pandemic when we were all either working from home or doing hybrid setups with our companies, we saw some devices come out that...",
            "source": "Yanko Design",
            "url": "https://www.yankodesign.com/2025/05/12/meta-portal-pro-concept-reimagines-immersive-communication/",
            "publishedAt": "2025-05-12T10:07:02Z"
        },
        {
            "title": "Can Sandygast be shiny in Pokémon Go?",
            "description": "Sandygast, the sand heap Pokémon from Unova, can be found in the wild in Pokémon Go. Yes, Sandygast can be shiny in Pokémon Go! Neither of these Pokémon are super relevant to the meta, but you can use Palossand in the Ultra League for PvP, if you want. Luckil…",
            "source": "Polygon",
            "url": "https://www.polygon.com/pokemon-go-guide/598611/can-sandygast-be-shiny-palossand",
            "publishedAt": "2025-05-12T17:39:33Z"
        },
        {
            "title": "Apple’s smart glasses might run on this AI model",
            "description": "For the past few months, there have been plenty of rumors and reports about Apple’s plans to release AI-enabled wearables. Currently, it looks like Apple’s direct competitors to the Meta Ray-Bans will be launched around 2027, alongside AirPods with cameras, w…",
            "source": "9to5Mac",
            "url": "https://9to5mac.com/2025/05/12/fastvlm-model-might-run-on-apple-ai-glasses/",
            "publishedAt": "2025-05-12T21:59:46Z"
        },
        {
            "title": "‘The Rehearsal’ Season 2 Duped One Real Singer with the Fake Competition Series Bit: We Were ‘Lab Rats’",
            "description": "Former \"The Voice\" contestant Lana Love was among the singers who auditioned for a fictional \"Wings of Voice\" reality series on Nathan Fielder's controversial meta HBO series.",
            "source": "IndieWire",
            "url": "https://www.indiewire.com/news/general-news/the-rehearsal-season-2-duped-singer-fake-competition-series-1235122468/",
            "publishedAt": "2025-05-12T21:00:00Z"
        },
        {
            "title": "Colombian Filmmaker Simón Mesa Soto Gets Meta with Satirical Midlife Drama ‘Una Poeta’ — Watch Trailer",
            "description": "Colombian Fflmmaker Simón Mesa Soto directs 'Una Poeta' which will debut at Cannes 2025 in Un Certain Regard.",
            "source": "IndieWire",
            "url": "https://www.indiewire.com/news/trailers/una-poeta-trailer-simon-mesa-soto-cannes-1235122314/",
            "publishedAt": "2025-05-12T16:00:00Z"
        },
        {
            "title": "Christie’s to Auction Unique Gerald Charles Maestro GC39 Remaster Watch for Charity",
            "description": "SummaryA unique Gerald Charles Maestro GC39 Remaster will be auctioned through Christie's on May 12, 2025The watch spotlights an Australian fire opal dial with jumping hours, decorated with Meta-guillochéAll proceeds will benefit the Action Innocence foundati…",
            "source": "HYPEBEAST",
            "url": "https://hypebeast.com/2025/5/gerald-charles-maestro-gc39-remaster-piece-unique-action-innocence-christies-auction",
            "publishedAt": "2025-05-12T03:21:13Z"
        }
    ]
}