{
    "2025-05-09": [
        {
            "title": "Netflix is removing Black Mirror: Bandersnatch",
            "description": "Netflix is removing the last two shows listed on its Interactive Specials page: Black Mirror: Bandersnatch and Unbreakable Kimmy Schmidt: Kimmy vs. the Reverend, reports What’s on Netflix. The two specials will be pulled on May 12th, 2025, according to the pu…",
            "source": "The Verge",
            "url": "https://www.theverge.com/news/663933/netflix-black-mirror-bandersnatch-kimmy-schmidt-removal",
            "publishedAt": "2025-05-09T00:14:51Z"
        },
        {
            "title": "Netflix is reportedly removing Black Mirror: Bandersnatch next week",
            "description": "Just a few weeks after releasing “Plaything,” a sequel to Black Mirror: Bandersnatch, Netflix will remove the award-winning interactive special from the platform. Bandersnatch and Unbreakable Kimmy Schmidt: Kimmy vs. the Reverend will both be delisted from th…",
            "source": "Polygon",
            "url": "https://www.polygon.com/news/598247/netflix-removing-black-mirror-bandersnatch",
            "publishedAt": "2025-05-09T12:50:00Z"
        },
        {
            "title": "The Surprising True Story Behind Netflix’s Nonnas",
            "description": "Susan Sarandon, Talia Shire, and Lorraine Bracco run the kitchen in 'Nonnas,' a Netflix film inspired by a real restaurant",
            "source": "Time",
            "url": "https://time.com/7283639/nonnas-true-story-netflix/",
            "publishedAt": "2025-05-09T12:00:00Z"
        }
    ],
    "2025-05-14": [
        {
            "title": "Netflix is bringing back Star Search as a live show",
            "description": "Netflix is adding an important category to its live offerings: talent competition. The streamer announced that it will be reviving Star Search, the classic American Idol and America’s Got Talent precursor that has been off the air since 1995. The modern itera…",
            "source": "The Verge",
            "url": "https://www.theverge.com/news/666960/netflix-star-search-live-show",
            "publishedAt": "2025-05-14T19:24:55Z"
        },
        {
            "title": "Star Trek: Prodigy May Need a New Home Again Soon",
            "description": "The stalwart Trek animated series, already saved once by Netflix, may need saving once more.",
            "source": "Gizmodo.com",
            "url": "https://gizmodo.com/star-trek-prodigy-netflix-licensing-renewal-season-3-2000602463",
            "publishedAt": "2025-05-14T21:45:55Z"
        },
        {
            "title": "Netflix’s ad tier is growing really fast — and that means more ads",
            "description": "Netflix has more than doubled the number of people watching its ad-supported tier over the last year. At its upfront presentation for advertisers on Wednesday, the company revealed that the $7.99 per month plan now reaches more than 94 million users around th…",
            "source": "The Verge",
            "url": "https://www.theverge.com/news/667042/netflix-ad-supported-tier-94-million-users-upfront-2025",
            "publishedAt": "2025-05-14T18:46:55Z"
        },
        {
            "title": "The Chilling Story Behind Fred & Rose West: A British Horror Story",
            "description": "The Netflix documentary reveals recently discovered recordings that make an already grisly story even more lurid",
            "source": "Time",
            "url": "https://time.com/7285264/fred-and-rose-west-true-story-netflix/",
            "publishedAt": "2025-05-14T16:08:01Z"
        },
        {
            "title": "Ooh yeah, Netflix enters the ring with live WWE and NFL shows",
            "description": "From wrestling to football to awards shows, Netflix is body slamming the live TV game",
            "source": "Android Police",
            "url": "https://www.androidpolice.com/netflix-live-wwe-nfl/",
            "publishedAt": "2025-05-14T22:18:59Z"
        },
        {
            "title": "If you hate ads on Netflix, I have bad news: they’re doing really well",
            "description": "When Netflix introduced its ad-supported tier in late 2022, it wasn’t exactly a surprise. Other mainstream streaming services had been widely adopting the strategy, much to viewers’ protests.\n\n\n\nNow, Netflix has shared some data that indicates that while many…",
            "source": "9to5Mac",
            "url": "https://9to5mac.com/2025/05/14/netflix-ad-supported-tier-success/",
            "publishedAt": "2025-05-14T21:04:37Z"
        },
        {
            "title": "I Just Can't Stop Thinking About This Bizarre Netflix Docuseries",
            "description": "Commentary: It gives The Tiger King a run for the money",
            "source": "CNET",
            "url": "https://www.cnet.com/tech/services-and-software/i-just-cant-stop-thinking-about-this-bizarre-netflix-docuseries/",
            "publishedAt": "2025-05-14T18:39:47Z"
        },
        {
            "title": "Stranger things: How Netflix teaches economics",
            "description": "A new study co-authored by UBC Okanagan's Dr. Julien Picault shows how scenes from hit shows like \"Narcos\" and \"Stranger Things\" can help students grasp complex economic concepts—from cartels and market control to creative destruction and inflation.",
            "source": "Phys.Org",
            "url": "https://phys.org/news/2025-05-stranger-netflix-economics.html",
            "publishedAt": "2025-05-14T18:27:03Z"
        },
        {
            "title": "A Feisty New Romance Series Is Taking Over Netflix's Tops Charts",
            "description": "Netflix subscribers across the globe can't get enough of a new, steamy romance series about an entitled prince and a tech startup entrepreneur.",
            "source": "/FILM",
            "url": "https://www.slashfilm.com/1858337/feisty-romance-series-netflix-top-charts-the-royals/",
            "publishedAt": "2025-05-14T15:00:00Z"
        },
        {
            "title": "Denzel Washington, Robert Pattinson, Daisy Edgar-Jones to Star in Fernando Meirelles Heist Thriller for Netflix",
            "description": "Denzel Washington, Robert Pattinson, and Daisy Edgar-Jones will star in a heist thriller for Netflix and director Fernando Meirelles.",
            "source": "IndieWire",
            "url": "https://www.indiewire.com/news/breaking-news/denzel-washington-robert-pattinson-daisy-edgar-jones-film-1235123242/",
            "publishedAt": "2025-05-14T19:29:21Z"
        },
        {
            "title": "‘Sakamoto Days’ Part 2 Trailer Teases Three-Way Assassin War",
            "description": "SummarySakamoto Days Part 2 anime will feature a three-way conflict between Taro Sakamoto, ORDER and XThe new part will feature a new opening theme song, \"Method,\" by KroiSet to release on Netflix on July 14, 2025Netflix has released the official trailer for …",
            "source": "HYPEBEAST",
            "url": "https://hypebeast.com/2025/5/sakamoto-days-part-2-anime-official-trailer-release-info",
            "publishedAt": "2025-05-14T07:05:12Z"
        },
        {
            "title": "‘Bridgerton’ Renewed for Seasons 5 and 6, but Fans Have to Wait Until 2026 for Season 4",
            "description": "'Bridgerton' has been renewed for Seasons 5 and 6, and Season 4 of the show will premiere on Netflix in 2026.",
            "source": "IndieWire",
            "url": "https://www.indiewire.com/news/breaking-news/bridgerton-renewed-seasons-5-6-2026-season-4-1235123255/",
            "publishedAt": "2025-05-14T19:03:17Z"
        },
        {
            "title": "Deion Sanders Stars In Another Docuseries, This Time For Netflix",
            "description": "Deion Sanders certainly like the attention. The former NFL star has signed up to feature in another documentary series – this time for Netflix. Sanders will be the subject of Prime Time. It comes after Netflix rival Amazon aired three seasons of Coach Prime, …",
            "source": "Deadline",
            "url": "http://deadline.com/2025/05/deion-sanders-docuseries-netflix-1236397693/",
            "publishedAt": "2025-05-14T19:22:44Z"
        }
    ],
    "2025-05-15": [
        {
            "title": "Netflix will use AI to make ad breaks look less like ad breaks",
            "description": "Netflix is working on a new type of ad that will use AI to let advertisers “marry” their product with the streaming service’s shows and movies. This may sound like Warner Bros. Discovery’s plan to turn its IP into commercials, but during Netflix’s Upfront eve…",
            "source": "The Verge",
            "url": "https://www.theverge.com/news/667775/netflix-ai-ad-breaks-upfront-2025",
            "publishedAt": "2025-05-15T15:51:14Z"
        },
        {
            "title": "You can snag a year of Peacock Premium for just $24.99 right now",
            "description": "May and June are rarely considered the best time of year to land a streaming deal, though that doesn’t mean there aren’t ways to save if you can forgo big-name services like Netflix and Hulu. Now through May 30th, for instance, both new and returning subscrib…",
            "source": "The Verge",
            "url": "https://www.theverge.com/tech/667255/peacock-premium-streaming-deal-insta360-x5-action-cam-sale",
            "publishedAt": "2025-05-15T17:27:24Z"
        },
        {
            "title": "Netflix Will Show Generative AI Ads Midway Through Streams In 2026",
            "description": "At its second annual Upfront 2025 event yesterday, Netflix announced that it has created interactive mid-roll ads and pause ads that incorporate generative AI. These new ad formats are expected to roll out in 2026. Ars Technica reports: \"[Netflix] members pay…",
            "source": "Slashdot.org",
            "url": "https://slashdot.org/story/25/05/15/2039216/netflix-will-show-generative-ai-ads-midway-through-streams-in-2026",
            "publishedAt": "2025-05-15T22:40:00Z"
        },
        {
            "title": "Netflix Says Its Ad Tier Now Has 94 Million Monthly Active Users",
            "description": "Netflix said its cheaper, ad-supporter tier now has 94 million monthly active users -- an increase of more than 20 million since its last public tally in November. CNBC reports: The company and its peers have been increasingly leaning on advertising to boost …",
            "source": "Slashdot.org",
            "url": "https://entertainment.slashdot.org/story/25/05/14/2125248/netflix-says-its-ad-tier-now-has-94-million-monthly-active-users",
            "publishedAt": "2025-05-15T00:02:00Z"
        },
        {
            "title": "Netflix co-CEO Ted Sarandos tells BI what he thinks of the HBO Max rebrand",
            "description": "Netflix's co-CEO weighed in on Warner Bros. Discovery's decision to revert to HBO Max branding. The streamer used to be called Max.",
            "source": "Business Insider",
            "url": "https://www.businessinsider.com/netflix-ceo-ted-sarandos-said-hbo-max-return-makes-sense-2025-5",
            "publishedAt": "2025-05-15T13:16:26Z"
        },
        {
            "title": "'Nonnas' Have Entered the Group Chat -- and Netflix's Top 10",
            "description": "Commentary: Netflix's 'Nonnas' is a certified hit, especially among real nonnas.",
            "source": "CNET",
            "url": "https://www.cnet.com/tech/services-and-software/nonnas-have-entered-the-group-chat-and-netflixs-top-10/",
            "publishedAt": "2025-05-15T12:00:07Z"
        },
        {
            "title": "The best episodes of Love, Death & Robots Volume 4 ranked",
            "description": "In 2019, Deadpool and Terminator: Dark Fate director Tim Miller launched Love, Death & Robots, an animated Netflix anthology series serving as a showcase for Miller’s own Blur Studio, along with other animators. The series has won a Primetime Emmy for each of…",
            "source": "Polygon",
            "url": "https://www.polygon.com/review/599303/best-love-death-robots-season-4-episodes-ranked-watch-order",
            "publishedAt": "2025-05-15T18:02:54Z"
        },
        {
            "title": "Netflix's ad-enabled strategy has drawn quite a crowd",
            "description": "Do you want cable again? This is how you get cable again",
            "source": "Android Police",
            "url": "https://www.androidpolice.com/netflix-ad-enabled-strategy-drawn-crowd/",
            "publishedAt": "2025-05-15T14:06:21Z"
        },
        {
            "title": "Xbox and Netflix's Gears of War movie has a director",
            "description": "The Gears of War movie from Netflix and Xbox has a director, with David Leitch (Atomic Blonde, Bullet Train, The Fall Guy) helming the project.",
            "source": "Windows Central",
            "url": "https://www.windowscentral.com/gaming/xbox/gears-of-war-movie-director-david-leitch",
            "publishedAt": "2025-05-15T20:32:16Z"
        },
        {
            "title": "'Why not a dolphin Jesus?' — 'Love, Death + Robots' creators talk us through this season's sci-fi episodes (exclusive)",
            "description": "Tim Miller and Jennifer Yuh Nelson discuss four out-of-this-world animated gems in \"Love, Death + Robots\" Volume 4, which hits Netflix today.",
            "source": "Space.com",
            "url": "https://www.space.com/entertainment/why-not-a-dolphin-jesus-love-death-robots-creators-talk-us-through-this-seasons-sci-fi-episodes-exclusive",
            "publishedAt": "2025-05-15T19:00:00Z"
        },
        {
            "title": "Netflix's 'Trainwreck: The Astroworld Tragedy' Takes a Deep Dive Into The Fatal Crowd Crush",
            "description": "SummaryNetflix released the trailer for Trainwreck: The Astroworld TragedyThe documentary examines the fatal 2021 Travis Scott festival crowd crush via interviewsIt premieres June 10, detailing contributing factors and the aftermathNetflix has debuted the off…",
            "source": "HYPEBEAST",
            "url": "https://hypebeast.com/2025/5/netflix-the-astroworld-tragedy-documentary-trailer-stream",
            "publishedAt": "2025-05-15T03:42:26Z"
        },
        {
            "title": "Reality TV Has Nothing On The Drama Between These Two Storks: “Ukrainian Kardashians”",
            "description": "This stork drama has more plot than half of Netflix.",
            "source": "Boredpanda.com",
            "url": "https://www.boredpanda.com/ukrainian-stork-couple-live-streaming/",
            "publishedAt": "2025-05-15T07:59:49Z"
        },
        {
            "title": "Netflix's Gears Of War Movie Eyes John Wick Co-Director",
            "description": "Nearly three years ago, Netflix revealed plans to make a Gears of War movie based on the popular video game franchise. Now, the streamer is reportedly circling John Wick co-director David Leitch to bring Marcus Fenix and Delta Squad to live-action.According t…",
            "source": "GameSpot",
            "url": "https://www.gamespot.com/articles/netflixs-gears-of-war-movie-eyes-john-wick-co-director/1100-6531584/",
            "publishedAt": "2025-05-15T23:04:00Z"
        }
    ],
    "2025-05-13": [
        {
            "title": "Cocomelon makes the jump from YouTube to theaters with new movie",
            "description": "The Cocomelon empire is expanding once again. A few years after the massively popular kids YouTube channel turned into a Netflix series, now it’s also becoming a feature film. Cocomelon parent company Moonbug Entertainment announced that a theatrical movie ha…",
            "source": "The Verge",
            "url": "https://www.theverge.com/news/665945/cocomelon-theatrical-movie-2027",
            "publishedAt": "2025-05-13T16:34:05Z"
        },
        {
            "title": "How Disney, Netflix, and others are shifting their battle tactics in the next phase of the streaming wars",
            "description": "The streaming wars have evolved. Here's how Hollywood giants are shifting their goals, based on BI's conversations with analysts and employees.",
            "source": "Business Insider",
            "url": "https://www.businessinsider.com/disney-netflix-amazon-wbd-max-paramount-peacock-strategy-shift-2025-5",
            "publishedAt": "2025-05-13T14:37:47Z"
        },
        {
            "title": "Krysten Ritter Will Return as Jessica Jones in Daredevil: Born Again Season 2",
            "description": "Season 2 of Marvel's Daredevil revival will see the former Netflix Defender return.",
            "source": "Gizmodo.com",
            "url": "https://gizmodo.com/krysten-ritter-will-return-as-jessica-jones-in-daredevil-born-again-season-2-2000601922",
            "publishedAt": "2025-05-13T21:29:28Z"
        },
        {
            "title": "Krysten Ritter Returning to Jessica Jones Role in 'Daredevil: Born Again' Season 2",
            "description": "The beloved character, who starred in three seasons of her titular show on Netflix in the 2010s, will return to the new Daredevil Disney Plus series.",
            "source": "CNET",
            "url": "https://www.cnet.com/tech/services-and-software/krysten-ritter-returning-as-jessica-jones-role-in-daredevil-born-again-season-2/",
            "publishedAt": "2025-05-13T21:38:00Z"
        },
        {
            "title": "5 Things We Learned From Netflix’s ‘Untold: The Liver King’ Documentary",
            "description": "The new Netflix film takes a hard look at digital empire of bodybuilding and admitted steroid user Liver King",
            "source": "Rolling Stone",
            "url": "http://www.rollingstone.com/culture/culture-features/liver-king-netflix-documentary-steroids-ancestral-lifestyle-1235338458/",
            "publishedAt": "2025-05-13T20:46:03Z"
        },
        {
            "title": "A Chilling True-Crime Doc With Twists And Turns Is Leaving Netflix Users Furious",
            "description": "Netflix subscribers just can't get enough of true crime documentaries and have now propelled this particularly twisty one to the top of the streamer's charts.",
            "source": "/FILM",
            "url": "https://www.slashfilm.com/1858988/a-deadly-american-marriage-true-crime-doc-twists-netflix-top-charts/",
            "publishedAt": "2025-05-13T17:20:00Z"
        }
    ],
    "2025-05-16": [
        {
            "title": "Sundar Pichai said Google thought 'intensely' about scooping up Netflix — but stopped short of calling the decision a regret",
            "description": "When asked his biggest regret, Google CEO Sundar Pichai reflected on the company's decision not to acquire Netflix.",
            "source": "Business Insider",
            "url": "https://www.businessinsider.com/google-ceo-sundar-pichai-not-acquiring-netflix-asked-about-regret-2025-5",
            "publishedAt": "2025-05-16T19:26:02Z"
        },
        {
            "title": "They’re still trying to make a Gears of War movie and now David Leitch is involved",
            "description": "Netflix is looking to David Leitch to direct its Gears of War film, with the two parties currently in negotiations, according to The Hollywood Reporter. Outside of helming the film, the Deadpool 2 director and his wife, Kelly McCormick, are attached to the fi…",
            "source": "Polygon",
            "url": "https://www.polygon.com/movies/599507/gears-of-war-movie-director-david-leitch",
            "publishedAt": "2025-05-16T13:59:48Z"
        },
        {
            "title": "Bingeing, Weekly, or Batches? Is There a Right Way to Roll Out a Series on Streaming?",
            "description": "Netflix, HBO Max, and Paramount+ all take different approaches to get to the same goal: spend as much time on the platform as possible.",
            "source": "IndieWire",
            "url": "https://www.indiewire.com/news/business/streaming-bingeing-weekly-batches-analysis-1235123293/",
            "publishedAt": "2025-05-16T14:00:00Z"
        }
    ],
    "2025-05-08": [
        {
            "title": "Apple Wanted Tim Cook to Appear as Himself in Comedy Show 'The Studio'",
            "description": "Apple wanted CEO Tim Cook to make a surprise cameo appearance on Apple TV+'s original comedy show \"The Studio\"—a request that was declined by the show's creator, Seth Rogen, in favor of an appearance from Netflix co-CEO Ted Sarandos, Business Insider reports.…",
            "source": "MacRumors",
            "url": "https://www.macrumors.com/2025/05/08/apple-wanted-tim-cook-to-appear-on-the-studio/",
            "publishedAt": "2025-05-08T12:38:29Z"
        },
        {
            "title": "What to Stream on TV This Weekend: 'Nonnas,' 'Poker Face' and More",
            "description": "Don't miss the latest on Netflix, Peacock and other streaming services. Here's what's new this weekend.",
            "source": "CNET",
            "url": "https://www.cnet.com/tech/services-and-software/what-to-stream-on-tv-this-week-nonnas-poker-face-and-more/",
            "publishedAt": "2025-05-08T13:10:03Z"
        },
        {
            "title": "Watch Destroyer and Jessica Pratt Perform on Everybody’s Live With John Mulaney",
            "description": "For the Netflix show, Dan Bejar sang his recent track “Travel Light,” while Pratt played Here in the Pitch’s “World on a String”",
            "source": "Pitchfork",
            "url": "https://pitchfork.com/news/watch-destroyer-and-jessica-pratt-perform-on-everybodys-live-with-john-mulaney/",
            "publishedAt": "2025-05-08T20:22:36Z"
        },
        {
            "title": "Why Netflix’s ‘Adolescence’ Had a ‘No Dicks’ Policy",
            "description": "The co-creator and star of the Netflix series tells IndieWire how filmmaking is like football.",
            "source": "IndieWire",
            "url": "https://www.indiewire.com/features/interviews/adolescence-interview-stephen-graham-making-of-netflix-1235118723/",
            "publishedAt": "2025-05-08T21:00:00Z"
        },
        {
            "title": "The Old Guard 2 Trailer: Netflix's Sequel Pays Off The Original's Most Horrifying Moment",
            "description": "Netflix has finally unveiled a trailer for The Old Guard 2, the long-awaited sequel to the streamer's hit 2020 comic book movie starring Charlize Theron.",
            "source": "/FILM",
            "url": "https://www.slashfilm.com/1854684/old-guard-2-netflix-trailer/",
            "publishedAt": "2025-05-08T15:10:39Z"
        },
        {
            "title": "The 2025 Action-Packed Sniper Movie That's Killing It On Netflix",
            "description": "With 11 films in the franchise, the latest addition to the Sniper film series is currently crushing it on the Netflix charts.",
            "source": "/FILM",
            "url": "https://www.slashfilm.com/1854260/sniper-movie-netflix-charts-sniper-the-last-stand/",
            "publishedAt": "2025-05-08T21:00:00Z"
        },
        {
            "title": "Netflix Releases Official Trailer for Shaquille O'Neal's Reebok Comeback Docuseries 'Power Moves'",
            "description": "SummaryNetflix released the official trailer for the new docuseries Power Moves with Shaquille O'NealThe trailer reveals a behind-the-scenes look at Shaq's role as President of Reebok BasketballFeaturing appearances by Allen Iverson and Angel Reese, the docus…",
            "source": "HYPEBEAST",
            "url": "https://hypebeast.com/2025/5/netflix-shaquille-oneal-reebok-comeback-docuseries-power-moves-official-trailer-release-info",
            "publishedAt": "2025-05-08T07:00:46Z"
        },
        {
            "title": "New Old Guard 2 Trailer Sees Charlize Theron Cross Swords With Uma Thurman",
            "description": "It'll be a fight for the ages in the long-awaited sequel to Netflix's hit action-fantasy film.",
            "source": "Gizmodo.com",
            "url": "https://gizmodo.com/new-old-guard-2-trailer-sees-charlize-theron-cross-swords-with-uma-thurman-2000599687",
            "publishedAt": "2025-05-08T16:45:12Z"
        },
        {
            "title": "Netflix's 'Exterritorial' Movie Proves 'Barbarians' Actress Jeanne Goursaud Is the Next Great Action Star",
            "description": "Commentary: If you've missed Barbarians star Jeanne Goursaud, she's kicking butt in Netflix's latest No. 1 film.",
            "source": "CNET",
            "url": "https://www.cnet.com/tech/services-and-software/netflixs-exterritorial-movie-proves-barbarians-actress-jeanne-goursaud-is-the-next-great-action-star/",
            "publishedAt": "2025-05-08T12:00:12Z"
        },
        {
            "title": "Netflix is now testing an AI chatbot to help you find stuff to watch",
            "description": "Netflix today announced it's introducing an AI chatbot into its iOS app as \"a small opt-in beta\". It will let you search for shows and movies \"using natural, conversational phrases\", the company says in its official press release, giving the example of someon…",
            "source": "GSMArena.com",
            "url": "https://www.gsmarena.com/netflix_is_now_testing_an_ai_chatbot_to_help_you_find_what_to_watch-news-67684.php",
            "publishedAt": "2025-05-08T05:13:01Z"
        },
        {
            "title": "Measuring Dialogue Intelligibility for Netflix Content",
            "description": "At Netflix, delivering the best possible experience for our members is at the heart of everything we do, and we know we can’t do it alone. That’s why we work closely with a diverse ecosystem of…",
            "source": "Netflixtechblog.com",
            "url": "https://netflixtechblog.com/measuring-dialogue-intelligibility-for-netflix-content-58c13d2a6f6e",
            "publishedAt": "2025-05-08T00:40:17Z"
        }
    ],
    "2025-05-12": [
        {
            "title": "15 Most Underrated TV Shows On Netflix",
            "description": "Netflix has hosted plenty of breakout hit TV shows, both original and licensed, but these are the most underrated TV shows on Netflix.",
            "source": "/FILM",
            "url": "https://www.slashfilm.com/1852442/netflix-underrated-tv-shows/",
            "publishedAt": "2025-05-12T19:15:00Z"
        },
        {
            "title": "The 2025 Vince Vaughn Comedy Dominating Netflix's Top Charts",
            "description": "Netflix subscribers fittingly celebrated Mother's Day 2025 by sending this true story-inspired Vince Vaughn comedy to the stop of the streamer's charts.",
            "source": "/FILM",
            "url": "https://www.slashfilm.com/1857561/vince-vaughn-comedy-netflix-top-charts-nonnas/",
            "publishedAt": "2025-05-12T15:30:00Z"
        },
        {
            "title": "‘Too Much’ First Look: Megan Stalter Woos Bad Boy Will Sharpe in Lena Dunham’s Netflix Series",
            "description": "Megan Stalter and Will Sharpe star in Lena Dunham's Netflix series 'Too Much.' Check out the first look here.",
            "source": "IndieWire",
            "url": "https://www.indiewire.com/news/breaking-news/too-much-first-look-megan-stalter-lena-dunham-netflix-1235090173/",
            "publishedAt": "2025-05-12T17:00:00Z"
        }
    ],
    "2025-05-10": [
        {
            "title": "2025's Most Romantic Horror Movie Is Killing It On Netflix's Top Charts",
            "description": "This 2025 horror rom-com is worth checking out now that it's making waves streaming on Netflix (as is its director's work elsewhere).",
            "source": "/FILM",
            "url": "https://www.slashfilm.com/1855831/romantic-horror-movie-streaming-netflix-heart-eyes/",
            "publishedAt": "2025-05-10T11:00:00Z"
        },
        {
            "title": "Mara Brock Akil Says Being Her Own ‘First Audience’ Led to Her Reinvention of Judy Blume’s ‘Forever’",
            "description": "Speaking to IndieWire's Future of Filmmaking, Akil explained how her new Netflix series serves as a \"full circle\" moment in her personal and professional life.",
            "source": "IndieWire",
            "url": "https://www.indiewire.com/features/interviews/mara-brock-akil-reinventing-judy-blume-forever-1235122210/",
            "publishedAt": "2025-05-10T20:00:00Z"
        }
    ],
    "2025-05-11": [
        {
            "title": "How To Watch The Best K-Dramas For Free",
            "description": "Platforms like Netflix now have a great selection of K-dramas to watch, but there's another service that allows users to stream Korean shows for free.",
            "source": "/FILM",
            "url": "https://www.slashfilm.com/1847865/watch-best-k-dramas-free-rakuten-viki/",
            "publishedAt": "2025-05-11T14:45:00Z"
        }
    ]
}