{
    "2025-05-12": [
        {
            "title": "The Switch 2 has a handy battery preservation mode",
            "description": "Nintendo will give Switch 2 owners the option to sacrifice a little per-session playtime in the interest of battery health longevity. The company announced, via its Nintendo Today news app, that the console will have a setting to slow the console’s charge as …",
            "source": "The Verge",
            "url": "https://www.theverge.com/news/664999/nintendo-switch-2-battery-health-charging-90-percent-limit",
            "publishedAt": "2025-05-12T16:27:44Z"
        },
        {
            "title": "Switch 2 has a new charging setting to preserve your battery’s life",
            "description": "Nintendo will let Switch 2 owners opt into a setting that stops their system’s battery from charging once it reaches “around 90%” as part of an effort to preserve the system’s battery life. Nintendo revealed the new feature in its Nintendo Today app Monday. “…",
            "source": "Polygon",
            "url": "https://www.polygon.com/nintendo-switch-2/598661/switch-2-battery-charging-settings-nintendo-today",
            "publishedAt": "2025-05-12T18:52:29Z"
        },
        {
            "title": "Switch 2 Mouse Controls In Action Have Us Praying For Sensitivity Settings",
            "description": "Joy-Con mouse controls are one of the biggest innovations in a next-gen console that otherwise looks to be just a bigger, more powerful version of its predecessor. On Monday Nintendo showed off how Switch 2 owners will be able to navigate the home screen with…",
            "source": "Kotaku",
            "url": "https://kotaku.com/nintendo-switch-2-joycon-mouse-dpi-settings-1851780199",
            "publishedAt": "2025-05-12T14:20:00Z"
        },
        {
            "title": "Nintendo Insists AI-Generated Images Were Not Used in the Development of Mario Kart World After In-Game Billboards Sparked Speculation",
            "description": "Nintendo has disputed accusations it used AI-generated images to create billboards in Mario Kart World.",
            "source": "IGN",
            "url": "https://www.ign.com/articles/nintendo-insists-ai-generated-images-were-not-used-in-the-development-of-mario-kart-world-after-in-game-billboards-sparked-speculation",
            "publishedAt": "2025-05-12T09:37:03Z"
        },
        {
            "title": "Leak May Explain Why So Many ‘Physical’ Switch 2 Games Are Actually Digital Downloads",
            "description": "Sounds like Nintendo isn't giving third-party game makers much choice.",
            "source": "Gizmodo.com",
            "url": "https://gizmodo.com/leak-may-explain-why-so-many-physical-switch-2-games-are-actually-digital-downloads-2000600879",
            "publishedAt": "2025-05-12T15:53:31Z"
        },
        {
            "title": "Original XCOM Creator Thinks Switch 2 Mouse Controls Have Big Strategy-Game Potential",
            "description": "PC is typically considered the go-to platform for strategy games, but in the case of the Switch 2, XCOM creator Julian Gollop sees great possibility for the genre to expand on the new Nintendo console, thanks to Joy-Con 2s offering mouse-like controls. While …",
            "source": "GameSpot",
            "url": "https://www.gamespot.com/articles/original-xcom-creator-thinks-switch-2-mouse-controls-have-big-strategy-game-potential/1100-6531445/",
            "publishedAt": "2025-05-12T12:19:00Z"
        },
        {
            "title": "Switch Rail Shooter Mad Bullets Getting A New Bundle With Two Joy-Con Revolvers",
            "description": "The arcade shooter Mad Bullets is getting a new physical release on Nintendo Switch that bundles the game with two Joy-Con Revolvers. The peripherals will let you play the co-op shooting gallery with arcade-style light guns--arguably the best way to play a ga…",
            "source": "GameSpot",
            "url": "https://www.gamespot.com/articles/switch-rail-shooter-mad-bullets-getting-a-new-bundle-with-two-joy-con-revolvers/1100-6531428/",
            "publishedAt": "2025-05-12T23:16:00Z"
        },
        {
            "title": "Gundam Breaker 4: Launch Edition (Nintendo Switch) $28",
            "description": "Amazon [amazon.com] has *Gundam Breaker 4 Launch Edition (Nintendo Switch)* for *$27.99*. Shipping is free w/ Prime or on $35+.",
            "source": "Slickdeals.net",
            "url": "https://slickdeals.net/f/18308986-gundam-breaker-4-launch-edition-w-11x17-poster-builder-s-parts-rx-78-gundam-recirculation-color-early-unlock-nintendo-switch-27-99-free-shipping-w-prime-or-on-35?utm_source=rss&utm_content=fp&utm_medium=RSS2",
            "publishedAt": "2025-05-12T18:06:47Z"
        },
        {
            "title": "Nintendo Switch 2 adds a feature that I want on basically every device I own: battery charging settings that limit your juice and reduce \"deterioration\"",
            "description": null,
            "source": "Yahoo Entertainment",
            "url": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_a1babc0d-7125-45c3-8ec6-383a9d9a596a",
            "publishedAt": "2025-05-12T20:58:29Z"
        }
    ],
    "2025-05-16": [
        {
            "title": "Nintendo details Switch 2 updates for Switch games",
            "description": "Nintendo announced last month that it would be updating a handful of Switch games to run better on the Switch 2, and now some details about the planned improvements are available on its website. The improvements vary per game, but they include things like opt…",
            "source": "The Verge",
            "url": "https://www.theverge.com/news/668830/nintendo-switch-2-game-updates",
            "publishedAt": "2025-05-16T19:53:24Z"
        },
        {
            "title": "Nintendo Switch Online - KILLER INSTINCT GOLD | Nintendo 64 Games Update Trailer",
            "description": "Hone your skills to achieve supreme victory!",
            "source": "GameSpot",
            "url": "https://www.gamespot.com/videos/nintendo-switch-online-killer-instinct-gold-nintendo-64-games-update-trailer/2300-6465987/",
            "publishedAt": "2025-05-16T14:50:00Z"
        },
        {
            "title": "Switch 2 Supply Should Be Ready For Demand In US, Says Nintendo Of America Boss",
            "description": "Nintendo of America sounds confident that Switch 2 supply should be in pretty good shape this year domestically. Sure, preorders sold out almost instantly for the June 5 launch, but company president Doug Bowser believes they have a good production plan for 2…",
            "source": "GameSpot",
            "url": "https://www.gamespot.com/articles/switch-2-supply-should-be-ready-for-demand-in-us-says-nintendo-of-america-boss/1100-6531600/",
            "publishedAt": "2025-05-16T13:17:00Z"
        },
        {
            "title": "Free Switch 2 Updates Specified For Original Switch Games Like Pokemon Scarlet/Violet",
            "description": "Free Switch 2 Game Update Changes\r\nNintendo has detailed what improvements players should expect with free Switch 2 updates for original Switch games, such as Pokemon Scarlet/Violet, The Legend of Zelda: Echoes of Wisdom, and Super Mario Odyssey. The benefits…",
            "source": "GameSpot",
            "url": "https://www.gamespot.com/gallery/all-free-nintendo-switch-2-game-updates-changes/2900-6591/",
            "publishedAt": "2025-05-16T16:03:00Z"
        },
        {
            "title": "Nintendo admits Switch 2 won't support VRR on TV after all",
            "description": "Switch 2 won't support Variable Refresh Rate (VRR) on TVs after all, despite Nintendo previously suggesting it would.\n Read more",
            "source": "Eurogamer.net",
            "url": "https://www.eurogamer.net/nintendo-admits-switch-2-wont-support-vrr-on-tv-after-all",
            "publishedAt": "2025-05-16T15:33:57Z"
        },
        {
            "title": "Mario Kart Mini RC Karts With Cool Display Cases Are Only $14.49 Right Now",
            "description": "If you’re one of the millions of Nintendo fans excited about the impending release of Mario Kart World, consider snagging one of these fun and display-worthy Mario Kart Mini RC Racers to help ease the wait. Officially licensed by Nintendo and manufactured by …",
            "source": "GameSpot",
            "url": "https://www.gamespot.com/articles/mario-kart-mini-rc-karts-with-cool-display-cases-are-only-14-49-right-now/1100-6531603/",
            "publishedAt": "2025-05-16T16:25:00Z"
        },
        {
            "title": "512GB Lexar PLAY UHS-I U3 V30 A2 microSD Memory Card $27",
            "description": "High speed microSD card from Lexar available on Amazon. Camel shows this is the lowest price ever and is comparable to the recent PNY deal I missed.\n\nhttps://www.amazon.com/Lexar-Compatible-Nintendo-S",
            "source": "Slickdeals.net",
            "url": "https://slickdeals.net/f/18317077-lexar-512gb-play-micro-sd-card-up-to-160-100-mb-s-microsdxc-memory-card-26-98?utm_source=rss&utm_content=fp&utm_medium=RSS2",
            "publishedAt": "2025-05-16T18:19:03Z"
        },
        {
            "title": "Nintendo Switch Online's latest N64 addition is a Rare treat",
            "description": "The slow swell of Nintendo Switch Online's N64 library continues with a brand-new addition for Expansion Pack subscribers: developer Rare's much-loved 1996 fighter Killer Instinct Gold is available now in the west, with Japan getting something else entirely.\n…",
            "source": "Eurogamer.net",
            "url": "https://www.eurogamer.net/nintendo-switch-onlines-latest-n64-addition-is-a-rare-treat",
            "publishedAt": "2025-05-16T13:04:41Z"
        }
    ],
    "2025-05-09": [
        {
            "title": "Deltarune’s next chapters will launch alongside the Switch 2",
            "description": "The paid release of Deltarune, Toby Fox’s episodic Undertale spinoff, will be available for most people at the same time the Nintendo Switch 2 launches in Japan, Fox says in the Deltarune newsletter for May 2025. Deltarune’s first two chapters, released in 20…",
            "source": "The Verge",
            "url": "https://www.theverge.com/news/664621/deltarune-nintendo-switch-2-launch-time",
            "publishedAt": "2025-05-09T22:41:48Z"
        },
        {
            "title": "Palworld Developer Has Removed Game Features Due to Nintendo Legal Pressure",
            "description": "Pocketpair says it's continuing to evolve its monster-collecting game, even as it strips out features that may be too similar to the Pokemon franchise it parodies.",
            "source": "CNET",
            "url": "https://www.cnet.com/tech/gaming/palworld-developer-has-removed-game-features-due-to-nintendo-legal-pressure/",
            "publishedAt": "2025-05-09T15:49:39Z"
        },
        {
            "title": "The Solution To Nintendo’s Ineffective Battle Against Piracy Isn't Bricking People's Switches",
            "description": "Nintendo’s crackdown on all things tangentially related to potential piracy continues, but this time the company is turning its ire on its customers, rather than those who might distribute hacks or ROMs or, um, join a Reddit. According to a change in the Nint…",
            "source": "Kotaku",
            "url": "https://kotaku.com/nintendo-switch-2-piracy-brick-threat-homebrew-1851779895",
            "publishedAt": "2025-05-09T15:55:00Z"
        },
        {
            "title": "Nintendo: We Can Brick Your Switch Console If You Pirate Games",
            "description": "The company updates its user agreement to say it can render a Nintendo console 'unusable' if any piracy or tampering is detected.",
            "source": "PCMag.com",
            "url": "https://www.pcmag.com/news/nintendo-we-can-brick-your-switch-console-if-you-pirate-games",
            "publishedAt": "2025-05-09T15:37:16Z"
        },
        {
            "title": "Nintendo Clarifies How And Why Switch 2 Could Collect, Monitor, And Record Your GameChats",
            "description": "Nintendo recently updated its privacy policy to confirm that the company may \"collect, monitor, and record\" audio and video of users' chat sessions for the Switch 2's new GameChat feature. Despite this being a common practice, it spooked some fans, and now Ni…",
            "source": "GameSpot",
            "url": "https://www.gamespot.com/articles/nintendo-clarifies-how-and-why-switch-2-could-collect-monitor-and-record-your-gamechats/1100-6531419/",
            "publishedAt": "2025-05-09T13:42:00Z"
        },
        {
            "title": "Switch 2 games like Mario Kart World and Donkey Kong Bananza \"could not be realized\" on Switch 1, says Nintendo president to hardware doubter",
            "description": null,
            "source": "Yahoo Entertainment",
            "url": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_c63fbf29-06e0-48f1-b541-d3d5276cf0a3",
            "publishedAt": "2025-05-09T13:50:03Z"
        },
        {
            "title": "Breaking This New Nintendo Clause Could Make Your Switch 2 \"Unusable\"",
            "description": "Nintendo updated its user agreement and privacy policy ahead of the Switch 2 launch next month, and while the company briefly listed a few of the changes in the email it sent out, one of the big changes might have escaped your notice. A new clause related spe…",
            "source": "GameSpot",
            "url": "https://www.gamespot.com/articles/breaking-this-new-nintendo-clause-could-make-your-switch-2-unusable/1100-6531421/",
            "publishedAt": "2025-05-09T13:47:00Z"
        },
        {
            "title": "Nintendo Issues Statement On Mario Kart World AI Image Speculation",
            "description": "Mario Kart World does not include AI-generated images, according to a new statement from Nintendo.Some fans speculated the Switch 2 launch title might include AI images based on footage shown during a recent Nintendo Treehouse livestream, where certain odd bi…",
            "source": "GameSpot",
            "url": "https://www.gamespot.com/articles/nintendo-issues-statement-on-mario-kart-world-ai-image-speculation/1100-6531436/",
            "publishedAt": "2025-05-09T17:44:00Z"
        },
        {
            "title": "Your Nintendo Switch might get bricked for good if you try this",
            "description": "Safe to say, don’t try this at home",
            "source": "XDA Developers",
            "url": "https://www.xda-developers.com/nintendo-switch-permanently-bricked/",
            "publishedAt": "2025-05-09T18:02:19Z"
        },
        {
            "title": "Nintendo warns it may brick your Switch if you engage in unauthorized use",
            "description": "Nintendo has updated its user agreement to reserve the right to render your console \"unusable\" for unauthorized use, like hacks and mods.",
            "source": "Android Authority",
            "url": "https://www.androidauthority.com/nintendo-user-agreement-update-3556245/",
            "publishedAt": "2025-05-09T20:14:14Z"
        },
        {
            "title": "Nintendo’s Tiniest Gaming Console Could Be Its Most Popular One Too",
            "description": "Nintendo’s Tiniest Gaming Console Could Be Its Most Popular One TooLet’s travel back to nearly a decade ago, in the glorious Pokémon GO days. Everyone spent every waking minute of their lives buried in their...",
            "source": "Yanko Design",
            "url": "https://www.yankodesign.com/2025/05/09/nintendos-tiniest-gaming-console-could-be-its-most-popular-one-too/",
            "publishedAt": "2025-05-09T19:15:23Z"
        },
        {
            "title": "Nintendo reserves the right to brick your console following \"unauthorised use\", in bid to prevent piracy",
            "description": "Nintendo has updated its Nintendo Account Agreement with a severe warning against \"unauthorised use\", in a bid to prevent emulation and piracy. Read more",
            "source": "Eurogamer.net",
            "url": "https://www.eurogamer.net/nintendo-reserves-the-right-to-brick-your-console-following-unauthorised-use-in-bid-to-prevent-piracy",
            "publishedAt": "2025-05-09T11:28:11Z"
        },
        {
            "title": "12-Month Nintendo Switch Online Individual Membership (Digital Delivery) $12.45",
            "description": "Hey All, \n \nI found 12 Month Nintendo Switch Individual Membership for sale on Eneba for $11.24 lowest I've seen, ususally goes to $18-16 for a 12-months membership \n \nYou can stack up to 3 years on...",
            "source": "Slickdeals.net",
            "url": "https://slickdeals.net/f/18304075-12-month-nintendo-switch-online-individual-membership-digital-delivery-11?utm_source=rss&utm_content=fp&utm_medium=RSS2",
            "publishedAt": "2025-05-09T16:23:56Z"
        },
        {
            "title": "Nintendo responds to suggestion that AI-generated images used in Mario Kart World",
            "description": "Nintendo has pushed back on the suggestion that AI-generated images have been used in Mario Kart World.\n Read more",
            "source": "Eurogamer.net",
            "url": "https://www.eurogamer.net/nintendo-responds-to-suggestion-that-ai-generated-images-used-in-mario-kart-world",
            "publishedAt": "2025-05-09T15:37:04Z"
        }
    ],
    "2025-05-13": [
        {
            "title": "Most Best Buys will have extra Switch 2 stock on launch day",
            "description": "If you don’t have a Nintendo Switch 2 preorder, Best Buy might still be able to help you get a console on launch day. For the retailer’s midnight openings for the Switch 2 launch, “most stores will have limited inventory of systems, games, and accessories for…",
            "source": "The Verge",
            "url": "https://www.theverge.com/news/665958/nintendo-switch-2-best-buy-stock-launch-day",
            "publishedAt": "2025-05-13T16:21:16Z"
        },
        {
            "title": "Nintendo says its low-balled Switch 2 forecast is about price, not tariffs",
            "description": "Last week, Nintendo predicted it would sell 15 million Switch 2 consoles in its current financial year. This would actually be a fantastic result — equalling Switch, and just about any console you care to mention — but analysts called the figure “conservative…",
            "source": "Polygon",
            "url": "https://www.polygon.com/nintendo-switch-2/598877/nintendo-switch-2-forecast-price-not-tariffs",
            "publishedAt": "2025-05-13T17:08:25Z"
        },
        {
            "title": "Switch 2: Nintendo Warns Of Substantial Negative Impact From Tariffs",
            "description": "The Switch 2 is launching in early June amid ongoing drama and uncertainty about tariffs, and now Nintendo has put a dollar amount to how much of a negative impact it's forecasting as a result.Speaking to analysts and investors as part of the company's latest…",
            "source": "GameSpot",
            "url": "https://www.gamespot.com/articles/switch-2-nintendo-warns-of-substantial-negative-impact-from-tariffs/1100-6531512/",
            "publishedAt": "2025-05-13T18:52:00Z"
        },
        {
            "title": "Hogwarts Legacy (Nintendo Switch 2 Upgrade + Switch Legacy Digital Download) $28",
            "description": "Nintendo Switch (1) edition currently on sale for $18. Once you purchase (or if you already own it), you will have the option to pre-order the Switch 2 version for $10 via the Nintendo online store...",
            "source": "Slickdeals.net",
            "url": "https://slickdeals.net/f/18311110-hogwarts-legacy-nintendo-switch-2-edition-28?utm_source=rss&utm_content=fp&utm_medium=RSS2",
            "publishedAt": "2025-05-13T07:46:55Z"
        },
        {
            "title": "Nintendo fans should consider this gaming handheld instead of the Switch 2",
            "description": "The MSI Claw 8 AI+ could be a better option for these four reasons.",
            "source": "XDA Developers",
            "url": "https://www.xda-developers.com/nintendo-fans-should-consider-this-gaming-handheld-instead-switch-2/",
            "publishedAt": "2025-05-13T01:00:20Z"
        },
        {
            "title": "Switch 2 has a battery saver mode to stop charging at 90%",
            "description": "Nintendo has revealed a new Switch 2 firmware option that caps its battery charging at around 90 percent. \n Read more",
            "source": "Eurogamer.net",
            "url": "https://www.eurogamer.net/switch-2-has-a-battery-saver-mode-to-stop-charging-at-90",
            "publishedAt": "2025-05-13T11:33:03Z"
        },
        {
            "title": "Select Stores: Costco Members: Nintendo Switch OLED Bundle $200 (In-Stores Only)",
            "description": "Some Costco B&M stores may have the original Nintendo Switch OLED bundle at a clearance price of $199.97. Item number 1758915. Also spotted on the in store stock availability tracker in the Costco...",
            "source": "Slickdeals.net",
            "url": "https://slickdeals.net/f/18312433-nintendo-switch-oled-bundle-199-97-at-costco-ymmv?utm_source=rss&utm_content=fp&utm_medium=RSS2",
            "publishedAt": "2025-05-13T18:38:23Z"
        },
        {
            "title": "The Nintendo Switch 2 Joy-Con 2 mouse controls can be used to navigate the Home Menu",
            "description": "Nintendo has confirmed that the Nintendo Switch 2's Joy-Con 2 controllers will offer Home Menu navigation.",
            "source": "TechRadar",
            "url": "https://www.techradar.com/gaming/the-nintendo-switch-2-joy-con-2-mouse-controls-can-be-used-to-navigate-the-home-menu",
            "publishedAt": "2025-05-13T10:18:57Z"
        },
        {
            "title": "Switch 2 sales forecast not affected by production or tariffs, Nintendo reiterates",
            "description": "Switch 2 production capacity and US tariffs didn't factor into sales predictions Nintendo said, as its forecasts were criticised by investors for being conservative. Read more",
            "source": "Eurogamer.net",
            "url": "https://www.eurogamer.net/switch-2-sales-forecast-not-affected-by-production-or-tariffs-nintendo-reiterates",
            "publishedAt": "2025-05-13T10:23:32Z"
        },
        {
            "title": "Nintendo president says the Switch 2's lower than expected sales forecast is due to its high price, not US tariffs",
            "description": "Nintendo president Shuntaro Furukawa has said the low sales prediction for the Nintendo Switch 2 is due to the console's high price point.",
            "source": "TechRadar",
            "url": "https://www.techradar.com/gaming/nintendo-president-says-the-switch-2s-lower-than-expected-sales-forecast-is-due-to-its-high-price-not-us-tariffs",
            "publishedAt": "2025-05-13T16:32:49Z"
        },
        {
            "title": "Palworld mod restores gliding feature pulled amid Nintendo lawsuit",
            "description": "A week after Palworld developer Pocketpair removed the ability for players to glide using Pals in response to Nintendo's ongoing lawsuit, a modder has restored the feature on PC. That's as Pocketpair confirms Palworld's Terraria collaboration will launch this…",
            "source": "Eurogamer.net",
            "url": "https://www.eurogamer.net/palworld-mod-restores-gliding-feature-pulled-amid-nintendo-lawsuit",
            "publishedAt": "2025-05-13T12:59:20Z"
        }
    ],
    "2025-05-14": [
        {
            "title": "Switch 2 spec breakdown digs into its processor and GameChat",
            "description": "Nintendo’s Switch 2 specs page is light on details. However, Digital Foundry has shared what it says are “rock solid” specifications for the upcoming console in an article and a video, offering new information about its processor and a testing tool for develo…",
            "source": "The Verge",
            "url": "https://www.theverge.com/news/667094/nintendo-switch-2-specs-digital-foundry",
            "publishedAt": "2025-05-14T17:51:34Z"
        },
        {
            "title": "No more secrets: Nintendo Switch 2 report answers the mystery behind the processor",
            "description": "The report finally answers lingering questions about the processor.",
            "source": "Android Authority",
            "url": "https://www.androidauthority.com/nintendo-switch-2-processor-specs-3557798/",
            "publishedAt": "2025-05-14T21:00:46Z"
        },
        {
            "title": "Ys Memoire: The Oath in Felghana D1 Refined Edition (Nintendo Switch) $35 + Free S&H w/ Prime",
            "description": "Woot [woot.com] has * Ys Memoire: The Oath in Felghana D1 Refined Edition (Nintendo Switch) *for *$34.99*. Shipping is free w/ Prime. Otherwise shipping is $6.",
            "source": "Slickdeals.net",
            "url": "https://slickdeals.net/f/18311881-ys-memoire-the-oath-in-felghana-d1-refined-edition-nintendo-switch-34-99-free-shipping-w-prime?utm_source=rss&utm_content=fp&utm_medium=RSS2",
            "publishedAt": "2025-05-14T02:52:21Z"
        },
        {
            "title": "Nintendo Switch 2: final tech specs and system reservations confirmed",
            "description": "Nintendo has released its own technical specifications for the Switch 2 console hybrid, but it's fair to say that the detail is somewhat selective - and that's OK. It's been a long time since the firm ducked out of the technological arms race against Sony and…",
            "source": "Eurogamer.net",
            "url": "https://www.eurogamer.net/digitalfoundry-2025-nintendo-switch-2-final-tech-specs-and-system-reservations-confirmed",
            "publishedAt": "2025-05-14T14:00:00Z"
        },
        {
            "title": "Costco Members: Donkey Kong Bananza Pre-Sale (Nintendo Switch 2) $63 + Free S/H",
            "description": "Costco has the pre-sale of Donkey Kong Bananza for the Nintendo Switch 2 (physical copy). Ships out 7/17-21. Game retails for $69.99 for $7 savings. Not bad at all. \n \n*Costco membership required to...",
            "source": "Slickdeals.net",
            "url": "https://slickdeals.net/f/18312409-costco-members-donkey-kong-bananza-pre-sale-nintendo-switch-2-63-free-s-h?utm_source=rss&utm_content=fp&utm_medium=RSS2",
            "publishedAt": "2025-05-14T10:38:23Z"
        },
        {
            "title": "Why the price of the Nintendo Switch 2 won’t matter",
            "description": "Fans aren’t just buying a console, they are buying into a feeling.",
            "source": "Creative Bloq",
            "url": "https://www.creativebloq.com/entertainment/gaming/why-the-price-of-the-nintendo-switch-2-wont-matter",
            "publishedAt": "2025-05-14T11:00:00Z"
        }
    ],
    "2025-05-08": [
        {
            "title": "Nintendo fiscal year sales drop 30% ahead of Switch 2 launch",
            "description": "Nintendo reported relatively weak sales of 1,164.9 billion yen for its fiscal year ended March 31, 2025, down 30.3% from 1,671.8 billion yen a year earlier.",
            "source": "VentureBeat",
            "url": "https://venturebeat.com/games/nintendo-fiscal-year-sales-drop-30-ahead-of-switch-2-launch/",
            "publishedAt": "2025-05-08T09:40:00Z"
        },
        {
            "title": "Palworld devs blame Nintendo lawsuit for ‘disappointing’ game changes",
            "description": "Palworld developer Pocketpair has admitted it has had to make changes to its game in response to the patent-infringement lawsuit brought against it by Nintendo and The Pokémon Company — and indicated there are more of these changes coming. In a blog post titl…",
            "source": "Polygon",
            "url": "https://www.polygon.com/gaming/598094/palworld-changes-nintendo-pokemon-lawsuit-disappointing",
            "publishedAt": "2025-05-08T11:49:31Z"
        },
        {
            "title": "You May Be Surprised Which Switch 2 Games Won’t Be Available at Launch",
            "description": "FYI: you’ll need to wait until July before you can play Donkey Kong Bananza on Nintendo Switch 2.",
            "source": "Gizmodo.com",
            "url": "https://gizmodo.com/you-may-be-surprised-which-switch-2-games-wont-be-available-at-launch-2000599609",
            "publishedAt": "2025-05-08T16:00:29Z"
        },
        {
            "title": "Palworld's newest patch stops you from gliding with your Pals, and yes, it is because of Nintendo's lawsuit",
            "description": "We all know that Palworld developer Pocketpair are currently dealing with a lawsuit from Mario maker Nintendo. Specifically, it's over patent rights, rather than something like copyright infringement which everyone was expecting given the liberties that Palwo…",
            "source": "Rock Paper Shotgun",
            "url": "https://www.rockpapershotgun.com/palworlds-newest-patch-stops-you-from-gliding-with-your-pals-and-yes-it-is-because-of-nintendos-lawsuit",
            "publishedAt": "2025-05-08T15:58:31Z"
        },
        {
            "title": "Palworld is forced to make \"yet another compromise\" in its ongoing legal battle with Nintendo — apologizing to its players",
            "description": "Pocketpair has announced that Palworld will be making another controversial change to the game due to the company's ongoing legal battle with Nintendo.",
            "source": "Windows Central",
            "url": "https://www.windowscentral.com/gaming/palworld-is-forced-to-make-yet-another-compromise-in-its-ongoing-legal-battle-with-nintendo",
            "publishedAt": "2025-05-08T10:58:07Z"
        },
        {
            "title": "Nintendo promises stronger results with Switch 2 console going on sale in June",
            "description": null,
            "source": "Yahoo Entertainment",
            "url": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_34a31a48-f9ed-4195-96ac-64a1fcb58d0b",
            "publishedAt": "2025-05-08T07:47:26Z"
        },
        {
            "title": "Palworld Update Adds Big Change To \"Avoid Disruptions\" Amid Nintendo Patent Lawsuit",
            "description": "The ongoing legal battle between Nintendo and Pocketpair--creators of indie hit Palworld--has already seen the developer make a big change to Palworld's world through the removal of the Pal Sphere. Today, Pocketpair has announced another \"compromise\" via its …",
            "source": "GameSpot",
            "url": "https://www.gamespot.com/articles/palworld-update-adds-big-change-to-avoid-disruptions-amid-nintendo-patent-lawsuit/1100-6531394/",
            "publishedAt": "2025-05-08T13:20:00Z"
        },
        {
            "title": "3-Pack Suttkue Tempered Glass Screen Protector for Nintendo Switch 2 $3.25",
            "description": "Suttkue-US via Amazon [amazon.com] has *Nintendo Switch 2 Screen Protector-HD Tempered Glass (3 Pack)* for *$3.25*. Shipping is free w/ Prime or on $35+.",
            "source": "Slickdeals.net",
            "url": "https://slickdeals.net/f/18300973-nintendo-switch-2-screen-protector-hd-tempered-glass-3-pack-3-25-free-shipping-w-prime-or-on-35?utm_source=rss&utm_content=fp&utm_medium=RSS2",
            "publishedAt": "2025-05-08T12:35:53Z"
        },
        {
            "title": "Nintendo expects Switch 1 to become its best-selling hardware ever this year, but fall just short of PS2 record",
            "description": "Nintendo expects to sell another 4.5m units of its aging original Switch this year, despite the impending launch of Switch 2. \n Read more",
            "source": "Eurogamer.net",
            "url": "https://www.eurogamer.net/nintendo-expects-switch-1-to-become-its-best-selling-hardware-ever-this-year-but-fall-just-short-of-ps2-record",
            "publishedAt": "2025-05-08T09:11:12Z"
        },
        {
            "title": "Nintendo predicts Switch 2 will outsell its predecessor at launch, despite demand exceeding expectations",
            "description": "Nintendo has forecast 15m sales of its Switch 2 console over the remainder of this financial year. Read more",
            "source": "Eurogamer.net",
            "url": "https://www.eurogamer.net/nintendo-predicts-switch-2-will-outsell-its-predecessor-at-launch-despite-demand-exceeding-expectations",
            "publishedAt": "2025-05-08T08:26:33Z"
        },
        {
            "title": "Nintendo projects Switch 2 sales to reach 15M units for the fiscal year ending March 2026, below 16.8M est., and $2.2B annual operating profit, below est. (Takashi Mochizuki/Bloomberg)",
            "description": "Takashi Mochizuki / Bloomberg:\nNintendo projects Switch 2 sales to reach 15M units for the fiscal year ending March 2026, below 16.8M est., and $2.2B annual operating profit, below est.  —  The Kyoto-based company expects shipments of the long-awaited Switch …",
            "source": "Techmeme.com",
            "url": "https://www.techmeme.com/250508/p14",
            "publishedAt": "2025-05-08T08:25:01Z"
        },
        {
            "title": "Nintendo considering Switch 2 post-launch price rise if tariff situation worsens",
            "description": "Nintendo boss Shuntaro Furukawa has said the company will consider raising the cost of Switch 2 after the console launches, should tariffs change \"significantly\". \n Read more",
            "source": "Eurogamer.net",
            "url": "https://www.eurogamer.net/nintendo-considering-switch-2-post-launch-price-rise-if-tariff-situation-worsens",
            "publishedAt": "2025-05-08T13:46:57Z"
        },
        {
            "title": "Forget the Switch 2. Score this Switch OLED for just $280 right now",
            "description": "Yes, yes, the Nintendo Switch 2 is coming out soon. But have you seen how expensive it is? It’s bad enough that the console itself retails for $450, but AAA game pricing is also expected to shoot up—and if the tariff wars don’t de-escalate, those prices may r…",
            "source": "PCWorld",
            "url": "https://www.pcworld.com/article/2775312/forget-the-switch-2-score-this-switch-oled-for-just-280-right-now.html",
            "publishedAt": "2025-05-08T12:41:02Z"
        }
    ],
    "2025-05-15": [
        {
            "title": "Don't Expect Many Switch 2 Reviews At Launch",
            "description": "The Switch 2 is likely to be one of the biggest console launches ever, but it might be hard to find actual hands-on reviews of the device when it first comes out. That’s because Nintendo isn’t sending out early units to press and content creators, according t…",
            "source": "Kotaku",
            "url": "https://kotaku.com/switch-2-review-day-one-patch-delay-nintendo-mario-kart-1851780793",
            "publishedAt": "2025-05-15T13:55:00Z"
        },
        {
            "title": "Our Big Nintendo San Francisco Interview with Nintendo of America President Doug Bowser",
            "description": "IGN interviewed Nintendo of America President Doug Bowser to discuss the opening of Nintendo San Francisco, which is Nintendo's first public retail store on the West Coast. We also asked Bowser about Switch 2's price, if Nintendo can meet demand in the United…",
            "source": "IGN",
            "url": "https://www.ign.com/articles/our-big-nintendo-san-francisco-interview-with-nintendo-of-america-president-doug-bowser",
            "publishedAt": "2025-05-15T18:30:00Z"
        },
        {
            "title": "Palworld developers at Pocketpair showed off gliding six months prior to Nintendo’s original patent application caused drama",
            "description": "Pocketpair's Palworld showed off footage of gliding Pals six months before the Nintendo patent for the mechanic. Could this strengthen their defense?",
            "source": "Windows Central",
            "url": "https://www.windowscentral.com/gaming/pocketpair-showed-off-gliding-in-palword-six-months-prior-to-nintendos-original-patent-application",
            "publishedAt": "2025-05-15T12:30:00Z"
        },
        {
            "title": "Mario Kart World's New Unexpected Feature: Binoculars",
            "description": "Nintendo has unveiled a new feature for Mario Kart World, and it's one you might not have expected: binoculars.Revealed on the Nintendo Today app, where Nintendo regularly posts bits of news, will feature stationary binoculars you can find in specific locatio…",
            "source": "GameSpot",
            "url": "https://www.gamespot.com/articles/mario-kart-worlds-new-unexpected-feature-binoculars/1100-6531580/",
            "publishedAt": "2025-05-15T20:56:00Z"
        },
        {
            "title": "Palworld Patching Out More Gameplay Features As It Seeks To Invalidate Nintendo/Pokémon Patents",
            "description": "Though we haven’t discussed the lawsuit between Palword creator PocketPair and Nintendo and The Pokémon Co. so far this year, this turd of a suit is still going on. To the uninitiated, Palworld has long been described as “Pokémon with guns”. Due to that, lots…",
            "source": "Techdirt",
            "url": "https://www.techdirt.com/2025/05/14/palworld-patching-out-more-gameplay-features-as-it-seeks-to-invalidate-nintendo-pokemon-patents/",
            "publishedAt": "2025-05-15T03:05:47Z"
        },
        {
            "title": "Nintendo likely to become \"primary partner for third-party game publishers\" over next gen, analyst firm forecasts",
            "description": "Nintendo will likely be the \"primary partner for third-party game publishers\" on console in five years, an analyst firm has forecast, by which time Switch 2 will have hit 100m units sold.\n Read more",
            "source": "Eurogamer.net",
            "url": "https://www.eurogamer.net/nintendo-likely-to-become-primary-partner-for-third-party-game-publishers-over-next-gen-analyst-firm-forecasts",
            "publishedAt": "2025-05-15T17:15:56Z"
        },
        {
            "title": "Nintendo Switch 2 is arguably \"the most important product launch in video game history,\" analysts say, who reckon it will have sold 100 million in its first 5 years",
            "description": null,
            "source": "Yahoo Entertainment",
            "url": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_d0e0fd53-25c8-4b9f-bbf7-ba085d60794e",
            "publishedAt": "2025-05-15T13:00:00Z"
        },
        {
            "title": "Nintendo Switch 2 launch games: The games you'll be able to buy and play on June 5",
            "description": "Looking to pick up a Nintendo Switch 2 on release day? Here are the Nintendo Switch 2 launch games that you'll want to keep an eye on, including Mario Kart World.",
            "source": "TechRadar",
            "url": "https://www.techradar.com/gaming/nintendo/switch-2-launch-games",
            "publishedAt": "2025-05-15T16:10:14Z"
        },
        {
            "title": "Nintendo Switch 2 tech specs officially revealed",
            "description": "Nintendo has officially announced the technical specifications of the Switch 2. The handheld gaming console uses a custom SoC powered by Nvidia's Ampere architecture. The Switch 2 features a GPU that has […]\nThank you for being a Ghacks reader. The post Ninte…",
            "source": "Ghacks Technology News",
            "url": "https://www.ghacks.net/2025/05/15/nintendo-switch-2-tech-specs-officially-revealed/",
            "publishedAt": "2025-05-15T13:14:36Z"
        }
    ],
    "2025-05-11": [
        {
            "title": "Microsoft announced a new Surface Pro and Surface Laptop as Nintendo's legal team tried to gut Palworld and the Xbox gaming handheld leaked online",
            "description": "This week Microsoft announced a new Surface Pro 12-inch and Surface Laptop 13-inch. Palworld had to remove a feature and images of the new Xbox handheld leaked as well.",
            "source": "Windows Central",
            "url": "https://www.windowscentral.com/software-apps/microsoft-announced-a-new-surface-pro-and-surface-laptop-as-nintendos-legal-team-tried-to-gut-palworld-and-the-xbox-gaming-handheld-leaked-online",
            "publishedAt": "2025-05-11T22:12:04Z"
        }
    ]
}