{
    "2025-05-08": [
        {
            "title": "Even As Companies Retreat From Diversity Efforts, Many Quash Anti-DEI Shareholder Resolutions",
            "description": "Goldman Sachs, Pfizer, Coca-Cola and other big names have successfully blocked shareholder resolutions limiting diversity, equity and inclusion efforts. But that doesn’t mean they are DEI champions.",
            "source": "Forbes",
            "url": "https://www.forbes.com/sites/mariagraciasantillanalinares/2025/05/08/even-as-many-companies-retreat-from-diversity-efforts-they-quash-anti-dei-shareholder-resolutions/",
            "publishedAt": "2025-05-08T11:00:00Z"
        },
        {
            "title": "SLOW DEATH JABS: Pfizer Vaccine Linked to Higher All-Cause Mortality Rate than Moderna Shot",
            "description": "Every so-called “conspiracy theorist” and “anti-vaxxer” called out the Covid mRNA “clot shots” right out of the gate, warning everybody NOT to get jabbed with the Bill Gates depopulation stab that Big Pharma, Big Government, Big Media, and the New World Order…",
            "source": "Naturalnews.com",
            "url": "https://www.naturalnews.com/2025-05-08-pfizer-vaccine-linked-to-higher-all-cause-mortality-than-moderna-shot.html",
            "publishedAt": "2025-05-08T06:00:00Z"
        },
        {
            "title": "Pfizer Inc. (NYSE:PFE) Receives Average Rating of “Moderate Buy” from Brokerages",
            "description": "Shares of Pfizer Inc. (NYSE:PFE – Get Free Report) have received an average recommendation of “Moderate Buy” from the fifteen analysts that are currently covering the firm, Marketbeat reports. One equities research analyst has rated the stock with a sell rati…",
            "source": "ETF Daily News",
            "url": "https://www.etfdailynews.com/2025/05/08/pfizer-inc-nysepfe-receives-average-rating-of-moderate-buy-from-brokerages/",
            "publishedAt": "2025-05-08T05:40:04Z"
        }
    ],
    "2025-05-13": [
        {
            "title": "Drug Price Regulations: Is Pfizer Stock A Buy Or Sell?",
            "description": "Although the immediate market response was negative, most pharmaceutical stocks recovered after Wall Street analysts emphasized the considerable legal obstacles the or...",
            "source": "Forbes",
            "url": "https://www.forbes.com/sites/greatspeculations/2025/05/13/drug-price-regulations-is-pfizer-stock-a-buy-or-sell/",
            "publishedAt": "2025-05-13T12:54:06Z"
        },
        {
            "title": "Why Pfizer Inc. (PFE) Is Among the Best Pharma Stocks to Invest in Amid the Domestic Manufacturing Boom",
            "description": null,
            "source": "Yahoo Entertainment",
            "url": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_98960b31-e7e1-4c64-ba81-baeb248202ff",
            "publishedAt": "2025-05-13T21:07:27Z"
        },
        {
            "title": "Is the ‘Pfizergate’ ruling the moment von der Leyen finally gets held to account?",
            "description": "As the president of the European Commission discovers whether it was right to withhold her text messages, the court case raises broader questions about EU transparency.",
            "source": "POLITICO.eu",
            "url": "https://www.politico.eu/article/is-the-pfizergate-ruling-the-moment-von-der-leyen-finally-gets-held-to-account/",
            "publishedAt": "2025-05-13T18:23:19Z"
        },
        {
            "title": "Pfizer, Eli Lilly, and Other Pharma Stocks Fall. Questions Remain About Trump’s Executive Order",
            "description": "",
            "source": "Biztoc.com",
            "url": "https://biztoc.com/x/b9356631426ec84b",
            "publishedAt": "2025-05-13T15:29:43Z"
        },
        {
            "title": "Saudi Arabia Pharmaceutical CDMO Market Research Report 2025 Featuring Tabuk Manufacturing, Lifera, Saudi Bio, Fresenius Kabi, Hikma Pharma, Pfizer, Novartis",
            "description": "The Saudi Arabia Pharmaceutical CDMO Market, valued at USD 1.62 Billion in 2024, is projected to reach USD 2.24 Billion by 2030 with a CAGR of 5.45%. Growth is driven by rising domestic demand, health system modernization, and cost efficiency. Key players inc…",
            "source": "GlobeNewswire",
            "url": "https://www.globenewswire.com/news-release/2025/05/13/3079840/28124/en/Saudi-Arabia-Pharmaceutical-CDMO-Market-Research-Report-2025-Featuring-Tabuk-Manufacturing-Lifera-Saudi-Bio-Fresenius-Kabi-Hikma-Pharma-Pfizer-Novartis.html",
            "publishedAt": "2025-05-13T08:46:00Z"
        }
    ],
    "2025-05-12": [
        {
            "title": "Pfizer, Merck, Johnson & Johnson to lose billions to Trump's latest executive order",
            "description": "Visitors from around the world come to the United States for healthcare because the U.S. has the best healthcare in the world, if you have money. \nHowever, compared to other high-income countries, the U.S. is an anomaly in how low it ranks for health outcomes…",
            "source": "Biztoc.com",
            "url": "https://biztoc.com/x/4c27242a4cf450e3",
            "publishedAt": "2025-05-12T14:02:42Z"
        },
        {
            "title": "Amazon, Nvidia, Tesla, Alibaba, Eli Lilly, Pfizer, and More Market Movers",
            "description": "",
            "source": "Biztoc.com",
            "url": "https://biztoc.com/x/9bc41e4ba98e08ca",
            "publishedAt": "2025-05-12T11:59:04Z"
        },
        {
            "title": "These Stocks Are Moving the Most Today: Amazon, Nvidia, Tesla, Alibaba, Eli Lilly, Pfizer, and More",
            "description": "",
            "source": "Biztoc.com",
            "url": "https://biztoc.com/x/793aa17abc3038c3",
            "publishedAt": "2025-05-12T09:23:10Z"
        },
        {
            "title": "Pfizer, Eli Lilly, Merck and Other Pharma Stocks Fall as Trump Targets Lower Drug Prices",
            "description": "",
            "source": "Biztoc.com",
            "url": "https://biztoc.com/x/8d60c292eb62fa17",
            "publishedAt": "2025-05-12T11:14:52Z"
        },
        {
            "title": "Wondering if Pfizer's 7.6% Dividend Yield Is Sustainable? Here's What You Need to Know",
            "description": "In This Article:\nKey Points\n-\nPfizer can cover its dividends with free cash flow, but doesn't have a huge cushion.\n-\nThe company faces some risks from pipeline setbacks, patent expirations, and U.S. government policies.\n-\nIts dividend appears to be sustainabl…",
            "source": "Biztoc.com",
            "url": "https://biztoc.com/x/5fb24cac5e30d608",
            "publishedAt": "2025-05-12T09:34:15Z"
        },
        {
            "title": "These Stocks Are Moving the Most Today",
            "description": "Amazon.com, Nvidia, Tesla, and the rest of the Magnificent Seven stocks jump as the U.S. and China reach an agreement to temporarily slash most tariffs on each other’s goods, while Eli Lilly and Pfizer fall after President Donald Trump plans to sign an execut…",
            "source": "Biztoc.com",
            "url": "https://biztoc.com/x/3d06fa893035e735",
            "publishedAt": "2025-05-12T09:34:12Z"
        }
    ],
    "2025-05-14": [
        {
            "title": "Jim Cramer on Pfizer (PFE) – “Caught in a Vortex, but I’m Sticking with Seagen and Dr. Bourla”",
            "description": "We recently published a list of 13 Stocks on Jim Cramer’s Radar Recently. In this article, we are going to take a look at where Pfizer Inc. (NYSE:PFE) stands...",
            "source": "Yahoo Entertainment",
            "url": "https://finance.yahoo.com/news/jim-cramer-pfizer-pfe-caught-141553105.html",
            "publishedAt": "2025-05-14T14:15:53Z"
        },
        {
            "title": "Court rules on von der Leyen’s missing Covid vaccine texts",
            "description": "An EU court has ruled that the European Commission acted improperly by refusing to release communications with Pfizer to media outlets Read Full Article at RT.com",
            "source": "RT",
            "url": "https://www.rt.com/news/617514-european-commission-pfizer-texts/",
            "publishedAt": "2025-05-14T15:20:00Z"
        },
        {
            "title": "EU court annuls rejection of bid for EU's von der Leyen vaccine messages with Pfizer",
            "description": null,
            "source": "Yahoo Entertainment",
            "url": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_26efd252-0321-4659-adec-b624d429d368",
            "publishedAt": "2025-05-14T07:40:55Z"
        },
        {
            "title": "Judgment Day In EU Chief's Covid Vaccine Texts Case",
            "description": "A top court is to rule Wednesday on whether the EU failed the transparency test by declining to release text messages sent by Ursula von der Leyen to the head of Pfizer as the bloc tried to secure Covid vaccines.",
            "source": "International Business Times",
            "url": "https://www.ibtimes.com/judgment-day-eu-chiefs-covid-vaccine-texts-case-3773455",
            "publishedAt": "2025-05-14T02:45:23Z"
        },
        {
            "title": "Pfizergate: Commission broke transparency rules over von der Leyen texts, court rules",
            "description": "The European Commission wrongly dismissed a journalist's request to access texts between the president and the Pfizer CEO, the court said.",
            "source": "EURACTIV",
            "url": "https://www.euractiv.com/section/politics/news/pfizergate-commission-broke-transparency-rules-over-von-der-leyen-texts-court-rules/",
            "publishedAt": "2025-05-14T07:41:52Z"
        },
        {
            "title": "Parliament celebrates Pfizer decision as victory against Commission’s secrecy",
            "description": "After an EU court ruled that Ursula von der Leyen should have published text messages she exchanged with the CEO of Pfizer, MEPs across all party lines have welcomed the decision as a victory against the Commission's sometimes opaque information...",
            "source": "EURACTIV",
            "url": "https://www.euractiv.com/section/health-consumers/news/parliament-celebrates-pfizer-decision-as-victory-against-commissions-secrecy/",
            "publishedAt": "2025-05-14T12:56:01Z"
        },
        {
            "title": "The EU General Court rules the EU should not have denied an NYT journalist's request for text messages between Ursula von der Leyen and Pfizer CEO Albert Bourla (Jeanna Smialek/New York Times)",
            "description": "Jeanna Smialek / New York Times:\nThe EU General Court rules the EU should not have denied an NYT journalist's request for text messages between Ursula von der Leyen and Pfizer CEO Albert Bourla  —  The case revolved around whether texts between a top official…",
            "source": "Mediagazer.com",
            "url": "https://mediagazer.com/250514/p8",
            "publishedAt": "2025-05-14T11:50:00Z"
        },
        {
            "title": "European Court Rules Against von der Leyen in Transparency Case",
            "description": "The Court of Justice of the European Union has just ruled that the European Commission was wrong to reject a request from the New York Times to access messages between Ursula von der Leyen and Pfizer CEO Albert Bourla from Jan.[…] Read the rest",
            "source": "Order-order.com",
            "url": "https://order-order.com/2025/05/14/european-court-rules-against-von-der-leyen-in-transparency-case/",
            "publishedAt": "2025-05-14T08:03:24Z"
        },
        {
            "title": "Court raps Brussels for lack of transparency on von der Leyen vaccine texts",
            "description": "A top court on Wednesday ruled that the European Commission had failed the transparency test by declining to release text messages sent by Ursula von der Leyen to the head of Pfizer as the bloc tried to secure Covid vaccines.",
            "source": "Hurriyet Daily News",
            "url": "https://www.hurriyetdailynews.com/court-raps-brussels-for-lack-of-transparency-on-von-der-leyen-vaccine-texts-209169",
            "publishedAt": "2025-05-14T10:11:36Z"
        },
        {
            "title": "‘Pfizergate’ verdict: EU Commission wrong to block access to von der Leyen’s secret texts",
            "description": "General Court judgment could have huge repercussions for Commission president and transparency in general.",
            "source": "POLITICO.eu",
            "url": "https://www.politico.eu/article/pfizergate-verdict-ursula-von-der-leyen-eu-commission-wrong-secret-texts/",
            "publishedAt": "2025-05-14T07:37:40Z"
        },
        {
            "title": "'Pfizergate' verdict delivers blow to European Commission",
            "description": "A ruling by the EU’s top court over undisclosed vaccine deal messages casts a shadow over Ursula von der Leyen’s presidency and the European Commission’s commitment to transparency.",
            "source": "DW (English)",
            "url": "https://www.dw.com/en/pfizergate-verdict-delivers-blow-to-european-commission/a-72541476",
            "publishedAt": "2025-05-14T17:21:00Z"
        },
        {
            "title": "EU Commission wrong to block access to texts between Ursula von der Leyen and Pfizer CEO, ECJ rules",
            "description": "Europe's second-top court on Wednesday dismissed the European Commission's rejection of a New York Times' request to access text messages between its President Ursula von der Leyen and Pfizer CEO Albert Bourla on the purchase of billions of euros of Covid-19 …",
            "source": "Independent.ie",
            "url": "https://www.independent.ie/world-news/europe/eu-commission-wrong-to-block-access-to-texts-between-ursula-von-der-leyen-and-pfizer-ceo-ecj-rules/a793132553.html",
            "publishedAt": "2025-05-14T08:33:19Z"
        },
        {
            "title": "EU Court of Justice to rule whether EU should have released texts between Von der Leyen and Pfizer",
            "description": "Lawyers for the EU have argued the private messages did not constitute part of the vaccine negotiation.",
            "source": "TheJournal.ie",
            "url": "https://www.thejournal.ie/eu-court-of-justice-to-rule-whether-eu-should-have-released-texts-between-von-der-leyen-and-pfizer-6704294-May2025/",
            "publishedAt": "2025-05-14T07:04:17Z"
        },
        {
            "title": "Pfizer Return to Euro Market Amid Record Reverse Yankee Spree",
            "description": "",
            "source": "Biztoc.com",
            "url": "https://biztoc.com/x/5fcc35dee97c024f",
            "publishedAt": "2025-05-14T07:42:13Z"
        },
        {
            "title": "Pfizergate: Top European Court Slams Corrupt Globalist EU Chief Von der Leyen in Bombshell Ruling Over Secret Covid-19 Vaccine Procurement Texts",
            "description": "In a ruling that’s shaken the corrupt foundations of the European Union, the EU’s top court has declared that Commission President Ursula von der Leyen broke transparency rules by hiding secret text messages she exchanged with Pfizer CEO Albert Bourla—just as…",
            "source": "Thegatewaypundit.com",
            "url": "https://www.thegatewaypundit.com/2025/05/pfizergate-top-european-court-slams-corrupt-globalist-eu/",
            "publishedAt": "2025-05-14T13:30:37Z"
        },
        {
            "title": "Von der Leyen’s texts with Pfizer boss can be shared, says EU’s highest court",
            "description": "European court of justice says no ‘plausible explanation’ given for denying New York Times access to texts from pandemic\nThe EU’s highest court has cancelled a decision to withhold Ursula von der Leyen’s text messages with a pharmaceutical executive during th…",
            "source": "Biztoc.com",
            "url": "https://biztoc.com/x/63e90fb8be8dd9b5",
            "publishedAt": "2025-05-14T11:01:19Z"
        },
        {
            "title": "EU’s Von der Leyen Loses Court Fight Over Secret Pfizer Texts",
            "description": "",
            "source": "Biztoc.com",
            "url": "https://biztoc.com/x/dba8b77af66fc0f8",
            "publishedAt": "2025-05-14T08:27:14Z"
        },
        {
            "title": "Top Medical Stocks To Watch Today – May 12th",
            "description": "Eli Lilly and Company, UnitedHealth Group, Hims & Hers Health, Walmart, AbbVie, McKesson, and Pfizer are the seven Medical stocks to watch today, according to MarketBeat’s stock screener tool. Medical stocks are shares of publicly traded companies operating i…",
            "source": "ETF Daily News",
            "url": "https://www.etfdailynews.com/2025/05/14/top-medical-stocks-to-watch-today-may-12th/",
            "publishedAt": "2025-05-14T06:38:42Z"
        },
        {
            "title": "Judgment day in EU chief’s Covid vaccine texts case",
            "description": "A top court is to rule Wednesday on whether the EU failed the transparency test by declining to release text messages sent by Ursula von der Leyen to the head of Pfizer as the bloc tried to secure Covid vaccines. The case before the Court of Justice of the Eu…",
            "source": "Digital Journal",
            "url": "https://www.digitaljournal.com/world/judgment-day-in-eu-chiefs-covid-vaccine-texts-case/article",
            "publishedAt": "2025-05-14T02:42:21Z"
        }
    ],
    "2025-05-16": [
        {
            "title": "EU queen Ursula preached transparency – then did backdoor deals with Big Pharma",
            "description": "The scandal around Pfizer texts and Covid jabs is giving von der Leyen a taste of her own medicine Read Full Article at RT.com",
            "source": "RT",
            "url": "https://www.rt.com/news/617598-ursula-pfizer-vaccine-court/",
            "publishedAt": "2025-05-16T11:36:02Z"
        },
        {
            "title": "Judge rules Kansas vaccine lawsuit against Pfizer must proceed in state court",
            "description": "U.S. District Judge Daniel D. Crabtree has allowed Kansas’s lawsuit against Pfizer to proceed in state court, rejecting Pfizer’s attempt to move the case to federal court under the PREP Act, which shields vaccine manufacturers from liability for injuries. The…",
            "source": "Naturalnews.com",
            "url": "https://www.naturalnews.com/2025-05-16-kansas-vaccine-lawsuit-to-proceed-in-state-court.html",
            "publishedAt": "2025-05-16T06:00:00Z"
        },
        {
            "title": "Pfizer’s election meddling exposed: Top scientists weaponized science to sway the 2020 vote, so they could benefit from unlawful mandates",
            "description": "In the high-stakes world of corporate power and political manipulation, few revelations strike as deeply as the allegation that Pfizer executives deliberately slowed COVID-19 vaccine trials to influence the 2020 U.S. election. Newly uncovered testimony sugges…",
            "source": "Naturalnews.com",
            "url": "https://www.naturalnews.com/2025-05-16-pfizers-election-meddling-exposed.html",
            "publishedAt": "2025-05-16T06:00:00Z"
        },
        {
            "title": "House Judiciary Investigating Whether Pfizer Delayed Vaccine Data To Influence 2020 Election Results",
            "description": "The House Judiciary Committee is investigating whether Pfizer intentionally delayed releasing COVID vaccine results to influence the 2020 presidential election.",
            "source": "The Daily Caller",
            "url": "https://dailycaller.com/2025/05/16/house-judiciary-jim-jordan-investigating-pfizer-covid-vaccine-delay-election-interference-philip-dormitzer/",
            "publishedAt": "2025-05-16T19:23:39Z"
        },
        {
            "title": "Hidden betrayal: Moderna and Pfizer shots hijack immune cells to rewrite mRNA, prolonging spike protein production",
            "description": "For years, health authorities assured the public that mRNA COVID-19 vaccines were a temporary intervention — delivering a brief genetic message before harmlessly fading away. But a shocking new study published in Nature reveals a far darker reality: These sho…",
            "source": "Naturalnews.com",
            "url": "https://www.naturalnews.com/2025-05-16-moderna-pfizer-shots-hijack-immune-cells.html",
            "publishedAt": "2025-05-16T06:00:00Z"
        },
        {
            "title": "Moderna & Pfizer Shots Hijack Immune Cells To Rewrite mRNA, Prolonging Spike Protein Production",
            "description": "For years, health authorities assured the public that mRNA COVID-19 vaccines were a temporary intervention, delivering a brief genetic message before harmlessly fading away. But a shocking new study published in Nature reveals a far darker reality: These shot…",
            "source": "Shtfplan.com",
            "url": "https://www.shtfplan.com/headline-news/moderna-pfizer-shots-hijack-immune-cells-to-rewrite-mrna-prolonging-spike-protein-production",
            "publishedAt": "2025-05-16T22:30:12Z"
        },
        {
            "title": "Alopecia Areata: Market Trends, Regulatory Framework, Clinical Trial Analysis, Epidemiology Analysis, Market Dynamics, Competitive Landscape 2025-2035",
            "description": "Includes Detailed Profiles of Industry Giants Eli Lilly & Company, Pfizer, Sun Pharmaceutical Industries, Arcutis Biotherapeutics, Bristol-Myers Squibb, AbbVie, Regeneron Pharmaceuticals, and Aclaris Therapeutics Includes Detailed Profiles of Industry Giants …",
            "source": "GlobeNewswire",
            "url": "https://www.globenewswire.com/news-release/2025/05/16/3083156/28124/en/Alopecia-Areata-Market-Trends-Regulatory-Framework-Clinical-Trial-Analysis-Epidemiology-Analysis-Market-Dynamics-Competitive-Landscape-2025-2035.html",
            "publishedAt": "2025-05-16T13:37:00Z"
        },
        {
            "title": "Landmark Court Ruling Against Von der Leyen in Pfizergate Trial",
            "description": "EU Commission President Ursula von der Leyen, and the institution she represents, have just suffered the first legal setback in the ongoing “Pfizergate” scandal.\nEarlier today, the EU’s General Court, part of the EU Court of Justice, the highest …\nThe post La…",
            "source": "Globalresearch.ca",
            "url": "https://www.globalresearch.ca/landmark-ruling-von-der-leyen-pfizergate/5887261",
            "publishedAt": "2025-05-16T07:03:22Z"
        },
        {
            "title": "House GOP requests records from Pfizer CEO and former executive in probe of Covid vaccine delay allegation",
            "description": "",
            "source": "Biztoc.com",
            "url": "https://biztoc.com/x/7781eef017d71b6d",
            "publishedAt": "2025-05-16T20:03:40Z"
        },
        {
            "title": "“New Information Suggests Senior Pfizer Executives Conspired to Delay COVID-19 Vaccine Clinical Testing to Influence 2020 Election”",
            "description": "Here is one link. And more. And some CNN coverage. One of the few conspiracy theories I believe in.\nAnd hey people, do you know why this, if it is true, is a real crime? Because the vaccines worked and saved many, many lives.\nTalk to some vaccine scientists i…",
            "source": "Biztoc.com",
            "url": "https://biztoc.com/x/6827adc74168e99e",
            "publishedAt": "2025-05-16T03:59:38Z"
        }
    ],
    "2025-05-09": [
        {
            "title": "If You Invested $10K In Pfizer Stock 10 Years Ago, How Much Would You Have Now?",
            "description": null,
            "source": "Yahoo Entertainment",
            "url": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_9abeb20b-0bd9-4465-aab7-fa149d0492e5",
            "publishedAt": "2025-05-09T02:01:50Z"
        },
        {
            "title": "Spike protein found in stroke victims’ brains up to 17 months after injection, study reveals",
            "description": "A shocking new peer-reviewed study has exposed the lingering dangers of mRNA COVID-19 vaccines, revealing that spike protein—the toxic byproduct of Pfizer and Moderna’s experimental shots—was found in the brains of stroke victims up to 17 months after vaccina…",
            "source": "Naturalnews.com",
            "url": "https://www.naturalnews.com/2025-05-09-spike-protein-found-in-stroke-victims-brains-17-months-after-injection.html",
            "publishedAt": "2025-05-09T06:00:00Z"
        },
        {
            "title": "Pfizer (NYSE:PFE) Hasn’t Been This Cheap in 13 Years. Time to Buy?",
            "description": "Pfizer (NYSE:PFE) is one of the world’s largest pharmaceutical companies, but at $22.59 per share as of this writing, the stock trades at its lowest levels in 13 years. Shares are down 19% over the past year and 63% from its December 2021 peak of $52.61 per s…",
            "source": "Biztoc.com",
            "url": "https://biztoc.com/x/09e53b2e36815663",
            "publishedAt": "2025-05-09T15:38:20Z"
        }
    ],
    "2025-05-10": [
        {
            "title": "Is Pfizer Inc. (PFE) the Best High-Yield Dividend Stock for 2025 and Beyond?",
            "description": null,
            "source": "Yahoo Entertainment",
            "url": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_008c0bc9-2d88-41ac-af6e-0a14f28c2c35",
            "publishedAt": "2025-05-10T08:17:13Z"
        },
        {
            "title": "Manufacturing Stocks To Consider – May 8th",
            "description": "D-Wave Quantum, Taiwan Semiconductor Manufacturing, Exxon Mobil, Pfizer, ServiceNow, GE Vernova, and Salesforce are the seven Manufacturing stocks to watch today, according to MarketBeat’s stock screener tool. Manufacturing stocks, often called inventory, com…",
            "source": "ETF Daily News",
            "url": "https://www.etfdailynews.com/2025/05/10/manufacturing-stocks-to-consider-may-8th/",
            "publishedAt": "2025-05-10T06:03:14Z"
        }
    ],
    "2025-05-15": [
        {
            "title": "House Panel Investigating Timing on Pfizer Vaccine",
            "description": "\"Lawmakers are investigating whether Pfizer waited to share results of the Covid vaccine in 2020 until after that year’s presidential election, based on new allegations that a former Pfizer scientist has said he was part",
            "source": "Politicalwire.com",
            "url": "https://politicalwire.com/2025/05/15/house-panel-investigating-timing-on-pfizer-vaccine/",
            "publishedAt": "2025-05-15T15:29:40Z"
        },
        {
            "title": "EU’s Secret Messages With Pfizer: Weaponized COVID Vaccines",
            "description": "A court has ruled that the European Commission has acted \"improperly\" by not being transparent with the slave class's media outlets. The secret message between Pfizer and Ursula von der Leyen should have been made available to journalists sooner, as the globa…",
            "source": "Shtfplan.com",
            "url": "https://www.shtfplan.com/headline-news/eus-secret-messages-with-pfizer-weaponized-covid-vaccines",
            "publishedAt": "2025-05-15T17:30:05Z"
        },
        {
            "title": "EU court exposes secret Pfizer deal, orders von der Leyen and Bourla to reveal concealed texts",
            "description": "Behind closed doors, in the shadows of bureaucratic power, a multi-billion-dollar deal was struck—not through formal negotiations, but through private text messages between European Commission President Ursula von der Leyen and Pfizer CEO Albert Bourla. Now, …",
            "source": "Naturalnews.com",
            "url": "https://www.naturalnews.com/2025-05-15-eu-conspired-with-pfizer-ceo-texts-must-be-revealed.html",
            "publishedAt": "2025-05-15T06:00:00Z"
        },
        {
            "title": "Starboard Slashes Pfizer Stake After Botched Activist Challenge",
            "description": "",
            "source": "Biztoc.com",
            "url": "https://biztoc.com/x/e9a468ca3f73b96c",
            "publishedAt": "2025-05-15T21:31:59Z"
        },
        {
            "title": "New Allegations About Timing of Pfizer Covid Vaccine Passed to House Panel",
            "description": "",
            "source": "Biztoc.com",
            "url": "https://biztoc.com/x/2690452aea5522aa",
            "publishedAt": "2025-05-15T23:34:09Z"
        },
        {
            "title": "Bavencio (Avelumab) Markets, 2019-2024, 2024-2029F, 2034F",
            "description": "Major players operating in the bavencio (avelumab) market are Merck & Co. Inc., Pfizer Inc. North America was the largest region in the bavencio(avelumab) market in 2024. The regions covered in bavencio (avelumab) report are Asia-Pacific, Western Europe, East…",
            "source": "GlobeNewswire",
            "url": "https://www.globenewswire.com/news-release/2025/05/15/3082314/28124/en/Bavencio-Avelumab-Markets-2019-2024-2024-2029F-2034F.html",
            "publishedAt": "2025-05-15T13:51:00Z"
        },
        {
            "title": "Court rejects European Commission’s refusal to share texts between von der Leyen and Pfizer CEO during COVID pandemic",
            "description": "A top European court ruled on Wednesday that the European Commission was wrong to refuse The New York Times access to text messages sent between President Ursula von der Leyen and a pharmaceutical boss during the COVID-19 pandemic.\nThe case highlights ongoing…",
            "source": "Biztoc.com",
            "url": "https://biztoc.com/x/634be0b27fe83b01",
            "publishedAt": "2025-05-15T08:59:53Z"
        }
    ],
    "2025-05-11": [
        {
            "title": "Pfizer (NYSE:PFE) Shares Unloaded Rep. Jefferson Shreve",
            "description": "Representative Jefferson Shreve (R-Indiana) recently sold shares of Pfizer Inc. (NYSE:PFE). In a filing disclosed on May 08th, the Representative disclosed that they had sold between $15,001 and $50,000 in Pfizer stock on April 11th. The trade occurred in the…",
            "source": "ETF Daily News",
            "url": "https://www.etfdailynews.com/2025/05/11/pfizer-nysepfe-shares-unloaded-rep-jefferson-shreve/",
            "publishedAt": "2025-05-11T06:04:49Z"
        }
    ]
}