{
    "2025-05-15": [
        {
            "title": "Qualcomm launches the Snapdragon 7 Gen 4 with improved AI performance and connectivity",
            "description": "Qualcomm is refreshing the Snapdragon 7 chip with drastically-improved AI performance, faster Bluetooth and Wi-Fi connectivity, and a whole lot more.",
            "source": "Android Central",
            "url": "https://www.androidcentral.com/phones/qualcomm/qualcomm-launches-snapdragon-7-gen-4",
            "publishedAt": "2025-05-15T13:00:00Z"
        },
        {
            "title": "A Qualcomm job listing suggests Xbox is working on next-gen Arm-based hardware — but what's the truth? Here's what our sources say.",
            "description": "A Qualcomm job listing suggests Xbox is working on next-gen Arm-based hardware — but what's the truth?",
            "source": "Windows Central",
            "url": "https://www.windowscentral.com/gaming/xbox/a-qualcomm-job-listing-suggests-xbox-is-working-on-next-gen-arm-based-hardware-but-whats-the-truth-heres-what-our-sources-say",
            "publishedAt": "2025-05-15T16:42:09Z"
        },
        {
            "title": "Qualcomm’s latest Snapdragon chip brings Wi-Fi audio to the mid-range",
            "description": "Qualcomm has announced the Snapdragon 7 Gen 4 processor, and it brings Wi-Fi audio capabilities and more to mid-range phones.",
            "source": "Android Authority",
            "url": "https://www.androidauthority.com/qualcomm-snapdragon-7-gen-4-3557455/",
            "publishedAt": "2025-05-15T13:00:39Z"
        },
        {
            "title": "Qualcomm Announces Snapdragon 7 Gen 4 With a Big Jump in AI Power",
            "description": "The next chip of choice for upper-midrange devices has arrived on the scene.",
            "source": "TalkAndroid",
            "url": "https://www.talkandroid.com/506956-snapdragon-7-gen-4/",
            "publishedAt": "2025-05-15T17:00:00Z"
        },
        {
            "title": "Qualcomm launches Snapdragon 7 Gen 4 with a big jump in AI performance",
            "description": "Qualcomm hasn’t forgotten about the mid-range SoC, and the new Snapdragon 7 Gen 4 proves that the company is still trying to bring faster and smarter AI to more devices. The Sanpdragon 7 Gen 4 makes several key improvements in performance over the previous ge…",
            "source": "9to5google.com",
            "url": "http://9to5google.com/2025/05/15/qualcomm-snapdragon-7-gen-4/",
            "publishedAt": "2025-05-15T15:32:46Z"
        },
        {
            "title": "Qualcomm Upgrades its Affordable-Flagship Snapdragon Chipset",
            "description": "Qualcomm today announced the Snapdragon 7 Gen 4 Mobile Platform, a replacement for its existing Snapdragon 7 Gen 3 chip for high-end (but not quite top-end) phones. The new Gen 4 chip offers a 65% improvement in AI performance, 30% faster graphics (GPU) rende…",
            "source": "Phonescoop.com",
            "url": "https://www.phonescoop.com/articles/article.php?a=23517",
            "publishedAt": "2025-05-15T13:00:00Z"
        },
        {
            "title": "Qualcomm’s Snapdragon 7 Gen 4 chip is a multimedia powerhouse",
            "description": "Qualcomm has announced the Snapdragon 7 Gen 4 mobile platform. This isn’t one of the company’s flagship processors, but it’s definitely a solid option. The 7 Gen 4 offers 27 per cent increase in CPU performance, 30 per cent faster GPU rendering, and a 65 per …",
            "source": "MobileSyrup",
            "url": "https://mobilesyrup.com/2025/05/15/qualcomm-snapdragon-7-gen-4/",
            "publishedAt": "2025-05-15T13:00:46Z"
        },
        {
            "title": "Snapdragon 7 Gen 4 brings big AI energy to phones that aren’t quite flagship",
            "description": "On Thursday, Qualcomm announced the Snapdragon 7 Gen 4. This is their sort-of mid-premium chipset, which you'd find in phones over $500 usually. Qualcomm",
            "source": "Android Headlines",
            "url": "https://www.androidheadlines.com/2025/05/qualcomm-snapdragon-7-gen-4",
            "publishedAt": "2025-05-15T12:59:38Z"
        },
        {
            "title": "(PR) Qualcomm Unveils the Snapdragon 7 Gen 4 Mobile Platform",
            "description": "Qualcomm Technologies, Inc. today unveiled the latest addition to its 7-series lineup - the Snapdragon 7 Gen 4 Mobile Platform. This brand-new platform is designed to enhance users' favorite multimedia experiences and deliver robust performance across the boa…",
            "source": "Techpowerup.com",
            "url": "https://www.techpowerup.com/336821/qualcomm-unveils-the-snapdragon-7-gen-4-mobile-platform",
            "publishedAt": "2025-05-15T17:33:14Z"
        }
    ],
    "2025-05-11": [
        {
            "title": "A guide to Nvidia's competitors: AMD, Qualcomm, Broadcom, startups, and more are vying to compete in the AI chip market",
            "description": "Despite Nvidia's AI semiconductor dominance, competitors are innovating to challenge its lead. Read about AMD, Qualcomm, Broadcom, Amazon, and more.",
            "source": "Business Insider",
            "url": "https://www.businessinsider.com/nvidia-competitors",
            "publishedAt": "2025-05-11T08:57:02Z"
        }
    ],
    "2025-05-16": [
        {
            "title": "Nothing Phone 3 leak points to a top-tier Qualcomm chip, flagship cameras, and massive battery",
            "description": "Nothing is gearing up to launch its first true-flagship, and a new leak has revealed some details about the much-awaited Nothing Phone 3.",
            "source": "Android Authority",
            "url": "https://www.androidauthority.com/nothing-phone-3-early-leak-3558429/",
            "publishedAt": "2025-05-16T11:46:24Z"
        },
        {
            "title": "Qualcomm Snapdragon 7 Gen 4 announced",
            "description": "Qualcomm announced its Snapdragon 7 Gen 4 (SM7750-AB) chipset as a direct successor to the Snapdragon 7 Gen 3 from 2023. As you’d expect, the new 4nm chip offers sizeable performance gains over its two-year-old predecessor, including faster CPU, GPU and NPU.\n…",
            "source": "GSMArena.com",
            "url": "https://www.gsmarena.com/qualcomm_snapdragon_7_gen_4_announced_-news-67815.php",
            "publishedAt": "2025-05-16T08:49:02Z"
        },
        {
            "title": "Snapdragon 7 Gen 4 brings big CPU and GPU upgrades",
            "description": "Qualcomm’s Snapdragon 7 Gen 4 offers faster CPU, 30% GPU gains, and 65% better AI performance. Expect phones from Honor, vivo, and realme.\nThe post Snapdragon 7 Gen 4 brings big CPU and GPU upgrades appeared first on Phandroid.",
            "source": "Phandroid - News for Android",
            "url": "https://phandroid.com/2025/05/16/snapdragon-7-gen-4-brings-big-cpu-and-gpu-upgrades/",
            "publishedAt": "2025-05-16T11:29:09Z"
        },
        {
            "title": "Lenovo Thinkbook 16 X1 Plus Laptop Sees Linux Patches But Not Yet Ready For Daily Use",
            "description": "Device Tree patches have been posted for enabling Linux support on the Lenovo Thinkbook 16 G7 QOY powered by the Qualcomm Snapdragon X1 Plus SoC...",
            "source": "Phoronix",
            "url": "https://www.phoronix.com/news/Thinkbook-16-X1-Plus-Linux",
            "publishedAt": "2025-05-16T04:00:00Z"
        },
        {
            "title": "Xiaomi's self-developed smartphone chipset has a name and a release date",
            "description": "Back in November, Xiaomi was said to be working on its very own self-developed smartphone chipset, in order to reduce its reliance on Qualcomm and MediaTek. This was then rumored to arrive this year, and today Xiaomi CEO Lei Jun has confirmed the news.\n\nIn a …",
            "source": "GSMArena.com",
            "url": "https://www.gsmarena.com/xiaomis_selfdeveloped_smartphone_chipset_has_a_name_and_a_release_date-news-67811.php",
            "publishedAt": "2025-05-16T09:47:02Z"
        },
        {
            "title": "Arm’s ubiquitous CPU cores get new, less confusing names",
            "description": "As the CPU designer who stands behind customers like Qualcomm, Arm has never really needed a charismatic brand. But the company has decided upon a new naming scheme that’s easier to remember.\r\n\n\n\n\nOver the last year or so, Arm has chosen the dreadful “CSS for…",
            "source": "PCWorld",
            "url": "https://www.pcworld.com/article/2784646/arms-ubiquitous-cpu-cores-get-new-less-confusing-names.html",
            "publishedAt": "2025-05-16T18:39:34Z"
        },
        {
            "title": "Android Circuit: Galaxy S25 Edge Released, Pixel 10 Pro Tensor Secrets, Qualcomm’s Flagship Killer",
            "description": "This week’s Android headlines; Galaxy S25 Edge launch, leaked Galaxy Z Flip7 details, secrets of Pixel 10 Pro chipset, Qualcomm’s flagship killer option, Honor Magic V3 details, and a change for Google’s G.",
            "source": "Forbes",
            "url": "https://www.forbes.com/sites/ewanspence/2025/05/16/android-news-headlines-samsung-galaxy-s25-edge-pixel-10-pro-tensor-g5-honor-magic-v3/",
            "publishedAt": "2025-05-16T19:35:22Z"
        },
        {
            "title": "Qualcomm Snapdragon 7 Gen 4 unveiled",
            "description": "The Qualcomm Snapdragon 7 Gen 4 (SM7750-AB) chipset has been unveiled, directly succeeding the Snapdragon 7 Gen 3 from 2023. This is a 4nm chip offering notable performance gains compared to its predecessor. This includes speed boosts to its CPU, GPU, and NPU…",
            "source": "Yugatech.com",
            "url": "https://www.yugatech.com/mobile/qualcomm-snapdragon-7-gen-4-unveiled/",
            "publishedAt": "2025-05-16T13:57:43Z"
        },
        {
            "title": "Qualcomm Unveils the Snapdragon 7 Gen 4 Mobile Platform",
            "description": "Qualcomm Technologies, Inc. today unveiled the latest addition to its 7-series lineup – the Snapdragon 7 Gen 4 Mobile Platform. This brand-new platform is designed to enhance users’ favorite multimedia experiences and deliver robust performance across the boa…",
            "source": "Madshrimps.be",
            "url": "https://www.madshrimps.be/news/qualcomm-unveils-the-snapdragon-7-gen-4-mobile-platform/",
            "publishedAt": "2025-05-16T07:21:36Z"
        }
    ],
    "2025-05-12": [
        {
            "title": "UK extends deadline for Qualcomm to make offer for Alphawave",
            "description": "Qualcomm has been granted until May 27 to pursue a potential acquisition of Alphawave IP Group, whose valuable SerDes technology also drew interest from Arm Holdings before it ended its takeover attempt.",
            "source": "Tom's Hardware UK",
            "url": "https://www.tomshardware.com/pc-components/cpus/uk-extends-deadline-for-qualcomm-to-make-offer-for-alphawave",
            "publishedAt": "2025-05-12T20:46:52Z"
        },
        {
            "title": "Early OnePlus 15 specs emerge",
            "description": "Qualcomm is rumored to launch its next flagship smartphone chipset earlier than last year, which means the next crop of Android flagships may also have to alter their release schedule. A new report from tipster Digital Chat Station suggests that a OnePlus 15 …",
            "source": "GSMArena.com",
            "url": "https://www.gsmarena.com/early_oneplus_15_specs_emerge_-news-67732.php",
            "publishedAt": "2025-05-12T12:53:02Z"
        },
        {
            "title": "Qualcomm Advances AI Push via Alphawave Extension",
            "description": null,
            "source": "Yahoo Entertainment",
            "url": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_e6db1228-4e8f-40db-8aac-59f5785546d0",
            "publishedAt": "2025-05-12T19:56:20Z"
        },
        {
            "title": "Was Jim Cramer Right About QUALCOMM Incorporated (QCOM)?",
            "description": "We recently published a list of Jim Cramer’s 9 Failed Predictions From 12 Months Ago. In this article, we are going to take a look at where QUALCOMM...",
            "source": "Yahoo Entertainment",
            "url": "https://finance.yahoo.com/news/jim-cramer-qualcomm-incorporated-qcom-204606388.html",
            "publishedAt": "2025-05-12T20:46:06Z"
        },
        {
            "title": "Samsung and Apple are both ditching Qualcomm and for good reason",
            "description": "Both phone giants agree that Qualcomm is a financial burden.",
            "source": "PhoneArena",
            "url": "https://www.phonearena.com/news/samsung-apple-ditching-qualcomm-for-good-reason_id170266",
            "publishedAt": "2025-05-12T00:31:46Z"
        }
    ],
    "2025-05-13": [
        {
            "title": "Canonical Provides Status Update For Snapdragon X Elite Laptops On Ubuntu 25.04",
            "description": "Canonical provided a status update concerning the Qualcomm Snapdragon X Elite powered laptops on the recently released Ubuntu 25.04...",
            "source": "Phoronix",
            "url": "https://www.phoronix.com/news/Ubuntu-25.04-Snapdragon-X1E",
            "publishedAt": "2025-05-13T09:47:19Z"
        },
        {
            "title": "Xiaomi is working on a new phone powered by the Snapdragon 8s Gen 4",
            "description": "Xiaomi is currently working on a new phone that will allegedly be powered by Qualcomm's recently unveiled Snapdragon 8s Gen 4. The Redmi sub-brand has already used it in the Turbo 4 Pro, but now it's the main Xiaomi brand's turn, it seems.\n\nThe chipset will b…",
            "source": "GSMArena.com",
            "url": "https://www.gsmarena.com/xiaomi_is_working_on_a_new_phone_powered_by_the_snapdragon_8s_gen_4-news-67745.php",
            "publishedAt": "2025-05-13T01:09:02Z"
        },
        {
            "title": "Samsung Galaxy S25 Edge is a thinner flagship (with a smaller battery)",
            "description": "The Samsung Galaxy S25 Edge is a smartphone with flagship-class specs including a 6.7 inch, 120 Hz OLED display, a Qualcomm Snapdragon 8 Elite for Galaxy processor, 12GB of RAM, and up to 512GB of storage. It’s also one of the thinnest and lightest large-scre…",
            "source": "Liliputing",
            "url": "https://liliputing.com/samsung-galaxy-s25-edge-is-a-thinner-flagship-with-a-smaller-battery/",
            "publishedAt": "2025-05-13T15:53:53Z"
        },
        {
            "title": "Compal and Qualcomm unveil world's first Snapdragon X-powered AI whiteboard at Computex 2025",
            "description": "Compal Electronics, in partnership with Qualcomm, has launched the world's first AI-powered electronic whiteboard equipped with the Snapdragon X processor, set to debut at Computex 2025. This groundbreaking product merges Compal's hardware design and manufact…",
            "source": "Digitimes",
            "url": "https://www.digitimes.com/news/a20250513PD230/qualcomm-compal-partnership-snapdragon.html",
            "publishedAt": "2025-05-13T06:19:23Z"
        }
    ],
    "2025-05-08": [
        {
            "title": "Qualcomm Snapdragon X Elite Benchmarks On Ubuntu Linux vs. AMD vs. Intel",
            "description": "June 2024 marked the launch of the Qualcomm Snapdragon X Elite to much initial fanfare for finally some compelling ARM laptop designs. While initially -- and still to this day with the likes of the TUXEDO X Elite laptop not materializing yet -- being focused …",
            "source": "Phoronix",
            "url": "https://www.phoronix.com/review/snapdragon-x-elite-linux-benchmarks",
            "publishedAt": "2025-05-08T12:30:00Z"
        },
        {
            "title": "Qualcomm throws shade at Intel in new laptop ads – and it's spicy",
            "description": "Qualcomm's laptop ad war begins, and Intel's getting roasted.",
            "source": "PhoneArena",
            "url": "https://www.phonearena.com/news/qualcomm-throws-shade-at-intel-in-new-laptop-ads_id170168",
            "publishedAt": "2025-05-08T07:34:23Z"
        }
    ],
    "2025-05-10": [
        {
            "title": "QUALCOMM Incorporated (QCOM): One of the Best Income Stocks to Invest in Now",
            "description": null,
            "source": "Yahoo Entertainment",
            "url": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_ceda622a-2b31-4d65-81b9-cca9f9682841",
            "publishedAt": "2025-05-10T08:14:47Z"
        }
    ],
    "2025-05-14": [
        {
            "title": "Is QUALCOMM Incorporated  (QCOM) the Tech Stock That Trump’s Fellow Republican Bought Amid Market Rout?",
            "description": null,
            "source": "Yahoo Entertainment",
            "url": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_1f802b10-6197-496e-bdd8-ae3879d85157",
            "publishedAt": "2025-05-14T17:04:38Z"
        },
        {
            "title": "Samsung secures orders from Nintendo, paving way for future orders from Nvidia and Qualcomm",
            "description": "Samsung Electronics' foundry division is actively pursuing orders for its 2nm process technology and is currently conducting process evaluations with major clients, including Nvidia and Qualcomm.",
            "source": "Digitimes",
            "url": "https://www.digitimes.com/news/a20250514PD217/samsung-nintendo-switch-2nm-nvidia-qualcomm.html",
            "publishedAt": "2025-05-14T04:34:50Z"
        },
        {
            "title": "(PR) Qualcomm & HUMAIN to Develop State-of-the-Art AI Data Centers",
            "description": "Qualcomm Technologies, Inc., a technology leader enabling connected intelligent computing, and HUMAIN, a national artificial intelligence (AI) champion advancing Saudi Arabia's goals for AI, today signed a Memorandum of Understanding (MOU) with the intent to …",
            "source": "Techpowerup.com",
            "url": "https://www.techpowerup.com/336772/qualcomm-humain-to-develop-state-of-the-art-ai-data-centers",
            "publishedAt": "2025-05-14T16:37:38Z"
        }
    ],
    "2025-05-09": [
        {
            "title": "QUALCOMM Incorporated (QCOM): Among Billionaire Ray Dalio’s Bridgewater’s Stock Picks with Huge Upside Potential",
            "description": null,
            "source": "Yahoo Entertainment",
            "url": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_b36c34e2-faa6-4f4b-b00b-24afc16a4d07",
            "publishedAt": "2025-05-09T07:19:04Z"
        },
        {
            "title": "Qualcomm throws shade at Intel in new ads",
            "description": "Qualcomm is making waves with a new set of fun, lighthearted ads aimed at Intel. These ads claim that Qualcomm’s new Snapdragon X Elite processor ...\nThe post Qualcomm throws shade at Intel in new ads appeared first on Gizchina.com.",
            "source": "Gizchina.com",
            "url": "https://www.gizchina.com/2025/05/09/qualcomm-throws-shade-at-intel-in-new-ads/",
            "publishedAt": "2025-05-09T10:57:27Z"
        }
    ]
}