{
    "2025-05-15": [
        {
            "title": "Tata's pride losing the spark: Why TCS is faring worst among IT peers and group leaders",
            "description": "Tata Consultancy Services is facing challenges. It is underperforming compared to its peers like Infosys and HCL Tech. Global economic uncertainty and client-specific issues are affecting TCS. The BSNL contract ramp-down is also impacting revenue. Analysts ar…",
            "source": "The Times of India",
            "url": "https://economictimes.indiatimes.com/markets/stocks/news/tatas-pride-losing-the-spark-why-tcs-is-faring-worst-among-it-peers-and-group-leaders/articleshow/121177192.cms",
            "publishedAt": "2025-05-15T04:37:08Z"
        },
        {
            "title": "TCS joins world’s top 50 most valuable brands with $57.3 bn valuation",
            "description": "Tata Consultancy Services (TCS) has been ranked among the world’s top 100 most valuable brands in the Kantar BrandZ Most Valuable Global Brands 2025 Report, with a brand value of $57.3 billion and a 28% year-on-year growth.",
            "source": "The Times of India",
            "url": "https://economictimes.indiatimes.com/news/company/corporate-trends/tcs-joins-worlds-top-50-most-valuable-brands-with-57-3-bn-valuation/articleshow/121178061.cms",
            "publishedAt": "2025-05-15T05:30:02Z"
        }
    ],
    "2025-05-12": [
        {
            "title": "Swamy Ramajayam on modern practices on data & analytics transformation and modernization",
            "description": "Swamy Ramajayam has earned a reputation as one of the most influential data leaders in the financial and technology sectors. With a career spanning Tata Consultancy Services, IBM, Capital One, Charles Schwab, and Ally Financial, he has spearheaded some of the…",
            "source": "Digital Journal",
            "url": "https://www.digitaljournal.com/tech-science/swamy-ramajayam-on-modern-practices-on-data-analytics-transformation-and-modernization/article",
            "publishedAt": "2025-05-12T17:19:11Z"
        }
    ],
    "2025-05-16": [
        {
            "title": "How Tata Consultancy Services uses marathons to win over B2B decision-makers",
            "description": "We catch up with Abhinav Kumar, global CMO of TCS, in New York and hear all about the brand’s all-in embrace of mass-participation sports​.At the end of the TCS New York City Marathon, one of the company’s clients crossed the finish line holding hands with hi…",
            "source": "The Drum",
            "url": "https://www.thedrum.com/news/2025/05/16/how-tata-consultancy-services-uses-marathons-win-over-b2b-decision-makers",
            "publishedAt": "2025-05-16T14:25:00Z"
        }
    ]
}