{
    "2025-05-13": [
        {
            "title": "TotalEnergies looking to sell stakes in Europe biogas units, Bloomberg says",
            "description": null,
            "source": "Yahoo Entertainment",
            "url": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_2da58b7e-0509-423e-844e-a35f9dc4a117",
            "publishedAt": "2025-05-13T15:10:39Z"
        },
        {
            "title": "TotalEnergies (NYSE:TTE) Upgraded by Morgan Stanley to “Overweight” Rating",
            "description": "Morgan Stanley upgraded shares of TotalEnergies (NYSE:TTE – Free Report) from an equal weight rating to an overweight rating in a research report sent to investors on Monday, MarketBeat reports. Morgan Stanley currently has $60.80 price objective on the stock…",
            "source": "ETF Daily News",
            "url": "https://www.etfdailynews.com/2025/05/13/totalenergies-nysette-upgraded-by-morgan-stanley-to-overweight-rating/",
            "publishedAt": "2025-05-13T05:48:54Z"
        },
        {
            "title": "3 High-Yield Oil Stocks to Buy With $1,000 and Hold Forever",
            "description": "In This Article:\nKey Points\n-\nChevron has a 5% yield and is diversified across the oil sector.\n-\nTotalEnergies has a 6.5% yield and is expanding its oil business in a new, cleaner direction.\n-\nEnbridge has a 5.8% yield and operates in the most reliable segmen…",
            "source": "Biztoc.com",
            "url": "https://biztoc.com/x/cb48dbebe6f24963",
            "publishedAt": "2025-05-13T09:32:01Z"
        },
        {
            "title": "Offshore Oil Exploration Booms in Namibia with Key Decisions Looming",
            "description": "Namibia expects France’s TotalEnergies and Norway’s BW Energy to take final investment decisions on oil projects offshore the African country in late 2026, a senior Namibian official says.    TotalEnergies is expected to submit this summer a field development…",
            "source": "OilPrice.com",
            "url": "https://oilprice.com/Latest-Energy-News/World-News/Offshore-Oil-Exploration-Booms-in-Namibia-with-Key-Decisions-Looming.html",
            "publishedAt": "2025-05-13T13:05:16Z"
        }
    ],
    "2025-05-15": [
        {
            "title": "Piper Sandler Forecasts Strong Price Appreciation for TotalEnergies (NYSE:TTE) Stock",
            "description": "TotalEnergies (NYSE:TTE – Get Free Report) had its price target raised by analysts at Piper Sandler from $62.00 to $65.00 in a research note issued on Tuesday, Marketbeat reports. The firm presently has a “neutral” rating on the stock. Piper Sandler’s price o…",
            "source": "ETF Daily News",
            "url": "https://www.etfdailynews.com/2025/05/15/piper-sandler-forecasts-strong-price-appreciation-for-totalenergies-nysette-stock/",
            "publishedAt": "2025-05-15T07:02:44Z"
        }
    ],
    "2025-05-09": [
        {
            "title": "BP shares rise on report Exxon, Chevron and rivals eyeing oil major",
            "description": "Chevron, Exxon Mobil and TotalEnergies are among other big oil companies that could be considering a deal for BP, a report said Friday.",
            "source": "Biztoc.com",
            "url": "https://biztoc.com/x/83efae02809a5419",
            "publishedAt": "2025-05-09T10:48:07Z"
        },
        {
            "title": "More Than One Oil Major Has “Run the Numbers” on a BP Acquisition",
            "description": "Half a dozen Big Oil companies have “run the numbers” on a potential BP acquisition, the Financial Times has reported, citing unnamed industry sources. Shell has got all the headlines as a potential suitor for BP, but Exxon, Chevron, TotalEnergies, and Adnoc …",
            "source": "OilPrice.com",
            "url": "https://oilprice.com/Energy/Energy-General/More-Than-One-Oil-Major-Has-Run-the-Numbers-on-a-BP-Acquisition.html",
            "publishedAt": "2025-05-09T12:09:16Z"
        }
    ],
    "2025-05-14": [
        {
            "title": "Why Is TotalEnergies Stock Trading Lower On Wednesday?",
            "description": "TotalEnergies SE (NYSE:TTE) shares are trading lower on Wednesday after the company disclosed that it has agreed with HitecVision, a Norwegian energy investment firm, to sell a 50% stake in Polska Grupa Biogazowa (PGB) for an enterprise value of 190 million e…",
            "source": "Biztoc.com",
            "url": "https://biztoc.com/x/2797e501b9a418b1",
            "publishedAt": "2025-05-14T16:12:28Z"
        },
        {
            "title": "TotalEnergies to Sell 50% Stake in Polish Biogas Unit to HitecVision",
            "description": "TotalEnergies SE agreed to sell a 50% stake in its Polish biogas production business to Norwegian investment firm HitecVision AS as part of the oil major’s strategy to boost return on its renewables investments.",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/business-pmn/totalenergies-to-sell-50-stake-in-polish-biogas-unit-to-hitecvision",
            "publishedAt": "2025-05-14T09:55:42Z"
        },
        {
            "title": "TotalEnergies agrees to sell 50% of Polish biogas firm PGB to Norway's HitecVision",
            "description": "",
            "source": "Biztoc.com",
            "url": "https://biztoc.com/x/954a9d1069cbdbc5",
            "publishedAt": "2025-05-14T09:09:49Z"
        }
    ],
    "2025-05-12": [
        {
            "title": "TotalEnergies looking to sell stakes in Europe biogas units, Bloomberg says",
            "description": "See the rest of the story here.\n\nthefly.com provides the latest financial news as it breaks. Known as a leader in market intelligence, The Fly's real-time, streaming news feed keeps individual investors, professional money managers, active traders, and corpor…",
            "source": "Thefly.com",
            "url": "https://thefly.com/permalinks/entry.php/id4127975/TTE-TotalEnergies-looking-to-sell-stakes-in-Europe-biogas-units-Bloomberg-says",
            "publishedAt": "2025-05-12T15:05:47Z"
        }
    ],
    "2025-05-11": [
        {
            "title": "Is a Big Oil Megamerger Brewing? Exxon, Chevron, and Others Are Eyeing This Oil Stock",
            "description": "In This Article:\nKey Points\n-\nBP's underperformance and strategy shifts have made it a potential takeover target.\n-\nShell, Chevron, Exxon, TotalEnergies, and others have looked into acquiring the oil company.\n-\nA takeover of BP might be difficult.\nA consolida…",
            "source": "Biztoc.com",
            "url": "https://biztoc.com/x/e2f5bf6bf3983932",
            "publishedAt": "2025-05-11T20:01:41Z"
        }
    ]
}